
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>2.2 颜色模型及颜色空间 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="2.3.html" />
    
    
    <link rel="prev" href="2.1.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    编程设计系统
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="0.html">
            
                <a href="0.html">
            
                    
                    0.什么是设计系统
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    1.形状
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="1.1.html">
            
                <a href="1.1.html">
            
                    
                    1.1 图形基础
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="1.2.html">
            
                <a href="1.2.html">
            
                    
                    1.2 基本形状
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="1.3.html">
            
                <a href="1.3.html">
            
                    
                    1.3 定制形状
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="1.4.html">
            
                <a href="1.4.html">
            
                    
                    1.4 程序形状
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    2.颜色
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="2.1.html">
            
                <a href="2.1.html">
            
                    
                    2.1 颜色理论的小历史
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4.2" data-path="2.2.html">
            
                <a href="2.2.html">
            
                    
                    2.2 颜色模型及颜色空间
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="2.3.html">
            
                <a href="2.3.html">
            
                    
                    2.3 感知颜色空间的一致性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4" data-path="2.4.html">
            
                <a href="2.4.html">
            
                    
                    2.4 配色方案
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" >
            
                <span>
            
                    
                    3.布局
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="3.1.html">
            
                <a href="3.1.html">
            
                    
                    3.1 几何图形简史
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" >
            
                <span>
            
                    
                    未完持续更新...
            
                </span>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >2.2 颜色模型及颜色空间</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x989C;&#x8272;&#x6A21;&#x578B;&#x53CA;&#x989C;&#x8272;&#x7A7A;&#x95F4;">&#x989C;&#x8272;&#x6A21;&#x578B;&#x53CA;&#x989C;&#x8272;&#x7A7A;&#x95F4;</h2>
<p>&#x4E0A;&#x4E00;&#x7AE0;&#x56DE;&#x987E;&#x4E86;&#x5386;&#x53F2;&#x4E0A;&#x8272;&#x5F69;&#x7406;&#x8BBA;&#x7684;&#x4E00;&#x4E9B;&#x91CD;&#x8981;&#x53D1;&#x5C55;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x672C;&#x7AE0;&#x66F4;&#x6DF1;&#x5165;&#x5730;&#x7814;&#x7A76;&#x4E86;&#x5F53;&#x524D;&#x6570;&#x5B57;&#x8272;&#x5F69;&#x7406;&#x8BBA;&#x7684;&#x73B0;&#x72B6;&#x3002;&#x5F53;&#x5728;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#x4F7F;&#x7528;&#x989C;&#x8272;&#x65F6;&#xFF0C;&#x4EBA;&#x4EEC;&#x4F1A;&#x9047;&#x5230;&#x76F8;&#x5F53;&#x591A;&#x7684;&#x672F;&#x8BED;&#x6765;&#x63CF;&#x8FF0;&#x989C;&#x8272;&#x5728;&#x8272;&#x8C31;&#x4E2D;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x8FD9;&#x4E9B;&#x672F;&#x8BED;&#x901A;&#x5E38;&#x53EF;&#x4EE5;&#x4E92;&#x6362;&#x4F7F;&#x7528;&#x3002;&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x7814;&#x7A76;&#x5176;&#x4E2D;&#x7684;&#x4E09;&#x4E2A;&#x672F;&#x8BED;&#x2014;&#x989C;&#x8272;&#x6A21;&#x578B;&#x3001;&#x989C;&#x8272;&#x7A7A;&#x95F4;&#x548C;&#x989C;&#x8272;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x2014; &#x5E76;&#x7814;&#x7A76;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x4F7F;&#x7528;&#x989C;&#x8272;&#x65F6;&#x5BF9;&#x8FD9;&#x4E9B;&#x6982;&#x5FF5;&#x8FDB;&#x884C;&#x6B63;&#x786E;&#x7406;&#x89E3;&#x7684;&#x91CD;&#x8981;&#x6027;&#x3002;</p>
<h3 id="&#x989C;&#x8272;&#x6A21;&#x578B;">&#x989C;&#x8272;&#x6A21;&#x578B;</h3>
<p>&#x8981;&#x7406;&#x89E3;&#x4E8B;&#x7269;&#x7684;&#x672C;&#x8D28;&#xFF0C;&#x521B;&#x5EFA;&#x4E3B;&#x9898;&#x7684;&#x89C6;&#x89C9;&#x8868;&#x793A;&#x662F;&#x5F88;&#x6709;&#x5E2E;&#x52A9;&#x7684;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x4EBA;&#x4EEC;&#x7ECF;&#x5E38;&#x503E;&#x5411;&#x4E8E;&#x8FD9;&#x6837;&#x505A;&#xFF0C;&#x4ECE;&#x5728;&#x8BFE;&#x5802;&#x4E0A;&#x4E71;&#x5199;&#x7B14;&#x8BB0;&#xFF0C;&#x5230;&#x7ED8;&#x5236;&#x56FE;&#x8868;&#x548C;&#x5730;&#x56FE;&#x6765;&#x89E3;&#x91CA;&#x7279;&#x5B9A;&#x7684;&#x6570;&#x636E;&#x96C6;&#x3002;&#x6211;&#x4EEC;&#x8FD9;&#x4E48;&#x505A;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x5F88;&#x591A;&#x4EBA;&#x90FD;&#x662F;&#x89C6;&#x89C9;&#x5B66;&#x4E60;&#x8005;&#xFF0C;&#x770B;&#x5230;&#x7684;&#x4E1C;&#x897F;&#x548C;&#x542C;&#x5230;&#x7684;&#x4E1C;&#x897F;&#x662F;&#x4E0D;&#x540C;&#x7684;&#x3002;&#x7EB5;&#x89C2;&#x5386;&#x53F2;&#xFF0C;&#x827A;&#x672F;&#x5BB6;&#x548C;&#x79D1;&#x5B66;&#x5BB6;&#x4EEC;&#x7528;&#x5404;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x6A21;&#x578B;&#x6765;&#x63CF;&#x7ED8;&#x8272;&#x8C31;&#xFF0C;&#x76EE;&#x7684;&#x662F;&#x5C06;&#x8272;&#x8C31;&#x7684;&#x62BD;&#x8C61;&#x6982;&#x5FF5;&#x8F6C;&#x5316;&#x4E3A;&#x53EF;&#x7406;&#x89E3;&#x7684;&#x4E1C;&#x897F;&#x3002;</p>
<p>&#x989C;&#x8272;&#x6A21;&#x578B;&#x662F;&#x5C06;&#x8272;&#x8C31;&#x63CF;&#x8FF0;&#x4E3A;&#x591A;&#x7EF4;&#x6A21;&#x578B;&#x7684;&#x53EF;&#x89C6;&#x5316;&#x3002;&#x5927;&#x591A;&#x6570;&#x73B0;&#x4EE3;&#x989C;&#x8272;&#x6A21;&#x578B;&#x90FD;&#x6709;3&#x4E2A;&#x7EF4;&#x5EA6;(&#x5982;RGB)&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x88AB;&#x63CF;&#x8FF0;&#x4E3A;3D&#x5F62;&#x72B6;&#xFF0C;&#x800C;&#x5176;&#x4ED6;&#x6A21;&#x578B;&#x6709;&#x66F4;&#x591A;&#x7EF4;&#x5EA6;(&#x5982;CMYK)&#x3002;&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x7814;&#x7A76;RGB&#x3001;HSV&#x548C;HSL&#x989C;&#x8272;&#x6A21;&#x578B;&#xFF0C;&#x5B83;&#x4EEC;&#x5728;&#x5F53;&#x524D;&#x7684;&#x6570;&#x5B57;&#x8BBE;&#x8BA1;&#x5DE5;&#x5177;&#x548C;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#x90FD;&#x5F88;&#x6D41;&#x884C;&#x3002;&#x8FD9;&#x4E9B;&#x989C;&#x8272;&#x6A21;&#x578B;&#x90FD;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;RGB&#x539F;&#x8272;&#xFF0C;&#x8FD9;&#x4F7F;&#x5B83;&#x4EEC;&#x6210;&#x4E3A;&#x989C;&#x8272;&#x6A21;&#x578B;&#x5982;&#x4F55;&#x5728;&#x5E7F;&#x6CDB;&#x4E0D;&#x540C;&#x7684;&#x7EF4;&#x5EA6;&#x4E0A;&#x53EF;&#x89C6;&#x5316;&#x76F8;&#x540C;&#x989C;&#x8272;&#x5149;&#x8C31;&#x7684;&#x597D;&#x4F8B;&#x5B50;&#x3002;</p>
<p><strong><em>RGB</em></strong>&#x662F;&#x4E00;&#x79CD;&#x989C;&#x8272;&#x6A21;&#x578B;&#xFF0C;&#x5177;&#x6709;&#x4E09;&#x4E2A;&#x7EF4;&#x5EA6; - &#x7EA2;&#x8272;&#xFF0C;&#x7EFF;&#x8272;&#x548C;&#x84DD;&#x8272; - &#x6DF7;&#x5408;&#x4EE5;&#x4EA7;&#x751F;&#x7279;&#x5B9A;&#x989C;&#x8272;&#x3002; &#x5F53;&#x5728;&#x8FD9;&#x4E9B;&#x7EAC;&#x5EA6;&#x4E2D;&#x5B9A;&#x4E49;&#x989C;&#x8272;&#x65F6;&#xFF0C;&#x5FC5;&#x987B;&#x77E5;&#x9053;&#x989C;&#x8272;&#x5149;&#x8C31;&#x4E2D;&#x7684;&#x989C;&#x8272;&#x5E8F;&#x5217;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C; 100&#xFF05;&#x7EA2;&#x8272;&#x548C;&#x7EFF;&#x8272;&#x7684;&#x6DF7;&#x5408;&#x7269;&#x4F1A;&#x4EA7;&#x751F;&#x9EC4;&#x8272;&#x3002; RGB&#x989C;&#x8272;&#x6A21;&#x578B;&#x901A;&#x5E38;&#x901A;&#x8FC7;&#x5C06;&#x7EA2;&#x8272;&#xFF0C;&#x7EFF;&#x8272;&#x548C;&#x84DD;&#x8272;&#x5C3A;&#x5BF8;&#x6620;&#x5C04;&#x5230;3D&#x7A7A;&#x95F4;&#x4E2D;&#x7684;x&#xFF0C;y&#x548C;z&#x8F74;&#x4E0A;&#x800C;&#x88AB;&#x63CF;&#x7ED8;&#x4E3A;&#x7ACB;&#x65B9;&#x4F53;&#x3002; &#x8FD9;&#x5728;&#x4E0B;&#x9762;&#x7684;&#x4EA4;&#x4E92;&#x5F0F;&#x793A;&#x4F8B;&#x4E2D;&#x8FDB;&#x884C;&#x4E86;&#x8BF4;&#x660E;&#xFF0C;&#x5176;&#x4E2D;&#x5728;&#x591A;&#x7EF4;&#x6570;&#x636E;&#x96C6;&#x7684;&#x8FB9;&#x754C;&#x5185;&#x8868;&#x793A;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x7684;&#x989C;&#x8272;&#x6DF7;&#x5408;&#x3002;</p>
<p>&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#xFF0C;&#x7528;&#x4E8E;&#x521B;&#x5EFA;&#x989C;&#x8272;&#x7684;RGB&#x989C;&#x8272;&#x6A21;&#x578B;&#x5E76;&#x975E;&#x6700;&#x7279;&#x522B;&#x76F4;&#x89C2;&#x7684;&#x6A21;&#x578B;&#x3002; &#x867D;&#x7136;&#x4F60;&#x53EF;&#x4EE5;&#x731C;&#x6D4B;&#x7528;&#x4E8E;&#x67D0;&#x4E9B;&#x989C;&#x8272;&#x7684;&#x503C;&#x7684;&#x7EC4;&#x5408;&#xFF0C;&#x4F8B;&#x5982;&#x9EC4;&#x8272;&#xFF08;&#x7B49;&#x91CF;&#x7684;&#x7EA2;&#x8272;&#x548C;&#x7EFF;&#x8272;&#xFF09;&#x6216;&#x53EF;&#x53E3;&#x53EF;&#x4E50;&#x74F6;&#x4E0A;&#x4F7F;&#x7528;&#x7684;&#x7EA2;&#x8272;&#xFF08;&#x5927;&#x91CF;&#x7684;&#x7EA2;&#x8272;&#x548C;&#x4E00;&#x70B9;&#x70B9;&#x84DD;&#x8272;&#xFF09;&#xFF0C; &#x5728;&#x8FD9;&#x4E2A;&#x989C;&#x8272;&#x6A21;&#x578B;&#x4E2D;&#xFF0C;&#x7EAF;&#x8272;&#x66F4;&#x96BE;&#x4EE5;&#x731C;&#x6D4B;&#x3002; &#x4F60;&#x4F1A;&#x7528;&#x4EC0;&#x4E48;&#x503C;&#x6765;&#x8868;&#x793A;&#x6DF1;&#x7D2B;&#x8272;&#xFF1F; &#x5982;&#x4F55;&#x627E;&#x5230;&#x9752;&#x8272;&#x7684;&#x4E92;&#x8865;&#x8272;&#xFF1F; &#x5982;&#x679C;&#x627E;&#x4E0D;&#x5230;&#x7B54;&#x6848;&#xFF0C;&#x90A3;&#x662F;&#x56E0;&#x4E3A;&#x4EBA;&#x7C7B;&#x4E0D;&#x8BA4;&#x4E3A;&#x989C;&#x8272;&#x662F;&#x7EA2;&#x8272;&#xFF0C;&#x7EFF;&#x8272;&#x548C;&#x84DD;&#x8272;&#x5149;&#x6DF7;&#x5408;&#x800C;&#x6765;&#x3002;</p>
<p><strong><em>HSV</em></strong>&#x662F;&#x4E00;&#x4E2A;&#x5706;&#x67F1;&#x4F53;&#x7684;&#x989C;&#x8272;&#x6A21;&#x578B;&#xFF0C;&#x5B83;&#x5C06;RGB&#x539F;&#x8272;&#x91CD;&#x65B0;&#x6620;&#x5C04;&#x6210;&#x66F4;&#x6613;&#x4E8E;&#x4EBA;&#x7C7B;&#x7406;&#x89E3;&#x7684;&#x7EF4;&#x5EA6;&#x3002;&#x548C;&#x8499;&#x585E;&#x5C14;&#x8272;&#x5F69;&#x7CFB;&#x7EDF;&#x4E00;&#x6837;&#xFF0C;&#x8FD9;&#x4E9B;&#x7EF4;&#x5EA6;&#x5206;&#x522B;&#x662F;&#x8272;&#x8C03;&#x3001;&#x9971;&#x548C;&#x5EA6;&#x548C;&#x503C;&#x3002;</p>
<ul>
<li><em>&#x8272;&#x8C03;</em>&#x6307;&#x5B9A;&#x989C;&#x8272;&#x5728;RGB&#x989C;&#x8272;&#x5706;&#x4E0A;&#x7684;&#x89D2;&#x5EA6;&#x3002;0&#xB0;&#x7684;&#x8272;&#x8C03;&#x4EE3;&#x8868;&#x7EA2;&#x8272;&#xFF0C;120&#xB0;&#x4EE3;&#x8868;&#x7EFF;&#x8272;&#xFF0C;240&#xB0;&#x4EE3;&#x8868;&#x84DD;&#x8272;&#x3002;</li>
<li><em>&#x9971;&#x548C;&#x5EA6;</em>&#x63A7;&#x5236;&#x989C;&#x8272;&#x7684;&#x4F7F;&#x7528;&#x91CF;&#x3002;&#x4E00;&#x4E2A;100%&#x9971;&#x548C;&#x5EA6;&#x7684;&#x989C;&#x8272;&#x5C06;&#x662F;&#x6700;&#x7EAF;&#x51C0;&#x7684;&#x989C;&#x8272;&#xFF0C;&#x800C;0%&#x9971;&#x548C;&#x5EA6;&#x4EA7;&#x751F;&#x7070;&#x5EA6;&#x3002;</li>
<li><em>&#x503C;</em>&#x63A7;&#x5236;&#x989C;&#x8272;&#x7684;&#x4EAE;&#x5EA6;&#x3002;&#x4EAE;&#x5EA6;&#x4E3A;0%&#x7684;&#x989C;&#x8272;&#x4E3A;&#x7EAF;&#x9ED1;&#x8272;&#xFF0C;&#x800C;&#x4EAE;&#x5EA6;&#x4E3A;100%&#x7684;&#x989C;&#x8272;&#x5219;&#x4E0D;&#x63BA;&#x6742;&#x9ED1;&#x8272;&#x3002;&#x7531;&#x4E8E;&#x8FD9;&#x4E2A;&#x7EF4;&#x5EA6;&#x901A;&#x5E38;&#x88AB;&#x79F0;&#x4E3A;&#x4EAE;&#x5EA6;&#xFF0C;HSV&#x989C;&#x8272;&#x6A21;&#x578B;&#x6709;&#x65F6;&#x88AB;&#x79F0;&#x4E3A;HSB&#xFF0C;&#x5305;&#x62EC;&#x5728;P5.js&#x4E2D;&#x3002;</li>
</ul>
<p>&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;HSV&#x989C;&#x8272;&#x6A21;&#x578B;&#x7684;&#x4E09;&#x4E2A;&#x7EF4;&#x5EA6;&#x662F;&#x76F8;&#x4E92;&#x4F9D;&#x8D56;&#x7684;&#x3002;&#x5982;&#x679C;&#x989C;&#x8272;&#x7684;&#x503C;&#x7EF4;&#x88AB;&#x8BBE;&#x7F6E;&#x4E3A;0%&#xFF0C;&#x8272;&#x8C03;&#x548C;&#x9971;&#x548C;&#x5EA6;&#x7684;&#x7528;&#x91CF;&#x5E76;&#x4E0D;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x989C;&#x8272;&#x5C06;&#x662F;&#x9ED1;&#x8272;&#x3002;&#x540C;&#x6837;&#x5730;&#xFF0C;&#x5982;&#x679C;&#x989C;&#x8272;&#x7684;&#x9971;&#x548C;&#x5EA6;&#x8BBE;&#x7F6E;&#x4E3A;0%&#xFF0C;&#x8272;&#x8C03;&#x5E76;&#x4E0D;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x6CA1;&#x6709;&#x4F7F;&#x7528;&#x989C;&#x8272;&#x3002;&#x56E0;&#x4E3A;&#x8272;&#x8C03;&#x7EF4;&#x5EA6;&#x662F;&#x5706;&#x5F62;&#x7684;&#xFF0C;&#x6240;&#x4EE5;HSV&#x989C;&#x8272;&#x6A21;&#x578B;&#x6700;&#x597D;&#x4EE5;&#x5706;&#x67F1;&#x6765;&#x4F53;&#x63CF;&#x8FF0;&#x3002;&#x8FD9;&#x5728;&#x4E0B;&#x9762;&#x7684;&#x4EA4;&#x4E92;&#x5F0F;&#x793A;&#x4F8B;&#x4E2D;&#x8FDB;&#x884C;&#x4E86;&#x8BF4;&#x660E;&#xFF0C;&#x5176;&#x4E2D;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x7684;&#x989C;&#x8272;&#x6DF7;&#x5408;&#x90FD;&#x8868;&#x793A;&#x5728;&#x5706;&#x67F1;&#x4F53;&#x7684;&#x8FB9;&#x754C;&#x5185;&#x3002;</p>
<p><strong><em>HSL</em></strong>&#x662F;&#x53E6;&#x4E00;&#x79CD;&#x4E0E;HSV&#x5177;&#x6709;&#x4E24;&#x4E2A;&#x7EF4;&#x5EA6;&#x7684;&#x5706;&#x67F1;&#x5F62;&#x989C;&#x8272;&#x6A21;&#x578B;&#xFF0C;&#x540C;&#x65F6;&#x7528;&#x4EAE;&#x5EA6;&#x7EF4;&#x5EA6;&#x66FF;&#x4EE3;&#x4E86;&#x503C;&#x7EF4;&#x5EA6;&#x3002;</p>
<ul>
<li><em>&#x8272;&#x8C03;</em>&#x5728;RGB&#x989C;&#x8272;&#x5706;&#x4E0A;&#x6307;&#x5B9A;&#x7684;&#x989C;&#x8272;&#x89D2;&#x5EA6;&#xFF0C;&#x4E0E;HSV&#x5B8C;&#x5168;&#x76F8;&#x540C;&#x3002;</li>
<li><em>&#x9971;&#x548C;&#x5EA6;</em>&#x63A7;&#x5236;&#x989C;&#x8272;&#x7684;&#x7EAF;&#x5EA6;&#xFF0C;&#x5C31;&#x50CF;HSV&#x4E00;&#x6837;&#x3002;</li>
<li><em>&#x4EAE;&#x5EA6;</em>&#x63A7;&#x5236;&#x989C;&#x8272;&#x7684;&#x4EAE;&#x5EA6;&#x3002;&#x8FD9;&#x4E2A;&#x7EF4;&#x5EA6;&#x4E0D;&#x540C;&#x4E8E;HSV&#x503C;&#x7EF4;&#x5EA6;&#xFF0C;&#x56E0;&#x4E3A;&#x6700;&#x7EAF;&#x7CB9;&#x7684;&#x989C;&#x8272;&#x4F4D;&#x4E8E;&#x6807;&#x5C3A;&#x7684;&#x9ED1;&#x767D;&#x4E24;&#x7AEF;&#x4E4B;&#x95F4;&#x3002;0%&#x4EAE;&#x5EA6;&#x7684;&#x989C;&#x8272;&#x662F;&#x9ED1;&#x8272;&#xFF0C;50%&#x662F;&#x6700;&#x7EAF;&#x7684;&#x989C;&#x8272;&#xFF0C;100%&#x662F;&#x767D;&#x8272;&#x3002;</li>
</ul>
<p>&#x867D;&#x7136;&#x7406;&#x8BBA;&#x4E0A;&#x4E24;&#x79CD;&#x989C;&#x8272;&#x6A21;&#x578B;&#x7684;&#x9971;&#x548C;&#x5EA6;&#x7EF4;&#x5EA6;&#x76F8;&#x4F3C;(&#x63A7;&#x5236;&#x4F7F;&#x7528;&#x591A;&#x5C11;&#x7EAF;&#x8272;)&#xFF0C;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x4EAE;&#x5EA6;&#x5230;&#x4EAE;&#x5EA6;&#x7684;&#x91CD;&#x65B0;&#x6620;&#x5C04;&#xFF0C;&#x5BFC;&#x81F4;&#x6A21;&#x578B;&#x4E4B;&#x95F4;&#x7684;&#x9971;&#x548C;&#x5EA6;&#x5C3A;&#x5EA6;&#x4E0D;&#x540C;&#x3002;&#x4E0E;HSV&#x4E00;&#x6837;&#xFF0C;HSL&#x989C;&#x8272;&#x6A21;&#x578B;&#x4E5F;&#x6700;&#x597D;&#x4EE5;&#x5706;&#x67F1;&#x6765;&#x4F53;&#x63CF;&#x8FF0;&#xFF0C;&#x5982;&#x4E0B;&#x9762;&#x7684;&#x4EA4;&#x4E92;&#x5F0F;&#x793A;&#x4F8B;&#x6240;&#x793A;&#x3002;</p>
<p>&#x5728;&#x591A;&#x7EF4;&#x7A7A;&#x95F4;&#x4E2D;&#xFF0C;&#x6709;&#x8BB8;&#x591A;&#x5176;&#x4ED6;&#x7684;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x53EF;&#x89C6;&#x5316;&#x8272;&#x8C31;&#x3002;CMYK&#x989C;&#x8272;&#x6A21;&#x578B;&#x6709;&#x56DB;&#x4E2A;&#x7EF4;&#x5EA6;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5FC5;&#x987B;&#x4F7F;&#x7528;&#x52A8;&#x753B;&#x6216;&#x591A;&#x4E2A;3D&#x5F62;&#x72B6;&#x6765;&#x53EF;&#x89C6;&#x5316;&#x6A21;&#x578B;&#x7684;&#x72B6;&#x6001;&#x3002;&#x53E6;&#x4E00;&#x79CD;&#x88AB;&#x79F0;&#x4E3A;CIELAB&#x7684;&#x989C;&#x8272;&#x6A21;&#x578B;&#x662F;&#x57FA;&#x4E8E;&#x4EBA;&#x7C7B;&#x611F;&#x77E5;&#x7684;&#x62EE;&#x6297;&#x7406;&#x8BBA;&#x5EFA;&#x7ACB;&#x7684;&#xFF0C;&#x5B83;&#x6709;&#x4E24;&#x4E2A;&#x4E09;&#x7EF4;&#x7A7A;&#x95F4;&#xFF0C;&#x5206;&#x522B;&#x4EE3;&#x8868;&#x4ECE;&#x7EA2;&#x5230;&#x7EFF;&#x3001;&#x4ECE;&#x9EC4;&#x5230;&#x84DD;&#x7684;&#x5C3A;&#x5EA6;&#x2014;&#x2014;&#x8FD9;&#x662F;&#x4EBA;&#x7C7B;&#x65E0;&#x6CD5;&#x540C;&#x65F6;&#x611F;&#x77E5;&#x7684;&#x4E24;&#x5BF9;&#x4E92;&#x8865;&#x8272;&#x3002;</p>
<h3 id="&#x989C;&#x8272;&#x7A7A;&#x95F4;">&#x989C;&#x8272;&#x7A7A;&#x95F4;</h3>
<p>&#x989C;&#x8272;&#x6A21;&#x578B;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x5F88;&#x597D;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x5C06;&#x8272;&#x8C31;&#x53EF;&#x89C6;&#x5316;&#xFF0C;&#x4F46;&#x5F53;&#x5B83;&#x4EEC;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x5C4F;&#x5E55;&#x4E0A;&#x7528;&#x6765;&#x5B9A;&#x4E49;&#x548C;&#x5C55;&#x793A;&#x989C;&#x8272;&#x7684;&#x65F6;&#x5019;&#x662F;&#x4E0D;&#x591F;&#x7684;&#x3002;&#x4E3A;&#x4E86;&#x89E3;&#x91CA;&#x8FD9;&#x70B9;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x4F60;&#x62E5;&#x6709;&#x4E00;&#x53F0;&#x7B14;&#x8BB0;&#x672C;&#x7535;&#x8111;&#xFF0C;&#x4EE5;&#x53CA;&#x4E00;&#x4E2A;&#x7528;&#x4E8E;&#x5BB6;&#x5EAD;&#x529E;&#x516C;&#x7684;&#x66F4;&#x5927;&#x7684;&#x5916;&#x7F6E;&#x5C4F;&#x5E55;&#x3002;&#x73B0;&#x5728;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x4E5F;&#x5047;&#x8BBE;&#x4F60;&#x5728;&#x8FD0;&#x884C;P5.js&#x8349;&#x56FE;&#x5728;&#x4E24;&#x4E2A;&#x5C4F;&#x5E55;&#x4E0A;&#x6765;&#x5C55;&#x793A;&#x9EC4;&#x8272;&#x692D;&#x5706;&#x3002;&#x5728;&#x6CA1;&#x6709;&#x8272;&#x5F69;&#x7A7A;&#x95F4;&#x7684;&#x73AF;&#x5883;&#x4E0B;&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x5C4F;&#x5E55;&#x5C06;&#x6253;&#x5F00;&#x5B83;&#x4EEC;&#x7684;&#x7EA2;&#x8272;&#x548C;&#x7EFF;&#x8272;&#x5B50;&#x50CF;&#x7D20;&#x5C31;&#x5B8C;&#x4E86;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x66F4;&#x5927;&#x7684;&#x5C4F;&#x5E55;&#x4E0A;&#x88C5;&#x6709;&#x66F4;&#x6602;&#x8D35;&#x7684;&#x706F;&#x7BA1;&#xFF0C;&#x8FD9;&#x548C;&#x4F60;&#x7684;&#x7B14;&#x8BB0;&#x672C;&#x7535;&#x8111;&#x5C4F;&#x5E55;&#x7684;&#x5149;&#x7BA1;&#x770B;&#x8D77;&#x6765;&#x5927;&#x4E0D;&#x76F8;&#x540C;&#x600E;&#x4E48;&#x529E;&#xFF1F;&#x8FD9;&#x5C06;&#x4EA7;&#x751F;&#x4E24;&#x79CD;&#x622A;&#x7136;&#x4E0D;&#x540C;&#x7684;&#x9EC4;&#x8272;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x989C;&#x8272;&#x7A7A;&#x95F4;&#x8981;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p><img src="CIE&#x8272;&#x5EA6;&#x56FE;&#x663E;&#x793A;&#x4E86;Adobe RGB&#xFF08;1998&#xFF09;&#x548C;sRGB&#x989C;&#x8272;&#x7A7A;&#x95F4;&#x7684;&#x8272;&#x57DF;" alt="https://www.programmingdesignsystems.com/assets/color/color-models-and-color-spaces/colorspaces.jpg"></p>
<p>&#x8FD9;&#x4E2A;&#x8272;&#x5EA6;&#x56FE;&#x662F;&#x7531;&#x56FD;&#x9645;&#x7167;&#x660E;&#x59D4;&#x5458;&#x4F1A;(CIE)&#x521B;&#x5EFA;&#x7684;&#x3002;&#x5B83;&#x57FA;&#x4E8E;20&#x4E16;&#x7EAA;30&#x5E74;&#x4EE3;&#x5BF9;&#x4EBA;&#x7C7B;&#x8FDB;&#x884C;&#x7684;&#x4E00;&#x7CFB;&#x5217;&#x89C6;&#x89C9;&#x5B9E;&#x9A8C;&#xFF0C;&#x51C6;&#x786E;&#x5730;&#x5B9A;&#x4E49;&#x4E86;&#x989C;&#x8272;&#x7684;&#x6CE2;&#x957F;&#x4E0E;&#x4EBA;&#x773C;&#x611F;&#x77E5;&#x6548;&#x679C;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x3002;&#x8FD9;&#x4E2A;&#x56FE;&#x2014;&#x2014;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x79F0;&#x4E3A;CIEXYZ&#x7684;&#x989C;&#x8272;&#x7A7A;&#x95F4;&#x2014;&#x2014;&#x975E;&#x5E38;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x6240;&#x6709;&#x73B0;&#x4EE3;&#x989C;&#x8272;&#x7A7A;&#x95F4;&#x90FD;&#x5B9A;&#x4E49;&#x4E86;&#x4E0E;&#x8FD9;&#x4E2A;&#x989C;&#x8272;&#x7A7A;&#x95F4;&#x76F8;&#x5173;&#x7684;&#x989C;&#x8272;&#x7684;&#x7EDD;&#x5BF9;&#x8303;&#x56F4;(&#x79F0;&#x4E3A;&#x8272;&#x57DF;)&#x3002;&#x66F2;&#x7EBF;&#x5F62;&#x72B6;&#x5185;&#x7684;&#x4E24;&#x4E2A;&#x4E09;&#x89D2;&#x5F62;&#x8868;&#x793A;&#x4E24;&#x4E2A;&#x6D41;&#x884C;&#x989C;&#x8272;&#x7A7A;&#x95F4;&#x7684;&#x8272;&#x57DF;:sRGB&#x548C;Adobe RGB(1998)&#x3002;&#x6BCF;&#x4E2A;&#x4E09;&#x89D2;&#x5F62;&#x7684;&#x89D2;&#x5B9A;&#x4E49;&#x4E86;&#x6BCF;&#x4E2A;&#x8272;&#x57DF;&#x7684;&#x539F;&#x8272;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x6CE8;&#x610F;&#x5230;&#xFF0C;&#x867D;&#x7136;&#x8FD9;&#x4E24;&#x4E2A;&#x989C;&#x8272;&#x7A7A;&#x95F4;&#x5171;&#x4EAB;&#x76F8;&#x540C;&#x7684;&#x7EA2;&#x8272;&#x548C;&#x84DD;&#x8272;&#x539F;&#x8272;&#xFF0C;&#x4F46;&#x8FD9;&#x4E24;&#x4E2A;&#x989C;&#x8272;&#x7A7A;&#x95F4;&#x4E4B;&#x95F4;&#x7684;&#x7EFF;&#x8272;&#x539F;&#x8272;&#x662F;&#x4E0D;&#x540C;&#x7684;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x539F;&#x8272;&#x53EA;&#x6709;&#x5728;&#x6D89;&#x53CA;&#x5230;&#x7279;&#x5B9A;&#x7684;&#x989C;&#x8272;&#x7A7A;&#x95F4;&#x65F6;&#x624D;&#x5177;&#x6709;&#x7EDD;&#x5BF9;&#x610F;&#x4E49;&#x3002;&#x5728;&#x4E0A;&#x9762;&#x7684;&#x793A;&#x4F8B;&#x4E2D;&#xFF0C;&#x989C;&#x8272;&#x7A7A;&#x95F4;&#x5141;&#x8BB8;&#x60A8;&#x7684;&#x4E24;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x663E;&#x793A;&#x5668;&#x901A;&#x8FC7;&#x4EE5;&#x4E0B;&#x6807;&#x51C6;&#x8FC7;&#x7A0B;&#x663E;&#x793A;&#x76F8;&#x540C;&#x7684;&#x9EC4;&#x8272;:&#x9996;&#x5148;&#xFF0C;&#x5B83;&#x5C06;&#x9EC4;&#x8272;&#x4ECE;P5&#x8349;&#x56FE;&#x7684;&#x989C;&#x8272;&#x7A7A;&#x95F4;&#x8F6C;&#x6362;&#x4E3A;CIEXYZ&#x989C;&#x8272;&#x7A7A;&#x95F4;(&#x4E5F;&#x79F0;&#x4E3A;&#x53C2;&#x8003;&#x989C;&#x8272;&#x7A7A;&#x95F4;)&#x3002;&#x7136;&#x540E;&#xFF0C;&#x56E0;&#x4E3A;&#x6BCF;&#x4E2A;&#x76D1;&#x89C6;&#x5668;&#x90FD;&#x77E5;&#x9053;&#x4E0E;CIEXYZ&#x989C;&#x8272;&#x7A7A;&#x95F4;&#x76F8;&#x5173;&#x7684;&#x4E3B;&#x706F;&#x5149;&#x7684;&#x786E;&#x5207;&#x989C;&#x8272;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x53EF;&#x4EE5;&#x786E;&#x5B9A;&#x8981;&#x6DF7;&#x5408;&#x7684;&#x4E3B;&#x706F;&#x5149;&#x7684;&#x6570;&#x91CF;&#x3002;</p>
<p>sRGB&#x989C;&#x8272;&#x7A7A;&#x95F4;&#x7684;&#x8272;&#x57DF;&#x662F;&#x4E24;&#x4E2A;&#x989C;&#x8272;&#x7A7A;&#x95F4;&#x4E2D;&#x6700;&#x5C0F;&#x7684;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5B83;&#x8986;&#x76D6;&#x7684;&#x989C;&#x8272;&#x8303;&#x56F4;&#x6700;&#x5C0F;&#x3002;&#x5B83;&#x662F;&#x4E3A;&#x7535;&#x8111;&#x663E;&#x793A;&#x5668;&#x800C;&#x8BBE;&#x8BA1;&#x7684;&#xFF0C;&#x8F83;&#x5C0F;&#x7684;&#x8272;&#x57DF;&#x53CD;&#x6620;&#x4E86;&#x5927;&#x591A;&#x6570;&#x9AD8;&#x6E05;&#x7535;&#x89C6;&#x548C;&#x7535;&#x8111;&#x663E;&#x793A;&#x5668;&#x4E2D;&#x4E3B;&#x5149;&#x6E90;&#x7684;&#x786E;&#x5207;&#x989C;&#x8272;&#x3002;&#x8FD9;&#x4E5F;&#x610F;&#x5473;&#x7740;sRGB&#x7684;&#x989C;&#x8272;&#x7A7A;&#x95F4;&#x5F88;&#x5BB9;&#x6613;&#x9002;&#x914D;&#x786C;&#x4EF6;&#x5382;&#x5546;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x5B83;&#x80FD;&#x6210;&#x4E3A;&#x6570;&#x5B57;&#x6587;&#x4EF6;&#x4F7F;&#x7528;&#x6700;&#x5E7F;&#x6CDB;&#x7684;&#x989C;&#x8272;&#x7A7A;&#x95F4;&#x7684;&#x539F;&#x56E0;&#x3002;&#x5F53;&#x4F60;&#x5728;&#x7F51;&#x7AD9;&#x4E0A;&#x770B;&#x5230;&#x4E00;&#x79CD;&#x989C;&#x8272;&#x6216;&#x56FE;&#x7247;&#x65F6;&#xFF0C;&#x5B83;&#x5F88;&#x53EF;&#x80FD;&#x662F;sRGB&#x989C;&#x8272;&#x3002;&#x5C3D;&#x7BA1;sRGB&#x5BF9;&#x4E8E;&#x5C4F;&#x5E55;&#x4E0A;&#x663E;&#x793A;&#x7684;&#x989C;&#x8272;&#x8303;&#x56F4;&#x6765;&#x8BF4;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x989C;&#x8272;&#x7A7A;&#x95F4;&#xFF0C;&#x4F46;&#x662F;&#x8272;&#x57DF;&#x4E0D;&#x591F;&#x5BBD;&#xFF0C;&#x65E0;&#x6CD5;&#x652F;&#x6301;&#x7528;&#x58A8;&#x6C34;&#x6253;&#x5370;&#x7684;&#x989C;&#x8272;&#x2014;&#x2014;&#x5C24;&#x5176;&#x662F;&#x5728;&#x5149;&#x8C31;&#x7684;&#x84DD;&#x7EFF;&#x8272;&#x90E8;&#x5206;&#x3002;Adobe RGB(1998)&#x989C;&#x8272;&#x7A7A;&#x95F4;&#x6709;&#x4E00;&#x4E2A;&#x66F4;&#x5E7F;&#x6CDB;&#x7684;RGB&#x8272;&#x57DF;&#xFF0C;&#x5B83;&#x88AB;&#x7CBE;&#x5FC3;&#x9009;&#x62E9;&#x6765;&#x8986;&#x76D6;CMYK&#x6253;&#x5370;&#x673A;&#x53EF;&#x4EE5;&#x4EA7;&#x751F;&#x7684;&#x5927;&#x591A;&#x6570;&#x989C;&#x8272;&#x3002;&#x8FD9;&#x8FD8;&#x610F;&#x5473;&#x7740;&#xFF0C;&#x4E00;&#x7EC4;&#x7279;&#x5B9A;&#x7684;&#x989C;&#x8272;&#x53EF;&#x80FD;&#x770B;&#x8D77;&#x6765;&#x975E;&#x5E38;&#x4E0D;&#x540C;&#xFF0C;&#x8FD9;&#x53D6;&#x51B3;&#x4E8E;&#x5B83;&#x6240;&#x4F9D;&#x9644;&#x7684;&#x989C;&#x8272;&#x7A7A;&#x95F4;&#xFF0C;&#x5982;&#x4E0B;&#x9762;&#x7684;&#x793A;&#x4F8B;&#x6240;&#x793A;&#xFF0C;&#x8BE5;&#x793A;&#x4F8B;&#x5728;&#x4E24;&#x4E2A;&#x989C;&#x8272;&#x7A7A;&#x95F4;&#x4E2D;&#x663E;&#x793A;&#x4E86;&#x76F8;&#x540C;&#x7684;RGB&#x503C;&#x3002;&#x6CE8;&#x610F;&#x6700;&#x540E;&#x4E24;&#x4E2A;&#x7EFF;&#x8272;&#x5728;Adobe RGB(1998)&#x989C;&#x8272;&#x7A7A;&#x95F4;&#x4E2D;&#x770B;&#x8D77;&#x6765;&#x662F;&#x5982;&#x4F55;&#x76F8;&#x540C;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5927;&#x591A;&#x6570;&#x5C4F;&#x5E55;&#x4E0D;&#x80FD;&#x663E;&#x793A;&#x66F4;&#x5BBD;&#x989C;&#x8272;&#x8303;&#x56F4;&#x7684;&#x7EFF;&#x8272;&#x4E3B;&#x8272;&#x3002;</p>
<p><img src="../images/adobe-rgb.png" alt="&#x6A21;&#x62DF;&#x5927;&#x591A;&#x6570;&#x76D1;&#x89C6;&#x5668;&#x5982;&#x4F55;&#x6E32;&#x67D3;&#x4E24;&#x4E2A;&#x989C;&#x8272;&#x7A7A;&#x95F4;&#x3002; Adobe RGB&#xFF08;1998&#xFF09;&#x989C;&#x8272;&#x7A7A;&#x95F4;&#x4E2D;&#x7684;&#x6700;&#x540E;&#x4E24;&#x79CD;&#x989C;&#x8272;&#x770B;&#x8D77;&#x6765;&#x5B8C;&#x5168;&#x76F8;&#x540C;&#x3002;"></p>
<p>&#x503C;&#x5F97;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x5C3D;&#x7BA1;&#x989C;&#x8272;&#x6A21;&#x578B;&#x662F;&#x62BD;&#x8C61;&#x7684;&#x6570;&#x5B66;&#x6982;&#x5FF5;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x4F34;&#x968F;&#x7684;&#x989C;&#x8272;&#x7A7A;&#x95F4;&#xFF0C;&#x5219;&#x65E0;&#x6CD5;&#x53EF;&#x89C6;&#x5316;&#x989C;&#x8272;&#x6A21;&#x578B;&#x3002; &#x4E0A;&#x9762;&#x7684;RGB&#xFF0C;HSV&#x548C;HSL&#x989C;&#x8272;&#x6A21;&#x578B;&#x793A;&#x4F8B;&#x90FD;&#x5728;sRGB&#x989C;&#x8272;&#x7A7A;&#x95F4;&#x5185;&#x53EF;&#x89C6;&#x5316;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x662F;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x9ED8;&#x8BA4;&#x989C;&#x8272;&#x7A7A;&#x95F4;&#x3002;</p>
<p>&#x989C;&#x8272;&#x914D;&#x7F6E;&#x6587;&#x4EF6;
&#x901A;&#x8FC7;&#x5728;&#x5176;&#x5143;&#x6570;&#x636E;&#x4E2D;&#x5D4C;&#x5165;&#x989C;&#x8272;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#xFF0C;&#x6570;&#x5B57;&#x56FE;&#x50CF;&#x53EF;&#x4EE5;&#x6307;&#x5B9A;&#x7279;&#x5B9A;&#x989C;&#x8272;&#x7A7A;&#x95F4;&#x3002;&#x8FD9;&#x544A;&#x8BC9;&#x4EFB;&#x4F55;&#x60F3;&#x8981;&#x8BFB;&#x53D6;&#x56FE;&#x50CF;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x50CF;&#x7D20;&#x503C;&#x662F;&#x6839;&#x636E;&#x7279;&#x5B9A;&#x7684;&#x989C;&#x8272;&#x7A7A;&#x95F4;&#x58F0;&#x660E;&#x7684;&#xFF0C;&#x6CA1;&#x6709;&#x989C;&#x8272;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x7684;&#x56FE;&#x50CF;&#x901A;&#x5E38;&#x5047;&#x5B9A;&#x4E3A;sRGB&#x3002;&#x989C;&#x8272;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x5BF9;&#x4E8E;&#x5728;&#x591A;&#x4E2A;&#x8BBE;&#x5907;&#x4E0A;&#x6B63;&#x786E;&#x518D;&#x73B0;&#x76F8;&#x540C;&#x989C;&#x8272;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x4F60;&#x7ECF;&#x5E38;&#x4F1A;&#x770B;&#x5230;&#x4E13;&#x4E1A;&#x6253;&#x5370;&#x670D;&#x52A1;&#x8981;&#x6C42;&#x4E3A;&#x56FE;&#x50CF;&#x6587;&#x4EF6;&#x8BBE;&#x7F6E;&#x7279;&#x5B9A;&#x989C;&#x8272;&#x7A7A;&#x95F4;&#xFF08;&#x5F88;&#x53EF;&#x80FD;&#x662F;Adobe RGB&#xFF08;1998&#xFF09;&#x6216;ProPhoto RGB&#xFF0C;&#x4E00;&#x4E2A;&#x5E26;&#x6709;&#x975E;&#x5E38;&#x5BBD;&#x7684;&#x8272;&#x57DF;&#x7684;&#x989C;&#x8272;&#x7A7A;&#x95F4;&#xFF09;&#x3002;&#x8FD9;&#x53EF;&#x4EE5;&#x786E;&#x4FDD;&#x56FE;&#x50CF;&#x4E2D;&#x7684;&#x989C;&#x8272;&#x4E0D;&#x4F1A;&#x88AB;&#x89E3;&#x91CA;&#x4E3A;&#x9519;&#x8BEF;&#x7684;&#x989C;&#x8272;&#x7A7A;&#x95F4;&#x3002;&#x5982;&#x679C;&#x60A8;&#x66FE;&#x7ECF;&#x5C06;&#x56FE;&#x50CF;&#x7C98;&#x8D34;&#x5230;&#x73B0;&#x6709;&#x7684;Photoshop&#x9879;&#x76EE;&#x4E2D;&#xFF0C;&#x7ED3;&#x679C;&#x5374;&#x53D1;&#x73B0;&#x989C;&#x8272;&#x770B;&#x8D77;&#x6765;&#x4E0D;&#x5BF9;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x53D7;&#x5BB3;&#x4EBA;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x5C06;&#x5E26;&#x6709;Adobe RGB&#xFF08;1998&#xFF09;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x7684;&#x56FE;&#x50CF;&#x7C98;&#x8D34;&#x5230;&#x5E26;&#x6709;sRGB&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x7684;Photoshop&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;Photoshop&#x4F1A;&#x5C06;&#x50CF;&#x7D20;&#x503C;&#x6309;&#x8F83;&#x5C0F;&#x7684;&#x8272;&#x57DF;&#x6765;&#x89E3;&#x91CA;&#xFF0C;&#x4ECE;&#x800C;&#x6539;&#x53D8;&#x88AB;&#x7C98;&#x8D34;&#x56FE;&#x50CF;&#x7684;&#x989C;&#x8272;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x6570;&#x5B57;&#x8BBE;&#x8BA1;&#x5DE5;&#x5177;&#x90FD;&#x6709;&#x5185;&#x7F6E;&#x547D;&#x4EE4;&#x6765;&#x5728;&#x989C;&#x8272;&#x7A7A;&#x95F4;&#x4E4B;&#x95F4;&#x8FDB;&#x884C;&#x8F6C;&#x6362;&#xFF0C;&#x800C;&#x5B9E;&#x9645;&#x4E0A;Photoshop&#x5728;&#x91CD;&#x65B0;&#x89E3;&#x91CA;&#x989C;&#x8272;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x4E4B;&#x524D;&#x5C31;&#x5F88;&#x597D;&#x5730;&#x63D0;&#x9192;&#x4E86;&#x7528;&#x6237;&#x3002;&#x989C;&#x8272;&#x7A7A;&#x95F4;&#x4E4B;&#x95F4;&#x7684;&#x8F6C;&#x6362;&#x5BF9;&#x4E8E;&#x5E0C;&#x671B;&#x7528;&#x4EE3;&#x7801;&#x8BBE;&#x8BA1;&#x6253;&#x5370;&#x4EA7;&#x54C1;&#x7684;&#x8BBE;&#x8BA1;&#x5E08;&#x6765;&#x8BF4;&#x5C24;&#x5176;&#x6709;&#x76CA;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x7684;&#x6570;&#x5B57;&#x8D44;&#x4EA7;&#x5728;&#x6253;&#x5370;&#x4E4B;&#x524D;&#x9700;&#x8981;&#x4ECE;sRGB&#x8F6C;&#x6362;&#x4E3A;&#x6253;&#x5370;&#x7279;&#x5B9A;&#x7684;&#x989C;&#x8272;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x3002;</p>
<p><img src="https://www.programmingdesignsystems.com/assets/color/color-models-and-color-spaces/klee.jpg" alt="Paul Klee&#x5DE6;&#x624B;&#x8FB9;&#x8FD9;&#x5E45;&#x753B;&#x6B63;&#x786E;&#x5730;&#x4ECE;Adobe RGB(1998)&#x8F6C;&#x6362;&#x4E3A;sRGB&#xFF0C;&#x800C;&#x53F3;&#x624B;&#x8FB9;&#x9519;&#x8BEF;&#x5730;&#x5C06;&#x989C;&#x8272;&#x91CD;&#x65B0;&#x89E3;&#x91CA;&#x4E3A;sRGB&#xFF0C;&#x6CA1;&#x6709;&#x8F6C;&#x6362;&#x3002;"></p>
<p>&#x5982;&#x679C;&#x6570;&#x5B57;&#x56FE;&#x50CF;&#x4F7F;&#x7528;&#x5177;&#x6709;&#x5E7F;&#x6CDB;&#x8272;&#x57DF;&#x7684;&#x989C;&#x8272;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#xFF0C;&#x90A3;&#x4E48;&#x51E0;&#x4E4E;&#x5728;&#x5927;&#x591A;&#x6570;&#x5C4F;&#x5E55;&#x4E0A;&#x80AF;&#x5B9A;&#x4F1A;&#x4E22;&#x5931;&#x989C;&#x8272;&#xFF0C;&#x56E0;&#x4E3A;&#x5927;&#x591A;&#x6570;&#x5C4F;&#x5E55;&#x53EA;&#x80FD;&#x663E;&#x793A;sRGB&#x8272;&#x57DF;&#x5185;&#x7684;&#x989C;&#x8272;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x8BB8;&#x591A;&#x8F83;&#x65B0;&#x7684;&#x5C4F;&#x5E55;&#x652F;&#x6301;&#x66F4;&#x5BBD;&#x7684;&#x8272;&#x57DF;&#x3002;&#x82F9;&#x679C;iMac&#x89C6;&#x7F51;&#x819C;&#x5C4F;&#x5E55;&#x4F7F;&#x7528;&#x4E86;&#x4E00;&#x4E2A;&#x540D;&#x4E3A;DCI-P3&#x7684;RGB&#x989C;&#x8272;&#x7A7A;&#x95F4;&#xFF0C;&#x5176;&#x8272;&#x57DF;&#x4E0E;Adobe RGB(1998)&#x5927;&#x81F4;&#x76F8;&#x540C;&#xFF0C;&#x4F46;&#x5B83;&#x5305;&#x542B;&#x66F4;&#x591A;&#x7684;&#x7EA2;&#x9EC4;&#x989C;&#x8272;&#xFF0C;&#x4E0D;&#x5305;&#x62EC;&#x4E00;&#x4E9B;&#x7EFF;&#x84DD;&#x989C;&#x8272;&#x3002;&#x4E3A;&#x4E86;&#x7A81;&#x51FA;&#x989C;&#x8272;&#x7BA1;&#x7406;&#x7684;&#x590D;&#x6742;&#x6027;&#xFF0C;&#x5728;&#x89C6;&#x7F51;&#x819C;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#x8FD0;&#x884C;&#x7684;&#x4E00;&#x4E9B;&#x6D4F;&#x89C8;&#x5668;&#x53EF;&#x80FD;&#x4F1A;&#x4F7F;&#x6CA1;&#x6709;&#x989C;&#x8272;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x7684;sRGB&#x56FE;&#x50CF;&#x7684;&#x989C;&#x8272;&#x9971;&#x548C;&#x5EA6;&#x66F4;&#x9AD8;&#xFF0C;&#x800C;&#x5176;&#x4ED6;&#x6D4F;&#x89C8;&#x5668;&#x4F1A;&#x6B63;&#x786E;&#x5730;&#x5C06;sRGB&#x50CF;&#x7D20;&#x503C;&#x8F6C;&#x6362;&#x4E3A;DCI-P3&#x3002;&#x867D;&#x7136;&#x672C;&#x4E66;&#x4E0D;&#x4F1A;&#x6DF1;&#x5165;&#x63A2;&#x8BA8;&#x8272;&#x5F69;&#x7BA1;&#x7406;&#x65B9;&#x9762;&#x7684;&#x590D;&#x6742;&#x6027;&#xFF0C;&#x4F46;&#x5BF9;&#x4E8E;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x8BFB;&#x8005;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x91CC;&#x6709;&#x5F88;&#x591A;&#x5F88;&#x597D;&#x7684;<a href="https://abookapart.com/products/making-sense-of-color-management" target="_blank">&#x53C2;&#x8003;&#x8D44;&#x6599;</a>&#x3002;</p>
<p>P5.js&#x7684;&#x989C;&#x8272;
&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x57FA;&#x4E8E;&#x6D4F;&#x89C8;&#x5668;&#x7684;JavaScript&#x5E93;&#xFF0C;P5.js&#x4E2D;&#x7684;&#x6240;&#x6709;&#x989C;&#x8272;&#x503C;&#x90FD;&#x9075;&#x5FAA;sRGB (&#x4E92;&#x8054;&#x7F51;&#x6807;&#x51C6;&#x7684;&#x989C;&#x8272;&#x7A7A;&#x95F4;)&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x5728;&#x4E0A;&#x8FF0;&#x4E09;&#x4E2A;&#x989C;&#x8272;&#x6A21;&#x578B;&#x4E2D;&#x5B9A;&#x4E49;&#x8FD9;&#x4E9B;&#x989C;&#x8272;:RGB&#x3001;HSV(&#x79F0;&#x4E3A;HSB)&#x548C;HSL&#x3002;&#x5728;P5.js&#x4E2D;&#xFF0C;&#x7ED8;&#x5236;&#x989C;&#x8272;&#x5F62;&#x72B6;&#x7684;&#x4E3B;&#x8981;&#x65B9;&#x6CD5;&#x662F;&#x5C06;&#x989C;&#x8272;&#x503C;&#x4F20;&#x9012;&#x7ED9;fill()&#x548C;stroke()&#x51FD;&#x6570;&#x3002;&#x8FD9;&#x5C06;&#x4E3A;&#x6240;&#x6709;&#x540E;&#x7EED;&#x5F62;&#x72B6;&#x8BBE;&#x7F6E;&#x5F53;&#x524D;&#x586B;&#x5145;&#x548C;&#x63CF;&#x8FB9;&#x989C;&#x8272;&#xFF0C;&#x5728;&#x518D;&#x6B21;fill()&#x6216;stroke()&#x3001;&#x7981;&#x7528;&#x63CF;&#x8FB9;&#x6216;&#x5B8C;&#x5168;&#x4F7F;&#x7528;noStroke()&#x6216;noFill()&#x51FD;&#x6570;&#x586B;&#x5145;&#x4E4B;&#x524D;&#xFF0C;&#x5C06;&#x6CBF;&#x7528;&#x8BE5;&#x8BBE;&#x7F6E;&#x3002;</p>
<p>RGB&#x662F;P5.js&#x4E2D;&#x9ED8;&#x8BA4;&#x7684;&#x989C;&#x8272;&#x6A21;&#x578B;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;fill()&#x548C;strokte()&#x51FD;&#x6570;&#x9700;&#x8981;&#x4E09;&#x4E2A;0-255&#x7684;&#x6570;&#x5B57;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#xFF0C;&#x6765;&#x8868;&#x8FBE;&#x8BE5;&#x989C;&#x8272;&#x4E2D;&#x7EA2;&#x8272;&#x3001;&#x7EFF;&#x8272;&#x3001;&#x84DD;&#x8272;&#x7684;&#x7528;&#x91CF;&#x3002;&#x8FD9;&#x4E2A;&#x7279;&#x5B9A;&#x8303;&#x56F4;&#x80CC;&#x540E;&#x7684;&#x539F;&#x56E0;&#x662F;&#x6700;&#x591A;256&#x4E2A;&#x503C;&#x53EF;&#x4EE5;&#x5B58;&#x50A8;&#x5728;&#x4E00;&#x4E2A;&#x5B57;&#x8282;(8&#x4F4D;)&#x4E2D;&#xFF0C;&#x5141;&#x8BB8;&#x6BCF;&#x79CD;RGB&#x989C;&#x8272;&#x53EA;&#x5360;&#x7528;24&#x4F4D;&#x3002;&#x5C3D;&#x7BA1;256&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x7EA2;&#x3001;&#x7EFF;&#x3001;&#x84DD;&#x989C;&#x8272;&#x542C;&#x8D77;&#x6765;&#x5E76;&#x4E0D;&#x591A;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x4EA7;&#x751F;16,777,216&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x989C;&#x8272;&#xFF0C;&#x8FD9;&#x5B9E;&#x9645;&#x4E0A;&#x6BD4;&#x4EBA;&#x773C;&#x6240;&#x80FD;&#x611F;&#x77E5;&#x7684;&#x8981;&#x591A;&#x5F97;&#x591A;&#x3002;</p>
<pre><code class="lang-javascript">noStroke();
fill(<span class="hljs-number">210</span>, <span class="hljs-number">70</span>, <span class="hljs-number">50</span>);
ellipse(<span class="hljs-number">150</span>, height/<span class="hljs-number">2</span>, <span class="hljs-number">200</span>, <span class="hljs-number">200</span>);

fill(<span class="hljs-number">245</span>, <span class="hljs-number">225</span>, <span class="hljs-number">50</span>);
ellipse(<span class="hljs-number">300</span>, height/<span class="hljs-number">2</span>, <span class="hljs-number">200</span>, <span class="hljs-number">200</span>);

fill(<span class="hljs-number">50</span>, <span class="hljs-number">120</span>, <span class="hljs-number">170</span>);
ellipse(<span class="hljs-number">450</span>, height/<span class="hljs-number">2</span>, <span class="hljs-number">200</span>, <span class="hljs-number">200</span>);
</code></pre>
<!-- 等待插入代码 -->
<p> P5.js&#x8FD8;&#x5141;&#x8BB8;&#x4F7F;&#x7528;web&#x8BBE;&#x8BA1;&#x4E2D;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x8BED;&#x6CD5;&#x6765;&#x6307;&#x5B9A;RGB&#x989C;&#x8272;&#x6A21;&#x578B;&#x4E2D;&#x7684;&#x989C;&#x8272;&#x3002;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x8BED;&#x6CD5;&#x4E0D;&#x662F;&#x4F7F;&#x7528;&#x4E09;&#x4E2A;&#x6570;&#x5B57;&#xFF0C;&#x800C;&#x662F;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;#&#x7B26;&#x53F7;&#x548C;&#x4E00;&#x4E2A;&#x516D;&#x4E2A;&#x5B57;&#x7B26;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x6765;&#x8868;&#x793A;&#x989C;&#x8272;&#x503C;&#x3002;&#x6BCF;&#x4E2A;&#x4E3B;&#x8272;&#x5728;&#x8FD9;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x4E2D;&#x90FD;&#x6709;&#x4E24;&#x4E2A;&#x5B57;&#x7B26;&#xFF0C;&#x4F7F;&#x7528;&#x6570;&#x5B57;0-9&#x8868;&#x793A;0&#x5230;9&#xFF0C;&#x5B57;&#x6BCD;A-F&#x8868;&#x793A;10&#x5230;15&#x3002;&#x6BCF;&#x4E2A;&#x5B57;&#x7B26;&#x6709;16&#x79CD;&#x53D8;&#x4F53;&#xFF0C;&#x56E0;&#x6B64;&#x6BCF;&#x4E2A;&#x4E3B;&#x989C;&#x8272;&#x53EF;&#x4EE5;&#x5728;&#x4E24;&#x4E2A;&#x5B57;&#x7B26;&#x4E2D;&#x6307;&#x5B9A;0&#x5230;255&#x4E4B;&#x95F4;&#x7684;&#x503C;&#x3002;</p>
<pre><code class="lang-javascript">noStroke();
fill(<span class="hljs-string">&quot;#d24632&quot;</span>);
ellipse(<span class="hljs-number">150</span>, height/<span class="hljs-number">2</span>, <span class="hljs-number">200</span>, <span class="hljs-number">200</span>);

fill(<span class="hljs-string">&quot;#f5e132&quot;</span>);
ellipse(<span class="hljs-number">300</span>, height/<span class="hljs-number">2</span>, <span class="hljs-number">200</span>, <span class="hljs-number">200</span>);

fill(<span class="hljs-string">&quot;#3278aa&quot;</span>);
ellipse(<span class="hljs-number">450</span>, height/<span class="hljs-number">2</span>, <span class="hljs-number">200</span>, <span class="hljs-number">200</span>);
</code></pre>
<!-- 等待插入代码 -->
<p>P5.js&#x4E2D;&#x7684;colorMode()&#x51FD;&#x6570;&#x53EF;&#x7528;&#x4E8E;&#x5207;&#x6362;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x989C;&#x8272;&#x6A21;&#x578B;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;fill()&#x548C;stroke()&#x51FD;&#x6570;&#x5C06;&#x6839;&#x636E;&#x65B0;&#x989C;&#x8272;&#x6A21;&#x578B;&#x7684;&#x7EF4;&#x5EA6;&#x6765;&#x5F97;&#x51FA;&#x989C;&#x8272;&#x8303;&#x56F4;&#x3002;HSV(&#x5728;P5.js&#x4E2D;&#x79F0;&#x4E3A;HSB)&#x548C;HSL&#x7684;&#x9ED8;&#x8BA4;&#x6570;&#x503C;&#x8303;&#x56F4;&#x662F;&#x7528;0-360&#x8868;&#x793A;&#x8272;&#x8C03;(&#x8868;&#x793A;&#x89D2;&#x5EA6;)&#xFF0C;0-100&#x8868;&#x793A;&#x9971;&#x548C;&#x5EA6;&#x548C;&#x4EAE;&#x5EA6;/&#x4EAE;&#x5EA6;(&#x8868;&#x793A;&#x767E;&#x5206;&#x6BD4;)&#x3002;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x793A;&#x4F8B;&#x540C;&#x65F6;&#x4F7F;&#x7528;HSV&#x548C;HSL&#x989C;&#x8272;&#x6A21;&#x578B;&#x6765;&#x7ED8;&#x5236;&#x4E09;&#x4E2A;&#x5706;&#x3002;</p>
<pre><code class="lang-javascript">noStroke();
colorMode(HSB);
fill(<span class="hljs-number">7</span>, <span class="hljs-number">76</span>, <span class="hljs-number">82</span>);
ellipse(<span class="hljs-number">150</span>, height/<span class="hljs-number">2</span>, <span class="hljs-number">200</span>, <span class="hljs-number">200</span>);

fill(<span class="hljs-number">54</span>, <span class="hljs-number">80</span>, <span class="hljs-number">96</span>);
ellipse(<span class="hljs-number">300</span>, height/<span class="hljs-number">2</span>, <span class="hljs-number">200</span>, <span class="hljs-number">200</span>);

colorMode(HSL);
fill(<span class="hljs-number">205</span>, <span class="hljs-number">55</span>, <span class="hljs-number">42</span>);
ellipse(<span class="hljs-number">450</span>, height/<span class="hljs-number">2</span>, <span class="hljs-number">200</span>, <span class="hljs-number">200</span>);
</code></pre>
<p>&#x4E5F;&#x53EF;&#x4EE5;&#x66F4;&#x6539;&#x6BCF;&#x79CD;&#x989C;&#x8272;&#x6A21;&#x578B;&#x7684;&#x9ED8;&#x8BA4;&#x6570;&#x503C;&#x8303;&#x56F4;&#x3002; &#x8FD9;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5728;&#x8C03;&#x7528;colorMode&#xFF08;&#xFF09;&#x51FD;&#x6570;&#x65F6;&#x4F20;&#x5165;&#x4E09;&#x4E2A;&#x9644;&#x52A0;&#x6570;&#x5B57;&#x6765;&#x5B8C;&#x6210;&#xFF0C;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF0C;&#x5176;&#x4E2D;HSV&#x989C;&#x8272;&#x6A21;&#x578B;&#x7684;&#x6240;&#x6709;&#x4E09;&#x4E2A;&#x7EF4;&#x5EA6;&#x7684;&#x8303;&#x56F4;&#x90FD;&#x8BBE;&#x7F6E;&#x4E3A;0-1&#x3002;</p>
<pre><code class="lang-javascript">noStroke();
colorMode(HSB, <span class="hljs-number">1</span>, <span class="hljs-number">1</span>, <span class="hljs-number">1</span>);
fill(<span class="hljs-number">0.0195</span>, <span class="hljs-number">0.76</span>, <span class="hljs-number">0.82</span>);
ellipse(<span class="hljs-number">150</span>, height/<span class="hljs-number">2</span>, <span class="hljs-number">200</span>, <span class="hljs-number">200</span>);

fill(<span class="hljs-number">0.15</span>, <span class="hljs-number">0.80</span>, <span class="hljs-number">0.96</span>);
ellipse(<span class="hljs-number">300</span>, height/<span class="hljs-number">2</span>, <span class="hljs-number">200</span>, <span class="hljs-number">200</span>);

fill(<span class="hljs-number">0.569</span>, <span class="hljs-number">0.71</span>, <span class="hljs-number">0.67</span>);
ellipse(<span class="hljs-number">450</span>, height/<span class="hljs-number">2</span>, <span class="hljs-number">200</span>, <span class="hljs-number">200</span>);
</code></pre>
<p>&#x5728;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x7AE0;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x7814;&#x7A76;&#x5728;P5.js&#x4E2D;&#x4EE5;&#x7F16;&#x7A0B;&#x65B9;&#x5F0F;&#x7EC4;&#x5408;&#x989C;&#x8272;&#x7684;&#x4E00;&#x7CFB;&#x5217;&#x4E0D;&#x540C;&#x6280;&#x672F;&#x3002;&#x8FD9;&#x4E9B;&#x793A;&#x4F8B;&#x4E2D;&#x6709;&#x8BB8;&#x591A;&#x5C06;&#x4F7F;&#x7528;HSL&#x989C;&#x8272;&#x6A21;&#x578B;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x662F;&#x4E00;&#x79CD;&#x76F4;&#x89C2;&#x7684;&#x6D4F;&#x89C8;&#x8272;&#x8C31;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="2.1.html" class="navigation navigation-prev " aria-label="Previous page: 2.1 颜色理论的小历史">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="2.3.html" class="navigation navigation-next " aria-label="Next page: 2.3 感知颜色空间的一致性">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"2.2 颜色模型及颜色空间","level":"1.4.2","depth":2,"next":{"title":"2.3 感知颜色空间的一致性","level":"1.4.3","depth":2,"path":"chapters/2.3.md","ref":"chapters/2.3.md","articles":[]},"previous":{"title":"2.1 颜色理论的小历史","level":"1.4.1","depth":2,"path":"chapters/2.1.md","ref":"chapters/2.1.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"chapters/2.2.md","mtime":"2019-08-06T08:35:48.396Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-09-25T14:35:43.663Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

