
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>0.1.什么是设计系统 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    设计系统编程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    0.设计系统
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.2.1" data-path="0.html">
            
                <a href="0.html">
            
                    
                    0.1.什么是设计系统
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    1.形状
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="1.1.html">
            
                <a href="1.1.html">
            
                    
                    1.1 图形基础
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="1.2.html">
            
                <a href="1.2.html">
            
                    
                    1.2 基本形状
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="1.3.html">
            
                <a href="1.3.html">
            
                    
                    1.3 定制形状
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="1.4.html">
            
                <a href="1.4.html">
            
                    
                    1.4 程序形状
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    2.颜色
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="2.1.html">
            
                <a href="2.1.html">
            
                    
                    2.1 颜色理论简史
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="2.2.html">
            
                <a href="2.2.html">
            
                    
                    2.2 颜色模型及颜色空间
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="2.3.html">
            
                <a href="2.3.html">
            
                    
                    2.3 感知颜色空间的一致性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4" data-path="2.4.html">
            
                <a href="2.4.html">
            
                    
                    2.4 配色方案
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" >
            
                <span>
            
                    
                    3.布局
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="3.1.html">
            
                <a href="3.1.html">
            
                    
                    3.1 几何图形简史
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" >
            
                <span>
            
                    
                    未完持续更新...
            
                </span>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >0.1.什么是设计系统</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x4EC0;&#x4E48;&#x662F;&#x8BBE;&#x8BA1;&#x7CFB;&#x7EDF;">&#x4EC0;&#x4E48;&#x662F;&#x8BBE;&#x8BA1;&#x7CFB;&#x7EDF;</h2>
<p>&#x65E0;&#x8BBA;&#x4F60;&#x53BB;&#x54EA;&#x91CC;&#xFF0C;&#x4F60;&#x90FD;&#x4F1A;&#x88AB;&#x7CFB;&#x7EDF;&#x5305;&#x56F4;&#x7740;&#x3002;&#x6211;&#x4EEC;&#x7528;&#x201C;&#x7CFB;&#x7EDF;&#x201D;&#x8FD9;&#x4E2A;&#x8BCD;&#x6765;&#x63CF;&#x8FF0;&#x4E00;&#x7EC4;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#x7684;&#x5404;&#x4E2A;&#x90E8;&#x5206;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x5171;&#x540C;&#x7684;&#x6574;&#x4F53;&#xFF0C;&#x8FD9;&#x4E9B;&#x90E8;&#x5206;&#x53EF;&#x4EE5;&#x662F;&#x7B80;&#x5355;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x624B;&#x8868;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x975E;&#x5E38;&#x590D;&#x6742;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x6211;&#x4EEC;&#x79F0;&#x4E4B;&#x4E3A;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;&#x3002;&#x5728;&#x8FD9;&#x672C;&#x4E66;&#x4E2D;&#xFF0C;&#x201C;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x201D;&#x4E00;&#x8BCD;&#x88AB;&#x7528;&#x6765;&#x63CF;&#x8FF0;&#x9F13;&#x52B1;&#x90A3;&#x4E9B;&#x8BBE;&#x8BA1;&#x5E08;&#x5C06;&#x5176;&#x8BBE;&#x8BA1;&#x89C4;&#x5219;&#x5B9A;&#x4E49;&#x4E3A;&#x53EF;&#x7528;&#x4E8E;&#x591A;&#x4E2A;&#x4EA7;&#x54C1;&#x7684;&#x7CFB;&#x7EDF;&#x6307;&#x4EE4;&#x7684;&#x54F2;&#x5B66;&#x3002;&#x8FD9;&#x7528;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x6545;&#x4E8B;&#x6765;&#x89E3;&#x91CA;&#x597D;&#x50CF;&#x66F4;&#x597D;&#x3002;</p>
<p>&#x5047;&#x8BBE;&#x5F53;&#x5730;&#x5564;&#x9152;&#x5382;&#x8981;&#x6C42;&#x6211;&#x4E3A;&#x8457;&#x540D;&#x7684;&#x70C8;&#x6027;&#x5564;&#x9152;&#x8BBE;&#x8BA1;&#x4E00;&#x4E2A;&#x6807;&#x7B7E;&#x3002;&#x6211;&#x4E3A;&#x4E86;&#x786E;&#x4FDD;&#x6211;&#x7684;&#x8BBE;&#x8BA1;&#x5F88;&#x9002;&#x5408;&#x8FD9;&#x4E2A;&#x4EA7;&#x54C1;&#xFF0C;&#x82B1;&#x4E86;&#x5F88;&#x591A;&#x65F6;&#x95F4;&#x7814;&#x7A76;&#x548C;&#x54C1;&#x5C1D;&#x5564;&#x9152;&#xFF0C;&#x7136;&#x540E;&#x624D;&#x4F5C;&#x51FA;&#x6211;&#x7684;&#x6700;&#x7EC8;&#x8BBE;&#x8BA1;&#x3002;&#x5564;&#x9152;&#x5382;&#x5F88;&#x559C;&#x6B22;&#x6211;&#x7684;&#x65B0;&#x8BBE;&#x8BA1;&#xFF0C;&#x4ED6;&#x4EEC;&#x8981;&#x6C42;&#x6211;&#x4E3A;&#x5269;&#x4E0B;&#x7684;10&#x79CD;&#x5564;&#x9152;&#x8BBE;&#x8BA1;&#x6807;&#x7B7E;&#x3002;&#x73B0;&#x5728;&#x6211;&#x9762;&#x4E34;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x6211;&#x4E3A;&#x6211;&#x7684;&#x6807;&#x7B7E;&#x8BBE;&#x8BA1;&#x9009;&#x62E9;&#x7684;&#x989C;&#x8272;&#x3001;&#x5B57;&#x4F53;&#x548C;&#x63D2;&#x56FE;&#x975E;&#x5E38;&#x9002;&#x5408;&#x70C8;&#x6027;&#x7684;&#x548C;&#x6D53;&#x7A20;&#x7684;&#x5564;&#x9152;&#xFF0C;&#x4F46;&#x5B83;&#x5BF9;&#x5176;&#x4ED6;&#x5564;&#x9152;&#x4E0D;&#x8D77;&#x4F5C;&#x7528;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x6700;&#x7EC8;&#x4E3A;&#x6BCF;&#x79CD;&#x5564;&#x9152;&#x521B;&#x5EFA;&#x4E86;&#x4E0D;&#x540C;&#x7684;&#x89C6;&#x89C9;&#x98CE;&#x683C;&#x7684;&#x6807;&#x7B7E;&#xFF0C;&#x4F46;&#x5E76;&#x6CA1;&#x6709;&#x4E3A;&#x5564;&#x9152;&#x5382;&#x7684;&#x54C1;&#x724C;&#x63D0;&#x4F9B;&#x4E00;&#x81F4;&#x7684;&#x6807;&#x7B7E;&#x98CE;&#x683C;&#x3002;</p>
<p>&#x5982;&#x679C;&#x6211;&#x8BBE;&#x8BA1;&#x7B2C;&#x4E00;&#x4E2A;&#x6807;&#x7B7E;&#xFF0C;&#x76F8;&#x4FE1;&#x5B83;&#x5C06;&#x662F;&#x4E00;&#x4E2A;&#x66F4;&#x5927;&#x4E1C;&#x897F;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF1A;&#x5564;&#x9152;&#x5382;&#x7684;&#x8BBE;&#x8BA1;&#x7CFB;&#x7EDF;&#xFF0C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x7684;&#x3002;&#x800C;&#x4E0D;&#x662F;&#x4E13;&#x6CE8;&#x4E8E;&#x7279;&#x5B9A;&#x7684;&#x70C8;&#x6027;&#xFF0C;&#x6211;&#x4F1A;&#x5B9A;&#x4E49;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x89C6;&#x89C9;&#x98CE;&#x683C;&#xFF0C;&#x4EE5;&#x7528;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x5564;&#x9152;&#x7C7B;&#x578B;&#x3002;&#x8FD9;&#x5C06;&#x5305;&#x62EC;&#x4E00;&#x7EC4;&#x76F8;&#x5173;&#x7684;&#x5B57;&#x4F53;&#x548C;&#x989C;&#x8272;&#xFF0C;&#x8FD9;&#x4E9B;&#x5B57;&#x4F53;&#x548C;&#x989C;&#x8272;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x5DEE;&#x5F02;&#x53EF;&#x7528;&#x4E8E;&#x5355;&#x4E2A;&#x5564;&#x9152;&#xFF0C;&#x4F46;&#x53EF;&#x8BC6;&#x522B;&#x5230;&#x8DB3;&#x4EE5;&#x4E3A;&#x917F;&#x9152;&#x5382;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x5171;&#x540C;&#x7684;&#x6807;&#x8BC6;&#x3002;&#x53EA;&#x6709;&#x5728;&#x521B;&#x5EFA;&#x4E86;&#x8FD9;&#x4E2A;&#x8BBE;&#x8BA1;&#x7CFB;&#x7EDF;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x624D;&#x4F1A;&#x8BBE;&#x8BA1;&#x7B2C;&#x4E00;&#x4E2A;&#x6807;&#x7B7E;&#x3002;</p>
<p><img src="https://www.programmingdesignsystems.com/assets/what-is-a-design-system/transitmanual.jpg" alt=""></p>
<blockquote>
<p>1970&#x5E74;&#x4E3A;&#x7EBD;&#x7EA6;&#x4EA4;&#x901A;&#x5C40;&#x7F16;&#x5236;&#x7684;&#x201C;&#x56FE;&#x5F62;&#x6807;&#x51C6;&#x624B;&#x518C;&#x201D;&#x5C31;&#x662F;&#x8BBE;&#x8BA1;&#x7CFB;&#x7EDF;&#x7684;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x3002;&#x8D85;&#x8FC7;350&#x9875;&#xFF0C;&#x5B83;&#x5B9A;&#x4E49;&#x4E86;&#x6240;&#x6709;&#x4E0E;&#x7EBD;&#x7EA6;&#x5E02;&#x5730;&#x94C1;&#x76F8;&#x5173;&#x7684;&#x6807;&#x5FD7;&#x7684;&#x89C6;&#x89C9;&#x6307;&#x5357;&#x3002;<a href="https://www.programmingdesignsystems.com/what-is-a-design-system/index.html#fairuse" target="_blank">&#xA9;</a></p>
</blockquote>
<p>&#x8BBE;&#x8BA1;&#x7CFB;&#x7EDF;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x601D;&#x7EF4;&#x65B9;&#x5F0F;&#xFF0C;&#x8BBE;&#x8BA1;&#x4EBA;&#x5458;&#x88AB;&#x8FEB;&#x8003;&#x8651;&#x8BB8;&#x591A;&#x573A;&#x666F;&#x548C;&#x7EA6;&#x675F;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4F9D;&#x8D56;&#x4E00;&#x6B21;&#x6027;&#x7684;&#x8BBE;&#x8BA1;&#x8FC7;&#x7A0B;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x5E76;&#x4E0D;&#x65B0;&#x9C9C;&#xFF0C;&#x6709;&#x4E9B;&#x4EBA;&#x53EF;&#x80FD;&#x4F1A;&#x8BF4;&#xFF0C;&#x5B83;&#x4E00;&#x76F4;&#x662F;&#x8BBE;&#x8BA1;&#x5E08;&#x5DE5;&#x4F5C;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x4ECE;&#x7EBD;&#x7EA6;&#x4EA4;&#x901A;&#x5C40;&#x7684;&#x56FE;&#x5F62;&#x6807;&#x51C6;&#x624B;&#x518C;&#x5230;&#x8C37;&#x6B4C;&#x7684;&#x6750;&#x6599;&#x8BBE;&#x8BA1;&#xFF0C;&#x591A;&#x5E74;&#x6765;&#x5DF2;&#x7ECF;&#x5EFA;&#x7ACB;&#x4E86;&#x6570;&#x4EE5;&#x5343;&#x8BA1;&#x7684;&#x8BBE;&#x8BA1;&#x7CFB;&#x7EDF;&#x3002;&#x5927;&#x591A;&#x6570;&#x201C;&#x8D22;&#x5BCC;&#x201D;&#x699C;&#x4E0A;500&#x5F3A;&#x4F01;&#x4E1A;&#x4E4B;&#x6240;&#x4EE5;&#x80FD;&#x88AB;&#x8BA4;&#x53EF;&#xFF0C;&#x90FD;&#x662F;&#x6709;&#x539F;&#x56E0;&#x7684;&#xFF1A;&#x5B83;&#x4EEC;&#x5728;&#x4EA7;&#x54C1;&#x7EBF;&#x4E0A;&#x5BF9;&#x5B57;&#x4F53;&#x548C;&#x989C;&#x8272;&#x7684;&#x4F7F;&#x7528;&#x5236;&#x5B9A;&#x4E86;&#x4E25;&#x683C;&#x7684;&#x89C4;&#x5219;&#x3002;</p>
<p><img src="https://www.programmingdesignsystems.com/assets/what-is-a-design-system/materialdesign.jpg" alt=""></p>
<blockquote>
<p>&#x8C37;&#x6B4C;&#x7684;<a href="https://material.google.com/" target="_blank">&#x6750;&#x6599;&#x8BBE;&#x8BA1;</a>&#x6587;&#x6863;&#x662F;&#x4E3A;&#x4E86;&#x5E2E;&#x52A9;&#x89E3;&#x91CA;&#x516C;&#x53F8;&#x89C6;&#x89C9;&#x8BED;&#x8A00;&#x80CC;&#x540E;&#x7684;&#x60F3;&#x6CD5;&#x3002;&#x8FD9;&#x5305;&#x62EC;&#x4F7F;&#x7528;&#x989C;&#x8272;&#x3001;&#x5206;&#x5C42;&#x548C;&#x52A8;&#x753B;&#x7684;&#x89C4;&#x5219;&#x3002;</p>
</blockquote>
<p>&#x6700;&#x8FD1;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x8BBE;&#x8BA1;&#x7CFB;&#x7EDF;&#x7684;&#x4F8B;&#x5B50;&#x662F;&#x9EBB;&#x7701;&#x7406;&#x5DE5;&#x5B66;&#x9662;&#x5A92;&#x4F53;&#x5B9E;&#x9A8C;&#x5BA4;&#x7684;&#x6807;&#x5FD7;&#xFF0C;&#x7531;&#x5BBE;&#x5854;&#x683C;&#x62C9;&#x59C6;&#xFF08;Pentagram&#xFF09;&#x521B;&#x5EFA;&#x3002;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x5F88;&#x7B80;&#x5355;&#xFF1A;&#x7528;&#x5782;&#x76F4;&#x7EBF;&#x586B;&#x5145;7x7&#x7F51;&#x683C;&#xFF0C;&#x521B;&#x5EFA;&#x9ED1;&#x8272;&#x548C;&#x767D;&#x8272;&#x7684;&#x62BD;&#x8C61;&#x5B57;&#x6BCD;&#x6216;&#x7B26;&#x53F7;&#x3002;&#x8BE5;&#x7CFB;&#x7EDF;&#x7528;&#x4E8E;&#x4E3A;&#x5B9E;&#x9A8C;&#x5BA4;&#x7684;23&#x4E2A;&#x7814;&#x7A76;&#x5C0F;&#x7EC4;&#x521B;&#x5EFA;&#x5E26;&#x6709;&#x9996;&#x5B57;&#x6BCD;&#x7F29;&#x5199;&#x7684;&#x5FBD;&#x6807;&#xFF0C;&#x5E76;&#x4F5C;&#x4E3A;&#x6784;&#x5EFA;&#x81EA;&#x5B9A;&#x4E49;&#x5B57;&#x4F53;&#x3001;&#x56FE;&#x6807;&#x548C;&#x6A21;&#x5F0F;&#x7684;&#x57FA;&#x7840;&#x3002;</p>
<p><img src="https://www.programmingdesignsystems.com/assets/what-is-a-design-system/medialab1.jpg" alt=""></p>
<p><img src="https://www.programmingdesignsystems.com/assets/what-is-a-design-system/medialab2.jpg" alt=""></p>
<blockquote>
<p>&#x9EBB;&#x7701;&#x7406;&#x5DE5;&#x5B66;&#x9662;&#x5A92;&#x4F53;&#x5B9E;&#x9A8C;&#x5BA4;&#x8BBE;&#x8BA1;&#x7CFB;&#x7EDF;&#x3002;<a href="https://www.programmingdesignsystems.com/what-is-a-design-system/index.html#fairuse" target="_blank">&#xA9;</a></p>
</blockquote>
<p>&#x8FD9;&#x4E2A;&#x6807;&#x5FD7;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x8BF4;&#x660E;&#x4E00;&#x4E2A;&#x8BBE;&#x8BA1;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x7ED9;&#x4E00;&#x4E2A;&#x7EC4;&#x7EC7;&#x63D0;&#x4F9B;&#x4E00;&#x81F4;&#x7684;&#x5916;&#x89C2;&#x548C;&#x72EC;&#x7279;&#x7684;&#x98CE;&#x683C;&#x3002;&#x8BE5;&#x7CFB;&#x7EDF;&#x65E2;&#x7B80;&#x5355;&#x53C8;&#x7075;&#x6D3B;&#xFF0C;&#x7528;&#x6709;&#x9650;&#x7684;&#x7A7A;&#x95F4;&#x521B;&#x9020;&#x4E86;&#x51E0;&#x4E4E;&#x65E0;&#x9650;&#x7684;&#x8BBE;&#x8BA1;&#x3002;</p>
<p>&#x4ECA;&#x5929;&#xFF0C;&#x8BBE;&#x8BA1;&#x7CFB;&#x7EDF;&#x4E5F;&#x7279;&#x522B;&#x6709;&#x8DA3;&#xFF0C;&#x56E0;&#x4E3A;&#x6570;&#x5B57;&#x4EA7;&#x54C1;&#x662F;&#x7CFB;&#x7EDF;&#x7684;&#xFF0C;&#x7F16;&#x7801;&#x7684;&#x8BBE;&#x8BA1;&#x8005;&#x4E0D;&#x518D;&#x5C40;&#x9650;&#x4E8E;&#x8BBE;&#x8BA1;&#x7CFB;&#x7EDF;&#x7684;&#x521B;&#x5EFA;&#xFF0C;&#x56E0;&#x4E3A;&#x8BBE;&#x8BA1;&#x7CFB;&#x7EDF;&#x6700;&#x7EC8;&#x4F1A;&#x51FA;&#x73B0;&#x5728;&#x5370;&#x5237;&#x624B;&#x518C;&#x4E2D;&#x3002;&#x4EE3;&#x7801;&#x5141;&#x8BB8;&#x8BBE;&#x8BA1;&#x8005;&#x4E0D;&#x4EC5;&#x521B;&#x9020;&#x8BBE;&#x8BA1;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x5EFA;&#x7ACB;&#x6570;&#x5B57;&#x7CFB;&#x7EDF;&#x6765;&#x521B;&#x9020;&#x8BBE;&#x8BA1;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x5C06;&#x82B1;&#x8D39;&#x66F4;&#x591A;&#x7684;&#x65F6;&#x95F4;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x5236;&#x5B9A;&#x7CFB;&#x7EDF;&#x89C4;&#x5219;&#xFF0C;&#x4F46;&#x8BBE;&#x8BA1;&#x5E08;&#x5C06;&#x4E0D;&#x53D7;&#x4F20;&#x7EDF;&#x8BBE;&#x8BA1;&#x8F6F;&#x4EF6;&#x7684;&#x9650;&#x5236;&#x3002;&#x7F8E;&#x56FD;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x5BB6;&#x5510;&#x7EB3;&#x5FB7;&#xB7;&#x514B;&#x52AA;&#x65AF;(DonaldKnuth)&#x5C31;&#x8FD9;&#x6837;&#x5199;&#x9053;&#xFF1A;</p>
<p><em>&#x201C;&#x5143;&#x8BBE;&#x8BA1;&#x6BD4;&#x8BBE;&#x8BA1;&#x56F0;&#x96BE;&#x5F97;&#x591A;&#xFF1B;&#x7ED8;&#x5236;&#x4E1C;&#x897F;&#x6BD4;&#x89E3;&#x91CA;&#x5982;&#x4F55;&#x7ED8;&#x5236;&#x66F4;&#x5BB9;&#x6613;&#x3002;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x6F5C;&#x5728;&#x89C4;&#x8303;&#x96C6;&#x5408;&#x4E0D;&#x80FD;&#x8F7B;&#x6613;&#x5730;&#x540C;&#x65F6;&#x9884;&#x89C1;&#x3002;&#x53E6;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x5FC5;&#x987B;&#x88AB;&#x5B8C;&#x5168;&#x544A;&#x8BC9;&#x4E00;&#x5207;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x4E00;&#x65E6;&#x6211;&#x4EEC;&#x6210;&#x529F;&#x5730;&#x89E3;&#x91CA;&#x4E86;&#x5982;&#x4F55;&#x4EE5;&#x8DB3;&#x591F;&#x4E00;&#x822C;&#x7684;&#x65B9;&#x5F0F;&#x7ED8;&#x5236;&#x4E00;&#x4E9B;&#x4E1C;&#x897F;&#xFF0C;&#x90A3;&#x4E48;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x540C;&#x6837;&#x7684;&#x89E3;&#x91CA;&#x5C06;&#x9002;&#x7528;&#x4E8E;&#x76F8;&#x5173;&#x7684;&#x5F62;&#x72B6;&#xFF1B;&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x5236;&#x5B9A;&#x7CBE;&#x786E;&#x89E3;&#x91CA;&#x65F6;&#x82B1;&#x8D39;&#x7684;&#x65F6;&#x95F4;&#x662F;&#x503C;&#x5F97;&#x7684;&#x3002;&#x201D;</em></p>
<blockquote>
<p>&#x300A;Metafont&#x300B;Donald Knuth(1986)</p>
</blockquote>
<p>&#x5728;&#x8FD9;&#x4E2A;&#x65B9;&#x9762;&#xFF0C;&#x201C;&#x8DB3;&#x591F;&#x666E;&#x904D;&#x7684;&#x6001;&#x5EA6;&#x201D;&#x4E00;&#x8BCD;&#x5F88;&#x91CD;&#x8981;&#x3002;&#x8F6F;&#x4EF6;&#x53EF;&#x4EE5;&#x88AB;&#x7F16;&#x5199;&#x6210;&#x5141;&#x8BB8;&#x4E00;&#x7CFB;&#x5217;&#x53EF;&#x80FD;&#x7684;&#x8F93;&#x51FA;&#xFF0C;&#x8BBE;&#x8BA1;&#x7CFB;&#x7EDF;&#x7684;&#x53D8;&#x5316;&#x53EF;&#x4EE5;&#x5728;(&#x5B57;&#x9762;&#x4E0A;&#x7684;)&#x4E00;&#x79D2;&#x5185;&#x4EA7;&#x751F;&#x3002;&#x7A0B;&#x5E8F;&#x751F;&#x6210;&#x8BBE;&#x8BA1;&#x7684;&#x80FD;&#x529B;&#x662F;&#x7B97;&#x6CD5;&#x8BBE;&#x8BA1;&#x4E2D;&#x6700;&#x6709;&#x529B;&#x91CF;&#x7684;&#x80FD;&#x529B;&#x4E4B;&#x4E00;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x5B83;&#x5BFC;&#x81F4;&#x4E00;&#x4E2A;&#x6807;&#x5FD7;&#x4EA7;&#x751F;<a href="http://thegreeneyl.com/mit-media-lab-identity-1" target="_blank">45,000&#x4E2A;&#x53D8;&#x4F53;</a>&#xFF0C;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x5177;&#x6709;&#x751F;&#x6210;&#x666F;&#x89C2;&#x7684;<a href="http://www.no-mans-sky.com/" target="_blank">&#x65E0;&#x9650;&#x884C;&#x661F;&#x661F;&#x7CFB;</a>&#xFF0C;&#x8FD8;&#x662F;&#x521B;&#x5EFA;&#x4E00;&#x7BC7;&#x6839;&#x636E;&#x5730;&#x56FE;&#x9009;&#x62E9;&#x6539;&#x53D8;&#x5176;&#x5185;&#x5BB9;&#x7684;<a href="http://www.nytimes.com/interactive/2015/05/03/upshot/the-best-and-worst-places-to-grow-up-how-your-area-compares.html" target="_blank">&#x52A8;&#x6001;&#x6587;&#x7AE0;</a>&#x3002;</p>
<p><img src="https://www.programmingdesignsystems.com/assets/what-is-a-design-system/earth-day.jpg" alt=""></p>
<blockquote>
<p>&#x4FDD;&#x7F57;&#xB7;&#x5170;&#x5FB7;&#x8BBE;&#x8BA1;&#x7684;&#x6D77;&#x62A5;&#x3002;&#xA9;</p>
</blockquote>
<p><iframe height="755" width="600" scrolling="no" title="&#x8BBE;&#x8BA1;&#x7CFB;&#x7EDF;&#x7F16;&#x7A0B;&#x793A;&#x4F8B;1" src="https://codepen.io/yylifen/embed/oKXxLR?height=265&amp;theme-id=light&amp;default-tab=js,result" frameborder="no" allowtransparency="true" allowfullscreen="true">
  See the Pen <a href="https://codepen.io/yylifen/pen/oKXxLR" target="_blank">&#x7F16;&#x7A0B;&#x8BBE;&#x8BA1;&#x7CFB;&#x7EDF;&#x793A;&#x4F8B;1</a> by yylifen
  (<a href="https://codepen.io/yylifen" target="_blank">@yylifen</a>) on <a href="https://codepen.io" target="_blank">CodePen</a>.
</iframe></p>
<blockquote>
<p>&#x540C;&#x6837;&#x7684;&#x6D77;&#x62A5;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x91CD;&#x73B0;&#x3002;</p>
</blockquote>
<p>&#x5728;&#x8FD9;&#x672C;&#x4E66;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x7814;&#x7A76;&#x5728;&#x9F13;&#x52B1;&#x8BBE;&#x8BA1;&#x5E08;&#x521B;&#x5EFA;&#x8BBE;&#x8BA1;&#x7CFB;&#x7EDF;&#x5E76;&#x901A;&#x8FC7;&#x7F16;&#x5199;&#x8F6F;&#x4EF6;&#x4F7F;&#x8FD9;&#x4E9B;&#x7CFB;&#x7EDF;&#x6709;&#x751F;&#x547D;&#x529B;&#x65F6;&#x53EF;&#x4EE5;&#x6784;&#x5EFA;&#x4E9B;&#x4EC0;&#x4E48;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"0.1.什么是设计系统","level":"1.2.1","depth":2,"next":{"title":"1.形状","level":"1.3","depth":1,"ref":"","articles":[{"title":"1.1 图形基础","level":"1.3.1","depth":2,"path":"chapters/1.1.md","ref":"chapters/1.1.md","articles":[]},{"title":"1.2 基本形状","level":"1.3.2","depth":2,"path":"chapters/1.2.md","ref":"chapters/1.2.md","articles":[]},{"title":"1.3 定制形状","level":"1.3.3","depth":2,"path":"chapters/1.3.md","ref":"chapters/1.3.md","articles":[]},{"title":"1.4 程序形状","level":"1.3.4","depth":2,"path":"chapters/1.4.md","ref":"chapters/1.4.md","articles":[]}]},"previous":{"title":"0.设计系统","level":"1.2","depth":1,"ref":"","articles":[{"title":"0.1.什么是设计系统","level":"1.2.1","depth":2,"path":"chapters/0.md","ref":"chapters/0.md","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"chapters/0.md","mtime":"2019-09-27T12:26:54.051Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-09-27T12:54:50.956Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

