
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>1.1 图形基础 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="1.2.html" />
    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    设计系统编程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    0.设计系统
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="0.html">
            
                <a href="0.html">
            
                    
                    0.1.什么是设计系统
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    1.形状
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.3.1" data-path="1.1.html">
            
                <a href="1.1.html">
            
                    
                    1.1 图形基础
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="1.2.html">
            
                <a href="1.2.html">
            
                    
                    1.2 基本形状
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="1.3.html">
            
                <a href="1.3.html">
            
                    
                    1.3 定制形状
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="1.4.html">
            
                <a href="1.4.html">
            
                    
                    1.4 程序形状
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    2.颜色
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="2.1.html">
            
                <a href="2.1.html">
            
                    
                    2.1 颜色理论简史
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="2.2.html">
            
                <a href="2.2.html">
            
                    
                    2.2 颜色模型及颜色空间
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="2.3.html">
            
                <a href="2.3.html">
            
                    
                    2.3 感知颜色空间的一致性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4" data-path="2.4.html">
            
                <a href="2.4.html">
            
                    
                    2.4 配色方案
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" >
            
                <span>
            
                    
                    3.布局
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="3.1.html">
            
                <a href="3.1.html">
            
                    
                    3.1 几何图形简史
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" >
            
                <span>
            
                    
                    未完持续更新...
            
                </span>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >1.1 图形基础</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x56FE;&#x5F62;&#x57FA;&#x7840;figure-and-ground">&#x56FE;&#x5F62;&#x57FA;&#x7840;Figure and ground</h2>
<p>&#x5E73;&#x9762;&#x8BBE;&#x8BA1;&#x662F;&#x7528;&#x5F62;&#x5F0F;&#x548C;&#x989C;&#x8272;&#x6765;&#x6210;&#x529F;&#x4F20;&#x8FBE;&#x4FE1;&#x606F;&#x7684;&#x827A;&#x672F;&#xFF0C;&#x4F46;&#x8FD9;&#x5E76;&#x4E0D;&#x50CF;&#x542C;&#x8D77;&#x6765;&#x90A3;&#x4E48;&#x5BB9;&#x6613;&#x3002;&#x8BBE;&#x8BA1;&#x8FC7;&#x7A0B;&#x662F;&#x4E00;&#x4E2A;&#x53CD;&#x590D;&#x5C1D;&#x8BD5;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x901A;&#x5E38;&#x9700;&#x8981;&#x591A;&#x6B21;&#x8FED;&#x4EE3;&#x624D;&#x80FD;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x6E05;&#x6670;&#x5730;&#x4F20;&#x8FBE;&#x60A8;&#x60F3;&#x8981;&#x8BF4;&#x7684;&#x5185;&#x5BB9;&#x7684;&#x8BBE;&#x8BA1;&#x3002;&#x867D;&#x7136;&#x6211;&#x4EEC;&#x503E;&#x5411;&#x4E8E;&#x8BA4;&#x4E3A;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x6D89;&#x53CA;&#x5230;&#x76F4;&#x89C9;&#xFF0C;&#x7ECF;&#x9A8C;&#x4E30;&#x5BCC;&#x7684;&#x8BBE;&#x8BA1;&#x5E08;&#x6709;&#x4E00;&#x4E2A;&#x4E0D;&#x65AD;&#x6269;&#x5C55;&#x7684;&#x89C6;&#x89C9;&#x5173;&#x7CFB;&#x6E05;&#x5355;&#xFF0C;&#x5E2E;&#x52A9;&#x4ED6;&#x4EEC;&#x901A;&#x8FC7;&#x6700;&#x7EC8;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x8FDB;&#x5165;&#x5E73;&#x9762;&#x8BBE;&#x8BA1;&#x9886;&#x57DF;&#x7684;&#x7B2C;&#x4E00;&#x6B65;&#x662F;&#x770B;&#x8FD9;&#x5F20;&#x6E05;&#x5355;&#x4E0A;&#x7684;&#x7B2C;&#x4E00;&#x9879;&#xFF1A;&#x56FE;&#x5F62;&#x548C;&#x5B83;&#x7684;&#x57FA;&#x7840;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x3002;&#x5728;&#x4E0B;&#x9762;&#x7684;&#x6587;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x77E9;&#x5F62;&#x6765;&#x6F14;&#x793A;&#x5982;&#x4F55;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x64CD;&#x4F5C;&#x4E09;&#x4E2A;&#x7B80;&#x5355;&#x53D8;&#x91CF;-&#x4F4D;&#x7F6E;&#x3001;&#x5927;&#x5C0F;&#x548C;&#x65CB;&#x8F6C;-&#x4EE5;&#x521B;&#x5EFA;&#x5404;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x3002;&#x867D;&#x7136;&#x8FD9;&#x770B;&#x8D77;&#x6765;&#x5F88;&#x57FA;&#x672C;&#xFF0C;&#x4F46;&#x8FD9;&#x4E9B;&#x5173;&#x7CFB;&#x5728;&#x5927;&#x591A;&#x6570;&#x6210;&#x529F;&#x7684;&#x8BBE;&#x8BA1;&#x4E2D;&#x90FD;&#x662F;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x7684;&#x56E0;&#x7D20;&#xFF0C;&#x800C;&#x4E14;&#x5B83;&#x4EEC;&#x4E5F;&#x6070;&#x597D;&#x662F;&#x5F15;&#x5165;&#x89C6;&#x89C9;&#x4F20;&#x8FBE;&#x6982;&#x5FF5;&#x7684;&#x4E00;&#x79CD;&#x5F88;&#x597D;&#x7684;&#x65B9;&#x5F0F;&#x3002;</p>
<h3 id="&#x5B9A;&#x4F4D;">&#x5B9A;&#x4F4D;</h3>
<p>&#x5927;&#x591A;&#x6570;&#x4E66;&#x9762;&#x8BED;&#x8A00;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x81EA;&#x7136;&#x7684;&#x9605;&#x8BFB;&#x65B9;&#x5411;&#x3002;&#x5728;&#x897F;&#x65B9;&#x4E16;&#x754C;&#x7684;&#x5927;&#x591A;&#x6570;&#x5730;&#x65B9;&#xFF0C;&#x6587;&#x5B57;&#x90FD;&#x662F;&#x4EE5;&#x6C34;&#x5E73;&#x7EBF;&#x6392;&#x5217;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x4ECE;&#x5DE6;&#x5230;&#x53F3;&#xFF0C;&#x4ECE;&#x4E0A;&#x5230;&#x4E0B;&#x9605;&#x8BFB;&#x3002;&#x8FD9;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#xFF0C;&#x5F62;&#x72B6;&#x7684;&#x4F4D;&#x7F6E;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x5F15;&#x5BFC;&#x7528;&#x6237;&#x7684;&#x773C;&#x775B;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x8BBE;&#x8BA1;&#x3002;&#x56FE;&#x5F62;&#x5C0F;&#x8BF4;&#x4F7F;&#x7528;&#x6807;&#x9898;&#x7684;&#x5B9A;&#x4F4D;&#x6765;&#x5F15;&#x5BFC;&#x8BFB;&#x8005;&#x901A;&#x8FC7;&#x6545;&#x4E8B;&#x60C5;&#x8282;&#xFF0C;&#x800C;&#x5927;&#x591A;&#x6570;&#x62A5;&#x7EB8;&#x90FD;&#x4F1A;&#x5F15;&#x7528;&#x5F15;&#x6587;&#xFF0C;&#x5728;&#x89C6;&#x89C9;&#x4E0A;&#x5C06;&#x5B83;&#x4EEC;&#x4E0E;&#x6B63;&#x6587;&#x5206;&#x5F00;&#x3002;</p>
<p><img src="../images/p1.png" alt=""></p>
<blockquote>
<p>&#x9996;&#x5148;&#xFF0C;&#x56E0;&#x4E3A;&#x9605;&#x8BFB;&#x65B9;&#x5411;&#x3002;</p>
</blockquote>
<p><img src="../images/p2.png" alt=""></p>
<blockquote>
<p>&#x6700;&#x540E;&#xFF0C;&#x56E0;&#x4E3A;&#x9605;&#x8BFB;&#x65B9;&#x5411;&#x3002;</p>
</blockquote>
<p>&#x5728;&#x8FD9;&#x4E9B;&#x4E3A;&#x745E;&#x58EB;&#x6C7D;&#x8F66;&#x4FF1;&#x4E50;&#x90E8;&#x6D77;&#x62A5;&#xFF0C;&#x7EA6;&#x745F;&#x592B;&#x7A46;&#x52D2;-&#x5E03;&#x7F57;&#x514B;&#x66FC;&#x4F7F;&#x7528;&#x7684;&#x4F4D;&#x7F6E;(&#x548C;&#x5927;&#x5C0F;)&#x4F18;&#x5148;&#x7684;&#x67D0;&#x4E9B;&#x5F62;&#x72B6;&#x3002;&#x5728;&#x7B2C;&#x4E00;&#x5F20;&#x6D77;&#x62A5;&#x4E2D;&#xFF0C;&#x884C;&#x9A76;&#x4E2D;&#x7684;&#x8F66;&#x8F86;&#x4F18;&#x5148;&#x4E8E;&#x8DD1;&#x6B65;&#x7684;&#x5B69;&#x5B50;&#x3002;&#x8FD9;&#x52A0;&#x5267;&#x4E86;&#x7D27;&#x5F20;&#x5C40;&#x52BF;&#xFF0C;&#x5E76;&#x4F7F;&#x8F66;&#x8F86;&#x660E;&#x663E;&#x5730;&#x4E0E;&#x513F;&#x7AE5;&#x53D1;&#x751F;&#x78B0;&#x649E;&#x3002;&#x5728;&#x7B2C;&#x4E8C;&#x5F20;&#x6D77;&#x62A5;&#x4E2D;&#xFF0C;&#x624B;&#x793A;&#x610F;&#x9A91;&#x81EA;&#x884C;&#x8F66;&#x7684;&#x4EBA;&#x662F;&#x9875;&#x9762;&#x4E0A;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x5F62;&#x72B6;&#xFF0C;&#x8FD9;&#x6B63;&#x597D;&#x8FBE;&#x5230;&#x4E86;&#x76F8;&#x53CD;&#x7684;&#x6548;&#x679C;&#x3002;</p>
<p><img src="https://www.programmingdesignsystems.com/assets/shape/figure-and-ground/brockmann-bicycle.jpg" alt=""></p>
<blockquote>
<p>Joseph M&#xFC;ller-Brockmann </p>
</blockquote>
<p>&#x6211;&#x4EEC;&#x4F7F;&#x7528;<code>rect()</code>&#x51FD;&#x6570;&#x7ED8;&#x5236;&#x5E26;&#x6709;P5&#x7684;&#x77E9;&#x5F62;&#xFF0C;&#x4F20;&#x9012;&#x7ED9;&#x8BE5;&#x51FD;&#x6570;&#x7684;&#x524D;&#x4E24;&#x4E2A;&#x6570;&#x5B57;&#x51B3;&#x5B9A;&#x4E86;&#x5F62;&#x72B6;&#x5728;&#x753B;&#x5E03;&#x4E2D;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x4E9B;&#x6570;&#x5B57;&#x90FD;&#x4E3A;&#x96F6;&#xFF0C;&#x5219;&#x5F62;&#x72B6;&#x5C06;&#x51FA;&#x73B0;&#x5728;&#x5DE6;&#x4E0A;&#x89D2;&#xFF0C;&#x66F4;&#x9AD8;&#x7684;&#x503C;&#x5C06;&#x4F7F;&#x5176;&#x8FDB;&#x4E00;&#x6B65;&#x7ED8;&#x5236;&#x5230;&#x753B;&#x5E03;&#x7684;&#x53F3;&#x4FA7;<code>(X)</code>&#x548C;&#x5E95;&#x90E8;<code>(Y)</code>&#x3002;&#x8FD9;&#x4F7F;&#x5F97;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x5F88;&#x5BB9;&#x6613;&#x5B9A;&#x4F4D;&#x5F62;&#x72B6;&#xFF0C;&#x5E76;&#x4E14;&#x8BB8;&#x591A;&#x56FE;&#x5F62;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x90FD;&#x662F;&#x8FD9;&#x6837;&#x5DE5;&#x4F5C;&#x7684;&#x3002;</p>
<p><img src="../images/p3.png" alt=""></p>
<pre><code class="lang-JavaScript">rect(<span class="hljs-number">0</span>, <span class="hljs-number">0</span>, <span class="hljs-number">100</span>, <span class="hljs-number">100</span>);
rect(<span class="hljs-number">300</span>, <span class="hljs-number">200</span>, <span class="hljs-number">100</span>, <span class="hljs-number">100</span>);
</code></pre>
<p>&#x4F7F;&#x7528;&#x7B80;&#x5355;&#x7684;&#x6570;&#x5B66;&#x65B9;&#x6CD5;&#x6839;&#x636E;&#x753B;&#x5E03;&#x7684;&#x5927;&#x5C0F;&#x8BA1;&#x7B97;&#x5F62;&#x72B6;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x968F;&#x673A;&#x8F93;&#x5165;&#x6570;&#x5B57;&#xFF0C;&#x76F4;&#x5230;&#x5F62;&#x72B6;&#x5904;&#x4E8E;&#x6B63;&#x786E;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x8FD9;&#x5C06;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x663E;&#x5F0F;&#x5730;&#x5B9A;&#x4E49;&#x753B;&#x5E03;&#x548C;&#x5F62;&#x72B6;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x5E76;&#x4F7F;&#x6269;&#x5C55;&#x8BBE;&#x8BA1;&#x53D8;&#x5F97;&#x66F4;&#x5BB9;&#x6613;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4EE5;&#x4E0B;&#x9762;&#x7684;&#x56FE;&#x50CF;&#x4E3A;&#x4F8B;&#x3002;</p>
<p><img src="../images/p4.png" alt=""></p>
<p>&#x8FD9;&#x79CD;&#x8BBE;&#x8BA1;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x7565;&#x5C0F;&#x4E8E;&#x77E9;&#x5F62;&#x7684;<code>x</code>&#x548C;<code>y</code>&#x4F4D;&#x7F6E;&#x7684;&#x753B;&#x5E03;&#x7684;&#x6570;&#x5B57;&#x6765;&#x5B9E;&#x73B0;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x6539;&#x53D8;&#x753B;&#x5E03;&#x7684;&#x5BBD;&#x5EA6;&#xFF0C;&#x77E9;&#x5F62;&#x5C06;&#x4E0D;&#x518D;&#x51FA;&#x73B0;&#x5728;&#x6B63;&#x786E;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x6211;&#x9700;&#x8981;&#x66F4;&#x6539;&#x77E9;&#x5F62;&#x7684;<code>x</code>&#x4F4D;&#x7F6E;&#x4EE5;&#x53CD;&#x6620;&#x65B0;&#x7684;&#x753B;&#x5E03;&#x5927;&#x5C0F;&#x3002;</p>
<p>&#x8FD9;&#x5728;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x4E2D;&#x662F;&#x56FA;&#x5B9A;&#x7684;&#xFF0C;&#x5176;&#x4E2D;<code>width</code>&#x548C;<code>height</code>&#x53D8;&#x91CF;&#x7528;&#x4E8E;&#x52A8;&#x6001;&#x8BA1;&#x7B97;&#x77E9;&#x5F62;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x4E3A;&#x4E86;&#x8BA1;&#x7B97;x&#x4F4D;&#x7F6E;&#xFF0C;&#x6211;&#x4EEC;&#x4ECE;&#x753B;&#x5E03;&#x7684;&#x53F3;&#x8FB9;(<code>width</code>)&#x5F00;&#x59CB;&#xFF0C;&#x7136;&#x540E;&#x51CF;&#x53BB;&#x77E9;&#x5F62;(<code>100</code>)&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x6700;&#x540E;&#x51CF;&#x53BB;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x7684;&#x753B;&#x5E03;&#x8FB9;&#x7F18;&#x548C;&#x77E9;&#x5F62;(<code>25</code>)&#x4E4B;&#x95F4;&#x7684;&#x95F4;&#x9699;&#x3002;<code>y</code>&#x4F4D;&#x7F6E;&#x4E5F;&#x91C7;&#x7528;&#x540C;&#x6837;&#x7684;&#x516C;&#x5F0F;&#x3002;</p>
<pre><code class="lang-JavaScript">rect(width - <span class="hljs-number">100</span> - <span class="hljs-number">25</span>, height - <span class="hljs-number">100</span> - <span class="hljs-number">25</span>, <span class="hljs-number">100</span>, <span class="hljs-number">100</span>);
</code></pre>
<h3 id="&#x5C3A;&#x5BF8;">&#x5C3A;&#x5BF8;</h3>
<p>&#x901A;&#x8FC7;&#x589E;&#x52A0;&#x91CD;&#x8981;&#x5F62;&#x72B6;&#x7684;&#x5927;&#x5C0F;&#x548C;&#x51CF;&#x5C0F;&#x4E0D;&#x592A;&#x91CD;&#x8981;&#x7684;&#x5F62;&#x72B6;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x53EF;&#x4EE5;&#x4E3A;&#x8BBE;&#x8BA1;&#x5E26;&#x6765;&#x6E05;&#x6670;&#x6027;&#x3002;&#x8FD9;&#x662F;&#x6211;&#x4EEC;&#x6BCF;&#x5929;&#x90FD;&#x4F1A;&#x9047;&#x5230;&#x7684;&#x6A21;&#x5F0F;&#xFF0C;&#x4ECE;&#x4EA4;&#x901A;&#x6807;&#x5FD7;&#x5230;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#x7684;&#x6807;&#x9898;&#x3002;</p>
<p><img src="../images/p1.png" alt=""></p>
<blockquote>
<p>&#x8FD9;&#x4E2A;&#x5E7F;&#x573A;&#x5360;&#x4F18;&#x52BF;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5360;&#x636E;&#x4E86;&#x5927;&#x90E8;&#x5206;&#x7684;&#x753B;&#x5E03;&#x3002;</p>
</blockquote>
<p><img src="../images/p2.png" alt=""></p>
<blockquote>
<p>&#x8FD9;&#x4E2A;&#x5E7F;&#x573A;&#x4E0D;&#x592A;&#x5360;&#x4F18;&#x52BF;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5468;&#x56F4;&#x6709;&#x5F88;&#x5927;&#x7684;&#x7A7A;&#x65F7;&#x7A7A;&#x95F4;&#x3002;</p>
</blockquote>
<p>1959&#x5E74;&#x5F00;&#x59CB;&#x7684;&#x5C0F;&#x89C4;&#x6A21;&#x5E7F;&#x544A;&#x6D3B;&#x52A8;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x8BF4;&#x660E;&#x4E86;&#x5982;&#x4F55;&#x5229;&#x7528;&#x5927;&#x5C0F;&#x6765;&#x5F3A;&#x8C03;&#x6587;&#x672C;&#x7684;&#x652F;&#x6301;&#x6027;&#x3002;&#x5728;&#x8FD9;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x6742;&#x5FD7;&#x5E7F;&#x544A;&#x4E2D;&#xFF0C;&#x5927;&#x4F17;&#x7532;&#x58F3;&#x866B;&#x7684;&#x5F62;&#x8C61;&#x88AB;&#x5370;&#x5728;&#x4E00;&#x5F20;&#x7A7A;&#x7A7A;&#x7684;&#x5E06;&#x5E03;&#x4E0A;&#xFF0C;&#x5927;&#x5C0F;&#x4E0D;&#x4E00;&#x3002;</p>
<p><img src="https://www.programmingdesignsystems.com/assets/shape/figure-and-ground/vw-thinksmall.jpg" alt=""></p>
<blockquote>
<p>Think Small posters </p>
</blockquote>
<p>&#x4F20;&#x9012;&#x7ED9;rect()&#x51FD;&#x6570;&#x7684;&#x7B2C;&#x4E09;&#x4E2A;&#x548C;&#x7B2C;&#x56DB;&#x4E2A;&#x6570;&#x5B57;&#x5B9A;&#x4E49;&#x5F62;&#x72B6;&#x7684;&#x5BBD;&#x5EA6;&#x548C;&#x9AD8;&#x5EA6;&#x3002;&#x4E0E;&#x4F4D;&#x7F6E;&#x4E00;&#x6837;&#xFF0C;&#x6839;&#x636E;&#x753B;&#x5E03;&#x7684;&#x5927;&#x5C0F;&#x52A8;&#x6001;&#x8BA1;&#x7B97;&#x77E9;&#x5F62;&#x7684;&#x5927;&#x5C0F;&#x4E5F;&#x662F;&#x6709;&#x76CA;&#x7684;&#x3002;&#x5728;&#x4E0A;&#x8FF0;&#x793A;&#x4F8B;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x663E;&#x793A;&#x4E86;&#x4E00;&#x4E2A;&#x771F;&#x6B63;&#x7684;&#x52A8;&#x6001;&#x8BBE;&#x8BA1;&#xFF0C;&#x5176;&#x4E2D;&#x7528;&#x4E8E;&#x5927;&#x5C0F;&#x548C;&#x95F4;&#x8DDD;&#x7684;&#x9759;&#x6001;&#x6570;&#x5B57;&#x5DF2;&#x88AB;&#x8BA1;&#x7B97;&#x6240;&#x53D6;&#x4EE3;&#x3002;&#x73B0;&#x5728;&#xFF0C;&#x4F4D;&#x7F6E;&#x548C;&#x5927;&#x5C0F;&#x7684;&#x77E9;&#x5F62;&#x6BD4;&#x4F8B;&#x4E0E;&#x753B;&#x5E03;&#x81EA;&#x52A8;&#x3002;</p>
<p><img src="../images/p7.png" alt=""></p>
<pre><code class="lang-JavaScript">rect(width - (height/<span class="hljs-number">3</span>) - (width/<span class="hljs-number">20</span>), height - (height/<span class="hljs-number">3</span>) - (width/<span class="hljs-number">20</span>), height/<span class="hljs-number">3</span>, height/<span class="hljs-number">3</span>);
</code></pre>
<p>&#x7136;&#x800C;&#xFF0C;&#x4E0A;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x6709;&#x4E00;&#x4E2A;&#x5927;&#x95EE;&#x9898;&#xFF1A;&#x5B83;&#x53D8;&#x5F97;&#x975E;&#x5E38;&#x96BE;&#x8BFB;&#x3002;&#x5982;&#x679C;&#x4F60;&#x9700;&#x8981;&#x6539;&#x53D8;&#x77E9;&#x5F62;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x624D;&#x80FD;&#x4ECE;&#x7CBE;&#x795E;&#x4E0A;&#x5206;&#x6790;&#x6B63;&#x5728;&#x53D1;&#x751F;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5728;&#x4EE3;&#x7801;&#x9876;&#x90E8;&#x4F7F;&#x7528;&#x53D8;&#x91CF;&#x6765;&#x5B58;&#x50A8;&#x8FD9;&#x4E9B;&#x6570;&#x5B57;&#x901A;&#x5E38;&#x662F;&#x5F88;&#x6709;&#x5E2E;&#x52A9;&#x7684;&#x3002;&#x8FD9;&#x4F7F;&#x5F97;&#x4EE3;&#x7801;&#x66F4;&#x6613;&#x8BFB;&#xFF0C;&#x8FD9;&#x4F7F;&#x60A8;(&#x548C;&#x5176;&#x4ED6;&#x7A0B;&#x5E8F;&#x5458;)&#x4EE5;&#x540E;&#x66F4;&#x5BB9;&#x6613;&#x66F4;&#x6539;&#x5B83;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x4EA7;&#x751F;&#x76F8;&#x540C;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x4F46;&#x662F;&#x6240;&#x6709;&#x7684;&#x6570;&#x5B57;&#x73B0;&#x5728;&#x90FD;&#x4FDD;&#x5B58;&#x5230;&#x53D8;&#x91CF;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E9B;&#x53D8;&#x91CF;&#x7684;&#x540D;&#x79F0;&#x53EF;&#x4EE5;&#x6E05;&#x695A;&#x5730;&#x8BF4;&#x660E;&#x5B83;&#x4EEC;&#x7684;&#x76EE;&#x7684;&#x3002;</p>
<pre><code class="lang-JavaScript"><span class="hljs-keyword">var</span> size = height / <span class="hljs-number">3</span>;
<span class="hljs-keyword">var</span> margin = width / <span class="hljs-number">20</span>;
<span class="hljs-keyword">var</span> x = width - margin - size;
<span class="hljs-keyword">var</span> y = height - margin - size;
rect(x, y, size, size);
</code></pre>
<p>&#x4FDD;&#x6301;&#x60A8;&#x7684;&#x4EE3;&#x7801;&#x7EC4;&#x7EC7;&#x662F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5F53;&#x60A8;&#x5F00;&#x59CB;&#x8BBE;&#x8BA1;&#x591A;&#x4E2A;&#x5355;&#x4E00;&#x7684;&#x5F62;&#x72B6;&#x3002;</p>
<h3 id="&#x65CB;&#x8F6C;">&#x65CB;&#x8F6C;</h3>
<p>&#x5F53;&#x60A8;&#x65CB;&#x8F6C;&#x4E00;&#x4E2A;&#x5F62;&#x72B6;&#x65F6;&#xFF0C;&#x5B83;&#x5468;&#x56F4;&#x7684;&#x7A7A;&#x767D;&#x4F1A;&#x53D1;&#x751F;&#x53D8;&#x5316;&#xFF0C;&#x8FD9;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x4F7F;&#x5F62;&#x72B6;&#x770B;&#x8D77;&#x6765;&#x662F;&#x6D3B;&#x52A8;&#x7684;&#x6216;&#x5728;&#x8FD0;&#x52A8;&#x4E2D;&#x3002;</p>
<p><img src="../images/p8.png" alt=""></p>
<blockquote>
<p>&#x7531;&#x4E8E;&#x5BF9;&#x79F0;&#x7A7A;&#x683C;&#xFF0C;&#x6CA1;&#x6709;&#x65CB;&#x8F6C;&#x7684;&#x77E9;&#x5F62;&#x770B;&#x8D77;&#x6765;&#x662F;&#x9759;&#x6001;&#x7684;&#x3002;</p>
</blockquote>
<p><img src="../images/p9.png" alt=""></p>
<blockquote>
<p>45&#xB0;&#x7684;&#x65CB;&#x8F6C;&#x4F1A;&#x4EA7;&#x751F;&#x66F4;&#x590D;&#x6742;&#x7684;-&#x4F46;&#x4ECD;&#x7136;&#x662F;&#x5BF9;&#x79F0;&#x7684;-&#x7A7A;&#x683C;&#x3002;</p>
</blockquote>
<p><img src="../images/p10.png" alt=""></p>
<blockquote>
<p>&#x65CB;&#x8F6C;27&#xB0;&#x6253;&#x7834;&#x4E86;&#x5BF9;&#x79F0;&#x6027;&#xFF0C;&#x77E9;&#x5F62;&#x51FA;&#x73B0;&#x5728;&#x8FD0;&#x52A8;&#x4E2D;&#x3002;</p>
</blockquote>
<p>&#x65CB;&#x8F6C;&#x7684;&#x5F62;&#x72B6;&#x53EF;&#x4EE5;&#x5728;&#x8BB8;&#x591A;&#x8BBE;&#x8BA1;&#x4EA7;&#x54C1;&#x4E2D;&#x627E;&#x5230;&#xFF1A;&#x4E3A;&#x513F;&#x7AE5;&#x5199;&#x7684;&#x4E66;&#x7ECF;&#x5E38;&#x4F7F;&#x7528;&#x65CB;&#x8F6C;&#x7684;&#x5F62;&#x72B6;&#x6765;&#x521B;&#x9020;&#x6709;&#x8DA3;&#x548C;&#x6709;&#x8DA3;&#x7684;&#x8BBE;&#x8BA1;&#x3002;&#x6D41;&#x884C;&#x6742;&#x5FD7;&#x4F7F;&#x7528;&#x65CB;&#x8F6C;&#x7F51;&#x683C;&#x7CFB;&#x7EDF;&#x4F7F;&#x5185;&#x5BB9;&#x770B;&#x8D77;&#x6765;&#x4E0D;&#x90A3;&#x4E48;&#x5E72;&#x71E5;&#xFF0C;&#x800C;&#x9762;&#x5411;&#x72ED;&#x7A84;&#x8BFB;&#x8005;&#x7684;&#x51FA;&#x7248;&#x7269;&#x53EF;&#x80FD;&#x4F1A;&#x5F3A;&#x5236;&#x6267;&#x884C;&#x6A2A;&#x7EBF;&#x548C;&#x5782;&#x76F4;&#x7EBF;&#xFF0C;&#x4EE5;&#x6697;&#x793A;&#x5185;&#x5BB9;&#x7684;&#x8D28;&#x91CF;&#x3002;</p>
<p><img src="https://www.programmingdesignsystems.com/assets/shape/figure-and-ground/rand-iknow.jpg" alt=""></p>
<blockquote>
<p>&#x4FDD;&#x7F57;&#x5170;&#x5FB7;(PaulRand)&#x5728;&#x513F;&#x7AE5;&#x8BFB;&#x7269;&#x7684;&#x5C01;&#x9762;&#x4E0A;&#x4F7F;&#x7528;&#x65CB;&#x8F6C;&#x7684;&#x957F;&#x65B9;&#x5F62;&#x3002;</p>
</blockquote>
<p><img src="https://www.programmingdesignsystems.com/assets/shape/figure-and-ground/adidas.jpg" alt=""></p>
<blockquote>
<p>&#x963F;&#x8FEA;&#x8FBE;&#x65AF;&#x6807;&#x5FD7;&#x4E2D;&#x7684;&#x9886;&#x5956;&#x53F0;&#x88AB;&#x65CB;&#x8F6C;&#x4EE5;&#x4F20;&#x8FBE;&#x901F;&#x5EA6;&#x548C;&#x6D3B;&#x529B;&#x3002;</p>
</blockquote>
<p><code>rotate()</code>&#x51FD;&#x6570;&#x63A5;&#x53D7;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#xFF0C;&#x8FD9;&#x5C06;&#x662F;&#x6240;&#x9700;&#x7684;&#x5F27;&#x5EA6;&#x65CB;&#x8F6C;&#x3002;&#x5F27;&#x5EA6;&#x662F;&#x4E00;&#x4E2A;&#x57FA;&#x4E8E;&#x5706;&#x534A;&#x5F84;&#x7684;&#x89D2;&#x5EA6;&#x5EA6;&#x91CF;&#x7684;&#x6570;&#x5B66;&#x5355;&#x4F4D;&#x3002;&#x5982;&#x679C;&#x4F60;&#x9075;&#x5FAA;&#x4E00;&#x4E2A;&#x5706;&#x7684;&#x8F6E;&#x5ED3;&#xFF0C;&#x5B83;&#x7684;&#x534A;&#x5F84;&#x7684;&#x957F;&#x5EA6;&#xFF0C;&#x8FD9;&#x4E2A;&#x89D2;&#x5EA6;&#x662F;1&#x5F27;&#x5EA6;&#x3002;&#x6839;&#x636E;&#x6570;&#x5B57;&#x7684;&#x9B54;&#x529B;&#xFF0C;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x5706;&#x56E0;&#x6B64;&#x662F;2&#x3C0;(&#x6216;&#x7EA6;6.283)&#x5F27;&#x5EA6;&#x3002;&#x5BF9;&#x4E8E;&#x90A3;&#x4E9B;&#x5BF9;PI&#x7684;&#x590D;&#x6742;&#x6027;&#x4E0D;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x4EBA;&#xFF0C;<code>radians()</code>&#x51FD;&#x6570;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x5C06;&#x5EA6;&#x8F6C;&#x6362;&#x4E3A;&#x5F27;&#x5EA6;&#x3002;&#x4EE5;&#x4E0B;&#x6240;&#x6709;&#x4EE3;&#x7801;&#x884C;&#x90FD;&#x5C06;&#x5BFC;&#x81F4;&#x65CB;&#x8F6C;(&#x5927;&#x7EA6;)90&#x5EA6;&#x3002;</p>
<pre><code class="lang-JavaScript">rotate(PI/<span class="hljs-number">2</span>);
rotate(<span class="hljs-number">1.57</span>);
rotate(radians(<span class="hljs-number">90</span>));
</code></pre>
<p>&#x4F7F;&#x7528;<code>rotate()</code>&#x51FD;&#x6570;&#x65F6;&#xFF0C;&#x4E0D;&#x662F;&#x65CB;&#x8F6C;&#x5355;&#x4E2A;&#x5F62;&#x72B6;&#xFF0C;&#x800C;&#x662F;&#x6574;&#x4E2A;&#x753B;&#x5E03;&#x3002;&#x56E0;&#x4E3A;&#x6240;&#x6709;&#x7684;&#x5F62;&#x72B6;&#x90FD;&#x662F;&#x5728;&#x753B;&#x5E03;&#x4E0A;&#x753B;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x4EEC;&#x6070;&#x597D;&#x4E5F;&#x662F;&#x65CB;&#x8F6C;&#x7684;&#x3002;&#x7ED3;&#x5408;&#x8BA9;&#x753B;&#x5E03;&#x7684;&#x8D77;&#x70B9;&#x79FB;&#x52A8;&#x7684;<code>translate()</code>&#xFF0C;&#x5C31;&#x6709;&#x53EF;&#x80FD;&#x5B9E;&#x73B0;&#x4F60;&#x60F3;&#x8981;&#x7684;&#x90A3;&#x79CD;&#x65CB;&#x8F6C;&#x3002;</p>
<p>&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#xFF0C;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x6DFB;&#x52A0;&#x65CB;&#x8F6C;&#x5230;&#x6211;&#x4EEC;&#x7684;&#x77E9;&#x5F62;&#x4F8B;&#x5B50;&#x4ECE;&#x4E0A;&#x9762;&#x3002;&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x7ED8;&#x5236;&#x77E9;&#x5F62;&#x4E4B;&#x524D;&#x6DFB;&#x52A0;&#x4E86;&#x4E00;&#x4E2A;<code>rotate()</code>&#x51FD;&#x6570;&#x3002;&#x8BF7;&#x6CE8;&#x610F;&#x753B;&#x5E03;(&#x7531;&#x8F83;&#x6697;&#x7684;&#x6846;&#x8868;&#x793A;)&#x662F;&#x5982;&#x4F55;&#x56F4;&#x7ED5;&#x81EA;&#x5DF1;&#x7684;&#x8D77;&#x70B9;&#x65CB;&#x8F6C;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x56F4;&#x7ED5;&#x77E9;&#x5F62;&#x65CB;&#x8F6C;&#x3002;</p>
<pre><code class="lang-JavaScript"><span class="hljs-keyword">var</span> size = height / <span class="hljs-number">3</span>;
<span class="hljs-keyword">var</span> margin = width / <span class="hljs-number">20</span>;
<span class="hljs-keyword">var</span> x = width - margin - size;
<span class="hljs-keyword">var</span> y = height - margin - size;
rotate(radians(<span class="hljs-number">10</span>));
rect(x, y, size, size);
</code></pre>
<p><img src="../images/p11.png" alt=""></p>
<p>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x65CB;&#x8F6C;&#x53D1;&#x751F;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x77E9;&#x5F62;&#x5DE6;&#x4E0A;&#x89D2;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x505A;&#x4E00;&#x4E9B;&#x4E8B;&#x60C5;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x89C9;&#x5F97;&#x6709;&#x70B9;&#x4E0D;&#x76F4;&#x89C2;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x4F7F;&#x7528;&#x8F6C;&#x6362;()&#x51FD;&#x6570;&#x5C06;&#x753B;&#x5E03;&#x79FB;&#x52A8;&#x5230;&#x77E9;&#x5F62;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x8C03;&#x7528;&#x65CB;&#x8F6C;()&#x51FD;&#x6570;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x8F6C;&#x6362;&#x7684;&#x753B;&#x5E03;&#x5DE6;&#x4E0A;&#x89D2;&#x7ED8;&#x5236;&#x77E9;&#x5F62;&#x3002;&#x6B63;&#x5982;&#x4F60;&#x6240;&#x770B;&#x5230;&#x7684;&#xFF0C;&#x65CB;&#x8F6C;&#x73B0;&#x5728;&#x53D1;&#x751F;&#x5728;&#x77E9;&#x5F62;&#x5468;&#x56F4;&#x3002;</p>
<pre><code class="lang-JavaScript"><span class="hljs-keyword">var</span> size = height / <span class="hljs-number">3</span>;
<span class="hljs-keyword">var</span> margin = width / <span class="hljs-number">20</span>;
<span class="hljs-keyword">var</span> x = width - margin - size;
<span class="hljs-keyword">var</span> y = height - margin - size;
translate(x, y);
rotate(radians(<span class="hljs-number">10</span>));
rect(<span class="hljs-number">0</span>, <span class="hljs-number">0</span>, size, size);
</code></pre>
<p><img src="../images/p12.png" alt=""></p>
<p>&#x968F;&#x7740;&#x6211;&#x4EEC;&#x6DF1;&#x5165;&#x7814;&#x7A76;&#x66F4;&#x591A;&#x7684;&#x5E03;&#x5C40;&#x6280;&#x672F;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x8FDB;&#x4E00;&#x6B65;&#x7814;&#x7A76;&#x5982;&#x4F55;&#x4F7F;&#x7528;<code>translate()</code>&#x548C;<code>rotate()</code>&#x6765;&#x8FDB;&#x884C;&#x66F4;&#x590D;&#x6742;&#x7684;&#x8BBE;&#x8BA1;&#x3002;</p>
<h3 id="&#x8BBE;&#x8BA1;&#x4E00;&#x4E2A;&#x8BCD;">&#x8BBE;&#x8BA1;&#x4E00;&#x4E2A;&#x8BCD;</h3>
<p>&#x7EC3;&#x4E60;&#x8FD9;&#x4E9B;&#x5173;&#x7CFB;&#x7684;&#x4E00;&#x4E2A;&#x597D;&#x65B9;&#x6CD5;&#x662F;&#x201C;&#x8BBE;&#x8BA1;&#x4E00;&#x4E2A;&#x5355;&#x8BCD;&#x201D;&#x7EC3;&#x4E60;&#x3002;&#x4ECE;&#x5B57;&#x5178;&#x4E2D;&#x6311;&#x9009;&#x4E00;&#x4E2A;&#x5F62;&#x5BB9;&#x8BCD;&#xFF0C;&#x5E76;&#x901A;&#x8FC7;&#x6539;&#x53D8;&#x5355;&#x4E2A;&#x77E9;&#x5F62;&#x7684;&#x4F4D;&#x7F6E;&#x3001;&#x5927;&#x5C0F;&#x548C;&#x65CB;&#x8F6C;&#x6765;&#x4E3A;&#x5176;&#x8BBE;&#x8BA1;&#x3002;&#x8FD9;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x4F60;&#x5EFA;&#x7ACB;&#x56FE;&#x5F62;&#x8BBE;&#x8BA1;&#x4E2D;&#x6700;&#x57FA;&#x672C;&#x7684;&#x6280;&#x80FD;&#x4E4B;&#x4E00;&#xFF1A;&#x521B;&#x5EFA;&#x5BF9;&#x4F60;&#x7684;&#x5185;&#x5BB9;&#x6709;&#x610F;&#x4E49;&#x7684;&#x89C6;&#x89C9;&#x5173;&#x7CFB;&#x7684;&#x80FD;&#x529B;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x7684;&#x793A;&#x4F8B;&#x6F14;&#x793A;&#x4E86;&#x201C;&#x9661;&#x5CED;&#x201D;&#x4E00;&#x8BCD;&#x7684;&#x7EC3;&#x4E60;&#x3002;&#x4F60;&#x5982;&#x4F55;&#x7528;&#x4E00;&#x4E2A;&#x77E9;&#x5F62;&#x548C;&#x4E09;&#x4E2A;&#x53D8;&#x91CF;&#x6765;&#x8BBE;&#x8BA1;&#x8FD9;&#x4E2A;&#x8BCD;&#x5462;&#xFF1F;&#x67E5;&#x627E;&#x5355;&#x8BCD;&#x548C;&#x53D8;&#x91CF;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x8054;&#xFF0C;&#x60A8;&#x53EF;&#x80FD;&#x4F1A;&#x6CE8;&#x610F;&#x5230;&#x9661;&#x5CED;&#x5EA6;&#x548C;&#x65CB;&#x8F6C;&#x662F;&#x76F8;&#x5173;&#x7684;&#xFF1A;&#x901A;&#x8FC7;&#x65CB;&#x8F6C;&#x77E9;&#x5F62;&#x53EF;&#x4EE5;&#x4F7F;&#x77E9;&#x5F62;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x9661;&#x5CED;&#x7684;&#x5C71;&#x4E18;&#x3002;&#x901A;&#x8FC7;&#x6539;&#x53D8;&#x5927;&#x5C0F;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x90A3;&#x5EA7;&#x5C71;&#x66F4;&#x957F;&#xFF0C;&#x7EE7;&#x7EED;&#x5728;&#x753B;&#x5E03;&#x5916;&#x3002;&#x901A;&#x8FC7;&#x66F4;&#x6539;&#x77E9;&#x5F62;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x975E;&#x5BF9;&#x79F0;&#x7A7A;&#x683C;&#xFF0C;&#x786E;&#x4FDD;&#x7528;&#x6237;&#x6CE8;&#x610F;&#x5230;&#x8BE5;&#x77E9;&#x5F62;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x8349;&#x56FE;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x6F14;&#x793A;&#x4E86;&#x8FD9;&#x4E9B;&#x6B65;&#x9AA4;&#x3002;</p>
<p><img src="../images/p13.png" alt=""></p>
<blockquote>
<p>1.&#x9996;&#x5148;&#xFF0C;&#x6211;&#x4EEC;&#x65CB;&#x8F6C;&#x77E9;&#x5F62;&#xFF0C;&#x76F4;&#x5230;&#x5B83;&#x770B;&#x8D77;&#x6765;&#x9661;&#x5CED;&#x3002;</p>
</blockquote>
<p><img src="../images/p14.png" alt=""></p>
<blockquote>
<p>2.&#x7136;&#x540E;&#x6211;&#x4EEC;&#x6539;&#x53D8;&#x5C3A;&#x5BF8;&#xFF0C;&#x4F7F;&#x5B83;&#x8D85;&#x8D8A;&#x753B;&#x5E03;&#x3002;</p>
</blockquote>
<p><img src="../images/p15.png" alt=""></p>
<blockquote>
<p>3.&#x5C06;&#x77E9;&#x5F62;&#x4ECE;&#x4E2D;&#x5FC3;&#x79FB;&#x5F00;&#xFF0C;&#x4ECE;&#x800C;&#x5F15;&#x8D77;&#x4EBA;&#x4EEC;&#x5BF9;&#x77E9;&#x5F62;&#x7684;&#x6CE8;&#x610F;&#x3002;</p>
</blockquote>
<p>&#x4E0B;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x663E;&#x793A;&#x4E86;&#x66F4;&#x591A;&#x7528;&#x4E8E;&#x7075;&#x611F;&#x7684;&#x8BBE;&#x8BA1;&#x3002;&#x8BB0;&#x4F4F;&#xFF0C;&#x5E76;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x7684;&#x5F62;&#x5BB9;&#x8BCD;&#x90FD;&#x662F;&#x76F4;&#x622A;&#x4E86;&#x5F53;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x6E34;&#x671B;&#x66F4;&#x591A;&#x7684;&#x5F62;&#x72B6;&#x3002;&#x8FD9;&#x662F;&#x4E0B;&#x4E00;&#x7AE0;&#x7684;&#x4E3B;&#x9898;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x8981;&#x62C5;&#x5FC3;&#x3002;</p>
<p><img src="../images/p16.png" alt=""></p>
<blockquote>
<p><a href="https://github.com/runemadsen/programmingdesignsystems.com/tree/master/examples/shape/figure-and-ground/flat.js" target="_blank">&#x6E90;&#x7801;</a></p>
</blockquote>
<p><img src="../images/p17.png" alt=""></p>
<blockquote>
<p><a href="https://github.com/runemadsen/programmingdesignsystems.com/tree/master/examples/shape/figure-and-ground/big.js" target="_blank">&#x6E90;&#x7801;</a></p>
</blockquote>
<p><img src="../images/p18.png" alt=""></p>
<blockquote>
<p><a href="https://github.com/runemadsen/programmingdesignsystems.com/tree/master/examples/shape/figure-and-ground/shy.js" target="_blank">&#x6E90;&#x7801;</a></p>
</blockquote>
<p>&#x672C;&#x7AE0;&#x5C06;&#x5C55;&#x793A;&#x4E00;&#x79CD;&#x8D2F;&#x7A7F;&#x672C;&#x4E66;&#x7684;&#x6301;&#x7EED;&#x4E3B;&#x9898;&#xFF1A;&#x6211;&#x4EEC;&#x5C06;&#x4ECE;&#x5E73;&#x9762;&#x8BBE;&#x8BA1;&#x7406;&#x8BBA;&#x4E2D;&#x83B7;&#x53D6;&#x4E3B;&#x9898;&#xFF0C;&#x4E86;&#x89E3;&#x5982;&#x4F55;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x5B9E;&#x73B0;&#x8FD9;&#x4E9B;&#x60F3;&#x6CD5;&#xFF0C;&#x5E76;&#x901A;&#x8FC7;&#x7EC3;&#x4E60;&#x5B9E;&#x8DF5;&#x8FD9;&#x4E9B;&#x6982;&#x5FF5;&#x3002;&#x867D;&#x7136;&#x8FD9;&#x4EC5;&#x4EC5;&#x662F;&#x8FDB;&#x5165;&#x5E73;&#x9762;&#x8BBE;&#x8BA1;&#x4E16;&#x754C;&#x7684;&#x7B2C;&#x4E00;&#x6B65;&#xFF0C;&#x4F46;&#x662F;&#x56FE;&#x5F62;&#x548C;&#x5B83;&#x7684;&#x57FA;&#x7840;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x662F;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x3002;&#x5728;&#x73B0;&#x6709;&#x8BBE;&#x8BA1;&#x4E2D;&#x53D1;&#x73B0;&#x95EE;&#x9898;&#x662F;&#x5F88;&#x5E38;&#x89C1;&#x7684;&#xFF0C;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x53EF;&#x4EE5;&#x8FFD;&#x6EAF;&#x5230;&#x8FD9;&#x79CD;&#x5173;&#x7CFB;&#x4E2D;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x7528;&#x6237;&#x754C;&#x9762;&#x6CA1;&#x6709;&#x5F3A;&#x8C03;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x6309;&#x94AE;&#xFF0C;&#x8FD8;&#x662F;&#x5B83;&#x7684;&#x5E95;&#x5C42;&#x6570;&#x636E;&#x96C6;&#x5468;&#x56F4;&#x6709;&#x6A21;&#x7CCA;&#x7684;&#x56FE;&#x5F62;&#x3002;&#x8BB0;&#x4F4F;&#x4E0D;&#x8981;&#x6025;&#x4E8E;&#x4F7F;&#x4E8B;&#x60C5;&#x53D8;&#x5F97;&#x6F02;&#x4EAE;&#xFF0C;&#x5E76;&#x4F7F;&#x8FD9;&#x4E9B;&#x6982;&#x5FF5;&#x6210;&#x4E3A;&#x60A8;&#x7684;&#x8BBE;&#x8BA1;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x5173;&#x952E;&#x90E8;&#x5206;&#x3002;</p>
<svg width="100%" height="3" xmlns="http://www.w3.org/2000/svg"><line x1="0" y1="1" x2="100%" y2="1" stroke-dasharray="6, 3" stroke-width="2" stroke="#29b79b"/></svg>

<h3 id="&#x7EC3;&#x4E60;">&#x7EC3;&#x4E60;</h3>
<p>&#x4ECE;&#x5B57;&#x5178;&#x4E2D;&#x968F;&#x673A;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x5F62;&#x5BB9;&#x8BCD;&#xFF0C;&#x7136;&#x540E;&#x5199;&#x4E00;&#x4E2A;&#x8349;&#x56FE;&#xFF0C;&#x8BD5;&#x56FE;&#x901A;&#x8FC7;&#x6539;&#x53D8;&#x5355;&#x4E2A;&#x77E9;&#x5F62;&#x7684;&#x4F4D;&#x7F6E;&#x3001;&#x5927;&#x5C0F;&#x548C;&#x65CB;&#x8F6C;&#x6765;&#x4F20;&#x8FBE;&#x8FD9;&#x4E2A;&#x8BCD;&#x3002;&#x8FD9;&#x6837;&#x505A;&#x6709;&#x51E0;&#x4E2A;&#x8BCD;&#xFF0C;&#x5E76;&#x8981;&#x6C42;&#x670B;&#x53CB;&#x731C;&#x5355;&#x8BCD;-&#x5F62;&#x8C61;&#x7EC4;&#x5408;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
                <a href="1.2.html" class="navigation navigation-next navigation-unique" aria-label="Next page: 1.2 基本形状">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"1.1 图形基础","level":"1.3.1","depth":2,"next":{"title":"1.2 基本形状","level":"1.3.2","depth":2,"path":"chapters/1.2.md","ref":"chapters/1.2.md","articles":[]},"previous":{"title":"1.形状","level":"1.3","depth":1,"ref":"","articles":[{"title":"1.1 图形基础","level":"1.3.1","depth":2,"path":"chapters/1.1.md","ref":"chapters/1.1.md","articles":[]},{"title":"1.2 基本形状","level":"1.3.2","depth":2,"path":"chapters/1.2.md","ref":"chapters/1.2.md","articles":[]},{"title":"1.3 定制形状","level":"1.3.3","depth":2,"path":"chapters/1.3.md","ref":"chapters/1.3.md","articles":[]},{"title":"1.4 程序形状","level":"1.3.4","depth":2,"path":"chapters/1.4.md","ref":"chapters/1.4.md","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"chapters/1.1.md","mtime":"2019-09-24T14:33:35.938Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-09-27T12:54:50.956Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

