
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>1.2 基本形状 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="1.3.html" />
    
    
    <link rel="prev" href="1.1.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    设计系统编程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    0.设计系统
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="0.html">
            
                <a href="0.html">
            
                    
                    0.1.什么是设计系统
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    1.形状
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="1.1.html">
            
                <a href="1.1.html">
            
                    
                    1.1 图形基础
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3.2" data-path="1.2.html">
            
                <a href="1.2.html">
            
                    
                    1.2 基本形状
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="1.3.html">
            
                <a href="1.3.html">
            
                    
                    1.3 定制形状
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="1.4.html">
            
                <a href="1.4.html">
            
                    
                    1.4 程序形状
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    2.颜色
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="2.1.html">
            
                <a href="2.1.html">
            
                    
                    2.1 颜色理论简史
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="2.2.html">
            
                <a href="2.2.html">
            
                    
                    2.2 颜色模型及颜色空间
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="2.3.html">
            
                <a href="2.3.html">
            
                    
                    2.3 感知颜色空间的一致性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4" data-path="2.4.html">
            
                <a href="2.4.html">
            
                    
                    2.4 配色方案
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" >
            
                <span>
            
                    
                    3.布局
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="3.1.html">
            
                <a href="3.1.html">
            
                    
                    3.1 几何图形简史
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" >
            
                <span>
            
                    
                    未完持续更新...
            
                </span>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >1.2 基本形状</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x57FA;&#x672C;&#x5F62;&#x72B6;">&#x57FA;&#x672C;&#x5F62;&#x72B6;</h2>
<p>&#x53EA;&#x8981;&#x6211;&#x4EEC;&#x6709;&#x7ED8;&#x753B;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x4EBA;&#x7C7B;&#x5C31;&#x4F1A;&#x5229;&#x7528;&#x5F62;&#x72B6;&#x6765;&#x8FDB;&#x884C;&#x89C6;&#x89C9;&#x4EA4;&#x6D41;&#x3002;&#x867D;&#x7136;&#x5F62;&#x72B6;&#x4E0D;&#x662F;&#x6587;&#x5B57;&#xFF0C;&#x56E0;&#x6B64;&#x6CA1;&#x6709;&#x5BA2;&#x89C2;&#x7684;&#x8BED;&#x4E49;&#x610F;&#x4E49;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x5BF9;&#x5982;&#x4F55;&#x5C06;&#x5F62;&#x72B6;&#x7684;&#x7279;&#x5F81;&#x8F6C;&#x5316;&#x4E3A;&#x610F;&#x4E49;&#x6709;&#x4E86;&#x4E00;&#x4E2A;&#x81EA;&#x7136;&#x7684;&#x7406;&#x89E3;&#xFF1A;30&#xFF0C;000&#x591A;&#x5E74;&#x524D;&#x521B;&#x9020;&#x7684;&#x6D1E;&#x7A74;&#x753B;&#x53EF;&#x4EE5;&#x5728;&#x4ECA;&#x5929;&#x4E0D;&#x9700;&#x8981;&#x7FFB;&#x8BD1;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x88AB;&#x6B23;&#x8D4F;&#x3002;</p>
<p>&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x67E5;&#x770B;&#x4E09;&#x79CD;&#x57FA;&#x672C;&#x5F62;&#x72B6;&#xFF1A;&#x77E9;&#x5F62;&#x3001;&#x692D;&#x5706;&#x548C;&#x4E09;&#x89D2;&#x5F62;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5206;&#x6790;&#x6BCF;&#x4E2A;&#x5F62;&#x72B6;&#x7684;&#x7279;&#x70B9;&#xFF0C;&#x7136;&#x540E;&#x8BF4;&#x660E;&#x5982;&#x4F55;&#x5728;&#x8BBE;&#x8BA1;&#x8FC7;&#x7A0B;&#x4E2D;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x57FA;&#x672C;&#x5F62;&#x72B6;&#x3002;</p>
<p><img src="../images/1.jpg" alt=""></p>
<h3 id="&#x77E9;&#x5F62;">&#x77E9;&#x5F62;</h3>
<p>&#x8BE5;&#x77E9;&#x5F62;&#x662F;&#x4E00;&#x4E2A;&#x5BF9;&#x79F0;&#x7684;&#xFF0C;&#x5B9E;&#x5FC3;&#x7684;&#x5F62;&#x72B6;&#x4E0E;&#x5E73;&#x884C;&#x7EBF;&#x3002;&#x7531;&#x4E8E;&#x5B83;&#x7684;&#x6027;&#x8D28;&#x5E76;&#x4E0D;&#x591A;&#xFF0C;&#x5B83;&#x5DF2;&#x6210;&#x4E3A;&#x6587;&#x660E;&#x672C;&#x8EAB;&#x7684;&#x8C61;&#x5F81;&#x3002;&#x6211;&#x4EEC;&#x7528;&#x77E9;&#x5F62;&#x7F51;&#x683C;&#x5EFA;&#x9020;&#x57CE;&#x5E02;&#xFF0C;&#x7528;&#x7816;&#x5757;&#x5EFA;&#x9020;&#x623F;&#x5C4B;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x5185;&#x90E8;&#x4E5F;&#x662F;&#x77E9;&#x5F62;&#x7684;&#xFF1A;&#x95E8;&#x3001;&#x67B6;&#x5B50;&#x548C;&#x7A97;&#x6237;&#x3002;</p>
<p>&#x5728;&#x6574;&#x4E2A;&#x827A;&#x672F;&#x53F2;&#x4E0A;&#xFF0C;&#x957F;&#x65B9;&#x5F62;&#x4E00;&#x76F4;&#x88AB;&#x7528;&#x6765;&#x4E3A;&#x827A;&#x672F;&#x5BB6;&#x8BBE;&#x7F6E;&#x7EA6;&#x675F;&#x3002;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x77E9;&#x5F62;&#x753B;&#x5E03;&#x548C;&#x7F51;&#x683C;&#x7CFB;&#x7EDF;&#x8FDB;&#x4E00;&#x6B65;&#x5C06;&#x8FD9;&#x4E2A;&#x753B;&#x5E03;&#x5212;&#x5206;&#x6210;&#x66F4;&#x5C0F;&#x7684;&#x6A21;&#x5757;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x6570;&#x5B57;&#x65F6;&#x4EE3;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x77E9;&#x5F62;&#x5C4F;&#x5E55;&#xFF0C;&#x5E76;&#x4EE5;&#x4E00;&#x4E2A;&#x65B9;&#x5F62;&#x4F5C;&#x4E3A;&#x6700;&#x5C0F;&#x7684;&#x89C6;&#x89C9;&#x5206;&#x6BCD;&#xFF1A;&#x50CF;&#x7D20;&#x3002;</p>
<p><img src="https://www.programmingdesignsystems.com/assets/shape/basic-shapes/microsoft.jpg" alt=""></p>
<blockquote>
<p>Microsoft&#x5FBD;&#x6807;&#x4E2D;&#x7684;&#x65B9;&#x5757;&#x6210;&#x4E3A;&#x7A97;&#x53E3;&#x3001;&#x6807;&#x5FD7;&#x548C;&#x50CF;&#x7D20;&#x5316;&#x5C4F;&#x5E55;&#x7684;&#x7B26;&#x53F7;&#x3002;</p>
</blockquote>
<p><img src="https://www.programmingdesignsystems.com/assets/shape/basic-shapes/nullsleep.jpg" alt=""></p>
<blockquote>
<p>&#x8FD9;&#x4F4D;8&#x4F4D;&#x97F3;&#x4E50;&#x5BB6;Nullleep&#x7684;&#x6807;&#x5FD7;&#x5728;&#x50CF;&#x7D20;&#x5316;&#x5B57;&#x4F53;&#x7684;&#x9876;&#x90E8;&#x6709;&#x4E00;&#x4E2A;&#x77E9;&#x5F62;&#xFF0C;&#x4F5C;&#x4E3A;&#x53CD;&#x72EC;&#x88C1;&#x4E3B;&#x4E49;&#x548C;&#x65E9;&#x671F;&#x8BA1;&#x7B97;&#x673A;&#x827A;&#x672F;&#x7684;&#x53C2;&#x8003;&#x3002;</p>
</blockquote>
<p>&#x5728;&#x51E0;&#x4F55;&#x5B66;&#x4E2D;&#xFF0C;&#x77E9;&#x5F62;&#x7531;&#x56DB;&#x4E2A;&#x70B9;&#x7EC4;&#x6210;&#xFF0C;&#x8FDE;&#x63A5;&#x6210;&#x4E00;&#x4E2A;&#x5C01;&#x95ED;&#x7684;&#x5F62;&#x72B6;&#xFF0C;&#x5185;&#x89D2;&#x4E3A;90&#x5EA6;&#x3002;&#x4F46;&#x662F;&#xFF0C;P5&#x4E2D;&#x7684;rect()&#x51FD;&#x6570;&#x5141;&#x8BB8;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x58F0;&#x660E;&#x5DE6;&#x4E0A;&#x89D2;(&#x6211;&#x4EEC;&#x5C06;&#x79F0;&#x4E3A;&#x8D77;&#x59CB;&#x70B9;)&#x7684;&#x4F4D;&#x7F6E;&#x4EE5;&#x53CA;&#x77E9;&#x5F62;&#x7684;&#x5927;&#x5C0F;&#x6765;&#x7ED8;&#x5236;&#x77E9;&#x5F62;&#x3002;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF0C;&#x77E9;&#x5F62;&#x6A21;&#x5F0F;()&#x51FD;&#x6570;&#x53EF;&#x7528;&#x4E8E;&#x5C06;&#x77E9;&#x5F62;&#x7684;&#x8D77;&#x59CB;&#x70B9;&#x66F4;&#x6539;&#x4E3A;&#x5F62;&#x72B6;&#x7684;&#x4E2D;&#x5FC3;&#x3002;&#x8FD9;&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#x662F;&#x6709;&#x5E2E;&#x52A9;&#x7684;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x60A8;&#x60F3;&#x5728;&#x753B;&#x5E03;&#x7684;&#x4E2D;&#x5FC3;&#x753B;&#x4E00;&#x4E2A;&#x77E9;&#x5F62;&#xFF0C;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x4ECE;&#x5B83;&#x7684;&#x4F4D;&#x7F6E;&#x51CF;&#x53BB;&#x8BE5;&#x77E9;&#x5F62;&#x7684;&#x4E00;&#x534A;&#x5927;&#x5C0F;&#x3002;</p>
<p><img src="../images/p19.png" alt=""></p>
<pre><code class="lang-JavaScript"><span class="hljs-keyword">var</span> size = width * <span class="hljs-number">0.3</span>;
rect(width/<span class="hljs-number">2</span>, height/<span class="hljs-number">2</span>, size, size);
</code></pre>
<p><img src="../images/p20.png" alt=""></p>
<pre><code class="lang-JavaScript">rectMode(CENTER);
<span class="hljs-keyword">var</span> size = width * <span class="hljs-number">0.3</span>;
rect(width/<span class="hljs-number">2</span>, height/<span class="hljs-number">2</span>, size, size);
</code></pre>
<h3 id="&#x692D;&#x5706;">&#x692D;&#x5706;</h3>
<p>&#x692D;&#x5706;&#x662F;&#x4E00;&#x4E2A;&#x5149;&#x6ED1;&#x7684;&#x5F62;&#x72B6;&#xFF0C;&#x5728;&#x81EA;&#x7136;&#x754C;&#x7684;&#x8BB8;&#x591A;&#x5730;&#x65B9;&#x53D1;&#x73B0;&#xFF0C;&#x5728;&#x884C;&#x661F;&#x7684;&#x5F62;&#x72B6;&#xFF0C;&#x96E8;&#x6EF4;&#xFF0C;&#x548C;&#x5927;&#x591A;&#x6570;&#x52A8;&#x7269;&#x7684;&#x773C;&#x775B;&#x3002;&#x7531;&#x4E8E;&#x6CA1;&#x6709;&#x660E;&#x663E;&#x7684;&#x65B9;&#x5411;&#x611F;&#xFF0C;&#x692D;&#x5706;&#x6709;&#x4E00;&#x4E9B;&#x4E2D;&#x6027;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4EBA;&#x7C7B;&#x503E;&#x5411;&#x4E8E;&#x805A;&#x96C6;&#x5728;&#x692D;&#x5706;&#x4E2D;&#x6765;&#x5B9E;&#x73B0;&#x7EDF;&#x4E00;&#xFF1A;&#x6211;&#x4EEC;&#x5728;&#x5706;&#x5708;&#x4E2D;&#x8DF3;&#x821E;&#xFF0C;&#x5E76;&#x5728;&#x692D;&#x5706;&#x7684;&#x5B89;&#x6392;&#x4E2D;&#x8BBE;&#x8BA1;&#x5927;&#x591A;&#x6570;&#x8BAE;&#x4F1A;&#x7684;&#x5EA7;&#x4F4D;&#x3002;</p>
<p><img src="https://www.programmingdesignsystems.com/assets/shape/basic-shapes/olympics.jpg" alt=""></p>
<blockquote>
<p>&#x76AE;&#x57C3;&#x5C14;&#xB7;&#x5FB7;&#xB7;&#x987E;&#x62DC;&#x65E6;(Pierre De Coubertin)&#x7684;&#x5965;&#x8FD0;&#x4F1A;&#x8C61;&#x5F81;&#x7531;&#x4E94;&#x4E2A;&#x76F8;&#x8FDE;&#x7684;&#x692D;&#x5706;&#x7EC4;&#x6210;&#xFF0C;&#x989C;&#x8272;&#x53D6;&#x81EA;1912&#x5E74;&#x5965;&#x8FD0;&#x4F1A;&#x5404;&#x56FD;&#x56FD;&#x65D7;&#x4E0A;&#x7684;&#x989C;&#x8272;&#x3002;</p>
</blockquote>
<p><img src="https://www.programmingdesignsystems.com/assets/shape/basic-shapes/abc.jpg" alt=""></p>
<blockquote>
<p>&#x4FDD;&#x7F57;&#x5170;&#x5FB7;&#x7684;ABC&#x6807;&#x5FD7;&#x7684;&#x7279;&#x70B9;&#x662F;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x692D;&#x5706;&#x4E0E;&#x692D;&#x5706;&#x5B57;&#x4F53;&#x3002;</p>
</blockquote>
<p>&#x5728;&#x51E0;&#x4F55;&#x5B66;&#x4E2D;&#xFF0C;&#x692D;&#x5706;&#x662F;&#x4E00;&#x79CD;&#x5C01;&#x95ED;&#x7684;&#x5F62;&#x72B6;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5728;&#x5730;&#x9762;&#x4E0A;&#x9524;&#x51FB;&#x4E24;&#x6839;&#x9489;&#x5B50;&#xFF0C;&#x7528;&#x4E00;&#x6839;&#x7EF3;&#x5B50;&#x5C06;&#x5B83;&#x4EEC;&#x8FDE;&#x63A5;&#x8D77;&#x6765;&#xFF0C;&#x7136;&#x540E;&#x7528;&#x4E00;&#x652F;&#x7B14;&#x901A;&#x8FC7;&#x7EF3;&#x5B50;&#x753B;&#x51FA;&#x4E00;&#x4E2A;&#x5706;&#x5F62;&#x3002;&#x867D;&#x7136;&#x692D;&#x5706;&#x7684;&#x8F6E;&#x5ED3;&#x5728;&#x4EBA;&#x773C;&#x770B;&#x6765;&#x662F;&#x5149;&#x6ED1;&#x7684;&#xFF0C;&#x4F46;&#x8BA1;&#x7B97;&#x673A;&#x5B9E;&#x9645;&#x4E0A;&#x628A;&#x692D;&#x5706;&#x753B;&#x6210;&#x4E00;&#x7CFB;&#x5217;&#x77ED;&#x7684;&#x3001;&#x76F4;&#x7684;&#x3001;&#x8FDE;&#x63A5;&#x7684;&#x7EBF;&#x3002;&#x4E0E;rect()&#x4E0D;&#x540C;&#xFF0C;&#x692D;&#x5706;()&#x51FD;&#x6570;&#x5C06;&#x7ED8;&#x5236;&#x4E00;&#x4E2A;&#x692D;&#x5706;&#xFF0C;&#x5176;&#x8D77;&#x59CB;&#x70B9;&#x4F4D;&#x4E8E;&#x5F62;&#x72B6;&#x7684;&#x4E2D;&#x5FC3;&#x3002;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF0C;&#x7701;&#x7565;&#x6A21;&#x5F0F;()&#x51FD;&#x6570;&#x53EF;&#x7528;&#x4E8E;&#x5C06;&#x539F;&#x70B9;&#x66F4;&#x6539;&#x4E3A;&#x5DE6;&#x4E0A;&#x89D2;&#x3002;&#x8003;&#x8651;&#x5230;&#x692D;&#x5706;&#x7684;&#x6027;&#x8D28;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x8D77;&#x6E90;&#x70B9;&#x4F4D;&#x4E8E;&#x5F62;&#x72B6;&#x8F6E;&#x5ED3;&#x4E4B;&#x5916;&#x3002;</p>
<p><img src="../images/p21.png" alt=""></p>
<pre><code class="lang-JavaScript"><span class="hljs-keyword">var</span> size = width * <span class="hljs-number">0.3</span>;
ellipse(width/<span class="hljs-number">2</span>, height/<span class="hljs-number">2</span>, size, size);
</code></pre>
<p><img src="../images/p22.png" alt=""></p>
<pre><code class="lang-JavaScript">ellipseMode(CORNER);
<span class="hljs-keyword">var</span> size = width * <span class="hljs-number">0.3</span>;
ellipse(width/<span class="hljs-number">2</span>, height/<span class="hljs-number">2</span>, size, size);
</code></pre>
<h3 id="&#x4E09;&#x89D2;&#x5F62;">&#x4E09;&#x89D2;&#x5F62;</h3>
<p>&#x4E09;&#x89D2;&#x5F62;&#x662F;&#x4E00;&#x4E2A;&#x4E0D;&#x5BF9;&#x79F0;&#x7684;&#x5F62;&#x72B6;&#xFF0C;&#x7531;&#x4E8E;&#x5176;&#x65B9;&#x5411;&#x6027;&#xFF0C;&#x5728;&#x57FA;&#x672C;&#x5F62;&#x72B6;&#x4E2D;&#x662F;&#x72EC;&#x4E00;&#x65E0;&#x4E8C;&#x7684;&#x3002;&#x5B83;&#x901A;&#x5E38;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x7537;&#x6027;&#x6C14;&#x8D28;(&#x25B2;)&#x548C;&#x5973;&#x6027;&#x6C14;&#x8D28;(&#x25BC;)&#x7684;&#x8C61;&#x5F81;&#xFF0C;&#x5B83;&#x56E0;&#x5176;&#x7F8E;&#x5B66;&#x54C1;&#x8D28;&#x800C;&#x88AB;&#x5E7F;&#x6CDB;&#x5E94;&#x7528;&#x4E8E;&#x5E73;&#x9762;&#x8BBE;&#x8BA1;&#x4E2D;&#x3002;&#x6211;&#x4EEC;&#x6700;&#x91CD;&#x8981;&#x7684;&#x6587;&#x7269;&#x4E4B;&#x4E00;&#xFF0C;&#x5409;&#x8428;&#x5927;&#x91D1;&#x5B57;&#x5854;&#xFF0C;&#x4E5F;&#x662F;&#x8457;&#x540D;&#x7684;&#x4E09;&#x89D2;&#x5F62;&#x63CF;&#x7ED8;&#xFF0C;&#x6307;&#x5411;&#x5047;&#x5B9A;&#x7684;&#x5929;&#x7A7A;&#x65CB;&#x8F6C;&#x4E2D;&#x5FC3;&#xFF0C;&#x57C3;&#x53CA;&#x4EBA;&#x8BA4;&#x4E3A;&#x8FD9;&#x662F;&#x795E;&#x5723;&#x7684;&#x54C1;&#x8D28;&#x3002;</p>
<p><img src="https://www.programmingdesignsystems.com/assets/shape/basic-shapes/delta.jpg" alt=""></p>
<blockquote>
<p>&#x4E09;&#x89D2;&#x6D32;&#x6807;&#x5FD7;&#x662F;&#x7531;&#x56DB;&#x4E2A;&#x8F83;&#x5C0F;&#x7684;&#x4E09;&#x89D2;&#x5F62;&#x7EC4;&#x6210;&#x7684;&#x4E09;&#x89D2;&#x5F62;&#x3002;&#x6807;&#x5FD7;&#x6307;&#x5E0C;&#x814A;&#x4E09;&#x89D2;&#x5F62;&#x5B57;&#x6BCD;&#x540C;&#x540D;&#xFF0C;&#x4E09;&#x89D2;&#x5F62;&#x7684;&#x65B9;&#x5411;&#x6027;&#x7528;&#x6765;&#x8868;&#x793A;&#x901F;&#x5EA6;&#x548C;&#x98DE;&#x884C;&#x3002;</p>
</blockquote>
<p>&#x5728;&#x51E0;&#x4F55;&#x5B66;&#x4E2D;&#xFF0C;&#x4E09;&#x89D2;&#x5F62;&#x662F;&#x7531;&#x4E09;&#x70B9;&#x7EC4;&#x6210;&#x7684;&#x5C01;&#x95ED;&#x5F62;&#x72B6;&#x3002;&#x4E09;&#x89D2;&#x5F62;&#x7684;&#x5185;&#x89D2;&#x4E4B;&#x548C;&#x603B;&#x662F;180&#x5EA6;(&#x6216;PI&#x5F27;&#x5EA6;)&#x3002;&#x8FD9;&#x4E2A;&#x4E09;&#x89D2;&#x5F62;&#x5728;&#x8BB8;&#x591A;&#x6570;&#x5B66;&#x7A81;&#x7834;&#x4E2D;&#x53D1;&#x6325;&#x4E86;&#x6838;&#x5FC3;&#x4F5C;&#x7528;&#xFF0C;&#x5305;&#x62EC;&#x6B27;&#x51E0;&#x91CC;&#x5F97;&#x51E0;&#x4F55;&#x5B66;&#x3001;&#x4E09;&#x89D2;&#x5B66;&#x4EE5;&#x53CA;&#x4E09;&#x7EF4;&#x8BA1;&#x7B97;&#x673A;&#x56FE;&#x5F62;&#x5B66;&#x3002;&#x4E0E;rect()&#x548C;&#x7701;&#x7565;()&#x51FD;&#x6570;&#x4E0D;&#x540C;&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x51FD;&#x6570;&#x90FD;&#x671F;&#x671B;&#x5F62;&#x72B6;&#x7684;&#x8D77;&#x59CB;&#x70B9;&#x6709;&#x4E00;&#x4E2A;&#x4F4D;&#x7F6E;&#xFF0C;&#x4E09;&#x89D2;&#x5F62;()&#x51FD;&#x6570;&#x9700;&#x8981;&#x4E09;&#x89D2;&#x5F62;&#x6240;&#x6709;&#x4E09;&#x4E2A;&#x89D2;&#x7684;&#x5750;&#x6807;&#x3002;&#x8FD9;&#x4E5F;&#x610F;&#x5473;&#x7740;&#x6CA1;&#x6709;&#x6240;&#x8C13;&#x7684;triangleMode()&#x51FD;&#x6570;&#x3002;&#x60A8;&#x9700;&#x8981;&#x6267;&#x884C;&#x81EA;&#x5DF1;&#x7684;&#x8BA1;&#x7B97;&#x6765;&#x5728;&#x7279;&#x5B9A;&#x7684;&#x8D77;&#x59CB;&#x70B9;&#x5468;&#x56F4;&#x7ED8;&#x5236;&#x4E00;&#x4E2A;&#x4E09;&#x89D2;&#x5F62;&#xFF0C;&#x8FD9;&#x5728;&#x4E0B;&#x9762;&#x7684;&#x793A;&#x4F8B;&#x4E2D;&#x5F97;&#x5230;&#x4E86;&#x6F14;&#x793A;&#x3002;</p>
<p><img src="../images/p23.png" alt=""></p>
<pre><code class="lang-JavaScript"><span class="hljs-keyword">var</span> size = width * <span class="hljs-number">0.15</span>;
translate(width/<span class="hljs-number">2</span>, height/<span class="hljs-number">2</span>);
triangle(<span class="hljs-number">0</span>, <span class="hljs-number">0</span>, size, size*<span class="hljs-number">2</span>, -size, size*<span class="hljs-number">2</span>);
</code></pre>
<p><img src="../images/p24.png" alt=""></p>
<pre><code class="lang-JavaScript"><span class="hljs-keyword">var</span> size = width * <span class="hljs-number">0.15</span>;
translate(width/<span class="hljs-number">2</span>, height/<span class="hljs-number">2</span>);
triangle(<span class="hljs-number">0</span>, -size, size, size, -size, size);
</code></pre>
<h3 id="&#x51B0;&#x6DC7;&#x6DCB;&#x7B52;">&#x51B0;&#x6DC7;&#x6DCB;&#x7B52;</h3>
<p>&#x6211;&#x7ED9;&#x6211;&#x7684;&#x5B66;&#x751F;&#x505A;&#x4E86;&#x4EE5;&#x4E0B;(&#x6709;&#x70B9;&#x611A;&#x8822;)&#x7684;&#x7EC3;&#x4E60;&#xFF1A;&#x8BBE;&#x8BA1;&#x4E00;&#x4E2A;&#x9ED1;&#x767D;&#x51B0;&#x6DC7;&#x6DCB;&#x7B52;&#xFF0C;&#x4EE3;&#x7801;&#x4E2D;&#x6BCF;&#x4E2A;&#x57FA;&#x672C;&#x5F62;&#x72B6;&#x51FD;&#x6570;&#x53EA;&#x51FA;&#x73B0;&#x4E00;&#x6B21;&#x3002;&#x8FD9;&#x4E9B;&#x4E25;&#x683C;&#x7684;&#x7EA6;&#x675F;&#x8FEB;&#x4F7F;&#x5B66;&#x751F;&#x4E13;&#x6CE8;&#x4E8E;&#x5F62;&#x72B6;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x5B9A;&#x4F4D;&#x3001;&#x5927;&#x5C0F;&#x548C;&#x65CB;&#x8F6C;&#x8FD9;&#x4E9B;&#x5F62;&#x72B6;&#x4EE5;&#x5B9E;&#x73B0;&#x6709;&#x6548;&#x7684;&#x8BBE;&#x8BA1;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x7EC3;&#x4E60;&#x7684;&#x6700;&#x91CD;&#x8981;&#x7684;&#x65B9;&#x9762;&#x663E;&#x7136;&#x662F;&#x521B;&#x9020;&#x4E00;&#x4E2A;&#x8BBE;&#x8BA1;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x7528;&#x6237;&#x4F1A;&#x8BA4;&#x4E3A;&#x662F;&#x4E00;&#x4E2A;&#x51B0;&#x6DC7;&#x6DCB;&#x7B52;&#x3002;&#x4E00;&#x4E2A;&#x8BBE;&#x8BA1;&#x662F;&#x5426;&#x5B8C;&#x6210;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x76F8;&#x5F53;&#x5BA2;&#x89C2;&#x7684;&#x4EFB;&#x52A1;&#x3002;&#x5728;&#x4E0B;&#x9762;&#x7684;&#x4E24;&#x79CD;&#x8BBE;&#x8BA1;&#x4E2D;&#xFF0C;&#x5F88;&#x660E;&#x663E;&#xFF0C;&#x7B2C;&#x4E00;&#x79CD;&#x8BBE;&#x8BA1;&#x6210;&#x529F;&#x5730;&#x89E3;&#x51B3;&#x4E86;&#x5206;&#x914D;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x540E;&#x8005;&#x5374;&#x6CA1;&#x6709;&#x3002;&#x8FD9;&#x4E5F;&#x662F;&#x5F88;&#x5BB9;&#x6613;&#x5206;&#x6790;&#x7684;&#x539F;&#x56E0;&#xFF1A;&#x867D;&#x7136;&#x5F62;&#x72B6;&#x51E0;&#x4E4E;&#x76F8;&#x540C;&#x7684;&#x4E24;&#x79CD;&#x8BBE;&#x8BA1;&#xFF0C;&#x540E;&#x8005;&#x6CA1;&#x6709;&#x5EFA;&#x7ACB;&#x9002;&#x5F53;&#x7684;&#x89C6;&#x89C9;&#x5173;&#x7CFB;&#x3002;</p>
<p><img src="../images/p25.png" alt=""></p>
<p><img src="../images/p26.png" alt=""></p>
<p>&#x7B2C;&#x4E8C;&#x4E2A;(&#x548C;&#x66F4;&#x4E3B;&#x89C2;&#x7684;)&#x65B9;&#x9762;&#x4E0E;&#x8BBE;&#x8BA1;&#x98CE;&#x683C;&#x6709;&#x5173;&#x3002;&#x5728;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x98CE;&#x683C;&#x9002;&#x5408;&#x4E0D;&#x540C;&#x7684;&#x573A;&#x666F;&#x3002;&#x5982;&#x679C;&#x4F60;&#x88AB;&#x8981;&#x6C42;&#x4E3A;&#x4E00;&#x4E2A;&#x7F51;&#x7AD9;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x56FE;&#x6807;&#xFF0C;&#x62BD;&#x8C61;&#x7684;&#x98CE;&#x683C;&#x53EF;&#x80FD;&#x4F1A;&#x66F4;&#x597D;&#xFF0C;&#x56E0;&#x4E3A;&#x7B80;&#x5355;&#x7684;&#x8BBE;&#x8BA1;&#x5728;&#x5C0F;&#x5C3A;&#x5BF8;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5DE5;&#x4F5C;&#x5F97;&#x66F4;&#x597D;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5728;&#x4E3A;&#x4E00;&#x672C;&#x513F;&#x7AE5;&#x8BFB;&#x7269;&#x505A;&#x4E00;&#x4E2A;&#x63D2;&#x56FE;&#xFF0C;&#x4E00;&#x4E9B;&#x66F4;&#x5927;&#x80C6;&#x3001;&#x66F4;&#x6709;&#x8DA3;&#x7684;&#x4E1C;&#x897F;&#x53EF;&#x80FD;&#x4F1A;&#x66F4;&#x9002;&#x5408;&#x4F60;&#x3002;&#x98CE;&#x683C;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x4E3A;&#x7279;&#x5B9A;&#x7684;&#x529F;&#x80FD;&#x670D;&#x52A1;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x7EAF;&#x7CB9;&#x7528;&#x4E8E;&#x7F8E;&#x5B66;(&#x6BD5;&#x7ADF;&#xFF0C;&#x8FD9;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x4E00;&#x79CD;&#x529F;&#x80FD;)&#x3002;&#x6700;&#x540E;&#xFF0C;&#x8BBE;&#x8BA1;&#x98CE;&#x683C;&#x662F;&#x8BBE;&#x8BA1;&#x5E08;&#x4E3B;&#x89C2;&#x559C;&#x597D;&#x660E;&#x663E;&#x7684;&#x5730;&#x65B9;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x4E2A;&#x7EC3;&#x4E60;&#x4E2D;&#xFF0C;&#x6211;&#x7ECF;&#x5E38;&#x9F13;&#x52B1;&#x6211;&#x7684;&#x5B66;&#x751F;&#x7EC3;&#x4E60;&#x4E0D;&#x540C;&#x98CE;&#x683C;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x8FDB;&#x4E00;&#x6B65;&#x53D1;&#x5C55;&#x4E86;&#x4ED6;&#x4EEC;&#x7684;&#x89C6;&#x89C9;&#x8BED;&#x8A00;&#x3002;&#x6837;&#x5F0F;&#x521B;&#x5EFA;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x56E0;&#x7D20;&#x662F;<code>fill()</code>&#x3001;<code>stroke()</code>&#x548C;<code>strokeWeight()</code>&#x51FD;&#x6570;&#x7684;&#x4F7F;&#x7528;&#x3002;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF0C;&#x8FD9;&#x4E9B;&#x529F;&#x80FD;&#x53EF;&#x4EE5;&#x6781;&#x5927;&#x5730;&#x6539;&#x53D8;&#x8BBE;&#x8BA1;&#x98CE;&#x683C;&#x3002;</p>
<p><img src="../images/p27.png" alt=""></p>
<blockquote>
<p>&#x540C;&#x6837;&#x6BD4;&#x4F8B;&#x7684;&#x5F62;&#x72B6;&#x548C;&#x76F8;&#x540C;&#x7684;&#x7B14;&#x753B;&#x5BFC;&#x81F4;&#x4E86;&#x62BD;&#x8C61;&#x7684;&#x8BBE;&#x8BA1;&#x3002;</p>
</blockquote>
<p><img src="../images/p28.png" alt=""></p>
<blockquote>
<p>&#x66F4;&#x539A;&#x7684;&#x7B14;&#x753B;&#x548C;&#x586B;&#x5145;&#x4F7F;&#x4E00;&#x4E2A;&#x66F4;&#x6709;&#x8DA3;&#x7684;&#x8BBE;&#x8BA1;&#x3002;</p>
</blockquote>
<p>&#x8FD9;&#x4E2A;&#x7EC3;&#x4E60;&#x8FD8;&#x9F13;&#x52B1;&#x5B66;&#x751F;&#x5728;&#x7528;&#x4EE3;&#x7801;&#x5B9E;&#x73B0;&#x4ED6;&#x4EEC;&#x7684;&#x8BBE;&#x8BA1;&#x65F6;&#x8981;&#x6709;&#x7CFB;&#x7EDF;&#x5730;&#x601D;&#x8003;&#x3002;&#x8FD9;&#x4E09;&#x4E2A;&#x57FA;&#x672C;&#x7684;&#x5F62;&#x72B6;&#x51FD;&#x6570;&#x53EA;&#x80FD;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x51FA;&#x73B0;&#x4E00;&#x6B21;&#xFF0C;&#x56E0;&#x6B64;&#x5B66;&#x751F;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x5FAA;&#x73AF;&#x6765;&#x7ED8;&#x5236;&#x66F4;&#x590D;&#x6742;&#x7684;&#x8BBE;&#x8BA1;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x4E09;&#x4E2A;&#x4F8B;&#x5B50;&#x90FD;&#x662F;&#x6211;&#x4EE5;&#x524D;&#x7684;&#x5B66;&#x751F;&#x505A;&#x7684;&#xFF0C;&#x4ED6;&#x4EEC;&#x5728;&#x8FD9;&#x91CC;&#x5C55;&#x793A;&#x4E86;&#x4E0A;&#x9762;&#x63D0;&#x5230;&#x7684;&#x6240;&#x6709;&#x4E8B;&#x60C5;&#x7684;&#x6210;&#x529F;&#x4F8B;&#x5B50;&#xFF1A;&#x5B83;&#x4EEC;&#x90FD;&#x5BA2;&#x89C2;&#x5730;&#x89E3;&#x51B3;&#x4E86;&#x7528;&#x57FA;&#x672C;&#x5F62;&#x72B6;&#x6784;&#x9020;&#x51B0;&#x6DC7;&#x6DCB;&#x9525;&#x7684;&#x4EFB;&#x52A1;&#x3002;&#x5B83;&#x4EEC;&#x90FD;&#x901A;&#x8FC7;&#x5DE7;&#x5999;&#x5730;&#x7ED3;&#x5408;&#x57FA;&#x672C;&#x5F62;&#x72B6;&#x529F;&#x80FD;&#x548C;&#x4EE5;&#x4E0B;&#x5173;&#x7CFB;&#x6765;&#x5B9E;&#x73B0;&#x4E0D;&#x540C;&#x7684;&#x98CE;&#x683C;&#xFF1A;&#x4F4D;&#x7F6E;&#x3001;&#x5927;&#x5C0F;&#x3001;&#x65CB;&#x8F6C;&#x3001;&#x586B;&#x5145;&#x3001;&#x76F4;&#x7EBF;&#x548C;&#x884C;&#x7A0B;&#x91CD;&#x91CF;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x4ED6;&#x4EEC;&#x90FD;&#x4F7F;&#x7528;&#x91CD;&#x590D;(&#x6211;&#x4EEC;&#x5C06;&#x81F4;&#x529B;&#x4E8E;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x6574;&#x4E2A;&#x90E8;&#x5206;)&#x5728;&#x753B;&#x5E03;&#x4E0A;&#x753B;&#x4E09;&#x4E2A;&#x4EE5;&#x4E0A;&#x7684;&#x5F62;&#x72B6;&#x3002;</p>
<p><img src="../images/p29.png" alt=""></p>
<blockquote>
<p>&#x7531;Luisa Pereira&#x8BBE;&#x8BA1; <a href="https://github.com/runemadsen/programmingdesignsystems.com/tree/master/examples/shape/basic-shapes/cone-luisa.js" target="_blank">&#x6E90;&#x7801;</a></p>
</blockquote>
<p><img src="../images/p30.png" alt=""></p>
<blockquote>
<p>&#x7531;Shir David&#x8BBE;&#x8BA1; <a href="https://github.com/runemadsen/programmingdesignsystems.com/tree/master/examples/shape/basic-shapes/cone-shir.js" target="_blank">&#x6E90;&#x7801;</a></p>
</blockquote>
<p><img src="../images/p31.png" alt=""></p>
<blockquote>
<p>&#x7531;Tan Ma&#x8BBE;&#x8BA1; <a href="https://github.com/runemadsen/programmingdesignsystems.com/tree/master/examples/shape/basic-shapes/cone-tan.js" target="_blank">&#x6E90;&#x7801;</a></p>
</blockquote>
<p>&#x5F53;&#x4F60;&#x7528;&#x57FA;&#x672C;&#x5F62;&#x72B6;&#x8BBE;&#x8BA1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x662F;&#x65F6;&#x5019;&#x5728;&#x4F60;&#x7684;&#x8BBE;&#x8BA1;&#x8FC7;&#x7A0B;&#x4E2D;&#x5F15;&#x5165;&#x66F4;&#x590D;&#x6742;&#x7684;&#x5F62;&#x72B6;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x4E0B;&#x4E00;&#x7AE0;&#x4E2D;&#x901A;&#x8FC7;&#x7814;&#x7A76;&#x8BA1;&#x7B97;&#x51E0;&#x4F55;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x57FA;&#x672C;&#x6982;&#x5FF5;&#x6765;&#x5B9E;&#x73B0;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x8FDB;&#x884C;&#x8FC7;&#x7A0B;&#x5F62;&#x72B6;&#x751F;&#x6210;&#x3002;</p>
<svg width="100%" height="3" xmlns="http://www.w3.org/2000/svg"><line x1="0" y1="1" x2="100%" y2="1" stroke-dasharray="6, 3" stroke-width="2" stroke="#29b79b"/></svg>

<h3 id="&#x7EC3;&#x4E60;">&#x7EC3;&#x4E60;</h3>
<p>&#x8BBE;&#x8BA1;&#x4E00;&#x4E2A;&#x9ED1;&#x767D;&#x51B0;&#x6DC7;&#x6DCB;&#x9525;&#xFF0C;&#x4EE3;&#x7801;&#x4E2D;&#x6BCF;&#x4E2A;&#x57FA;&#x672C;&#x5F62;&#x72B6;&#x51FD;&#x6570;&#x53EA;&#x51FA;&#x73B0;&#x4E00;&#x6B21;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="1.1.html" class="navigation navigation-prev " aria-label="Previous page: 1.1 图形基础">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="1.3.html" class="navigation navigation-next " aria-label="Next page: 1.3 定制形状">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"1.2 基本形状","level":"1.3.2","depth":2,"next":{"title":"1.3 定制形状","level":"1.3.3","depth":2,"path":"chapters/1.3.md","ref":"chapters/1.3.md","articles":[]},"previous":{"title":"1.1 图形基础","level":"1.3.1","depth":2,"path":"chapters/1.1.md","ref":"chapters/1.1.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"chapters/1.2.md","mtime":"2019-09-24T14:56:29.120Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-09-27T12:54:50.956Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

