
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>1.3 定制形状 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="1.4.html" />
    
    
    <link rel="prev" href="1.2.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    设计系统编程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    0.设计系统
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="0.html">
            
                <a href="0.html">
            
                    
                    0.1.什么是设计系统
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    1.形状
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="1.1.html">
            
                <a href="1.1.html">
            
                    
                    1.1 图形基础
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="1.2.html">
            
                <a href="1.2.html">
            
                    
                    1.2 基本形状
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3.3" data-path="1.3.html">
            
                <a href="1.3.html">
            
                    
                    1.3 定制形状
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="1.4.html">
            
                <a href="1.4.html">
            
                    
                    1.4 程序形状
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    2.颜色
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="2.1.html">
            
                <a href="2.1.html">
            
                    
                    2.1 颜色理论简史
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="2.2.html">
            
                <a href="2.2.html">
            
                    
                    2.2 颜色模型及颜色空间
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="2.3.html">
            
                <a href="2.3.html">
            
                    
                    2.3 感知颜色空间的一致性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4" data-path="2.4.html">
            
                <a href="2.4.html">
            
                    
                    2.4 配色方案
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" >
            
                <span>
            
                    
                    3.布局
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="3.1.html">
            
                <a href="3.1.html">
            
                    
                    3.1 几何图形简史
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" >
            
                <span>
            
                    
                    未完持续更新...
            
                </span>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >1.3 定制形状</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x5B9A;&#x5236;&#x5F62;&#x72B6;">&#x5B9A;&#x5236;&#x5F62;&#x72B6;</h2>
<p>&#x867D;&#x7136;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x7EC3;&#x4E60;&#xFF0C;&#x53EA;&#x8BBE;&#x8BA1;<a href="https://www.programmingdesignsystems.com/shape/basic-shapes/index.html" target="_blank">&#x7B80;&#x5355;&#x7684;&#x5F62;&#x72B6;</a>&#xFF0C;&#x590D;&#x6742;&#x7684;&#x5F62;&#x72B6;&#x63D0;&#x4F9B;&#x66F4;&#x591A;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x3002;&#x5728;&#x624B;&#x5DE5;&#x8BBE;&#x8BA1;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x590D;&#x6742;&#x7684;&#x5F62;&#x72B6;&#x5F80;&#x5F80;&#x9700;&#x8981;&#x5F88;&#x957F;&#x7684;&#x65F6;&#x95F4;&#x6765;&#x7ED8;&#x5236;&#xFF0C;&#x56E0;&#x4E3A;&#x8BBE;&#x8BA1;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x7EC6;&#x8282;&#x90FD;&#x9700;&#x8981;&#x624B;&#x5DE5;&#x521B;&#x5EFA;&#x3002;&#x5C3D;&#x7BA1;&#x5DF2;&#x7ECF;&#x4E3A;&#x8FD9;&#x4E9B;&#x4EFB;&#x52A1;&#x7684;&#x81EA;&#x52A8;&#x5316;&#x505A;&#x51FA;&#x4E86;&#x52AA;&#x529B;&#xFF0C;&#x4F46;&#x5728;&#x76EE;&#x524D;&#x7684;&#x6570;&#x5B57;&#x8BBE;&#x8BA1;&#x5DE5;&#x5177;&#x4E2D;&#xFF0C;&#x5982;AdobeIlluStrator&#x6216;Sketch&#xFF0C;&#x4E00;&#x4E9B;&#x8BBE;&#x8BA1;&#x4ECD;&#x7136;&#x5F88;&#x4E4F;&#x5473;&#x3002;&#x8FD9;&#x5BF9;&#x4E8E;&#x9700;&#x8981;&#x91CD;&#x590D;&#x6216;&#x968F;&#x673A;&#x5316;&#x7684;&#x8BBE;&#x8BA1;&#x6765;&#x8BF4;&#x5C24;&#x5176;&#x5982;&#x6B64;&#xFF0C;&#x5C31;&#x50CF;&#x6B63;&#x5F26;&#x66F2;&#x7EBF;&#x7684;&#x53D8;&#x5316;&#x5E45;&#x5EA6;&#x4E00;&#x6837;&#x3002;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x5728;&#x7A0B;&#x5E8F;&#x4E0A;&#x77AC;&#x95F4;&#x751F;&#x6210;&#x975E;&#x5E38;&#x590D;&#x6742;&#x7684;&#x5F62;&#x72B6;&#xFF0C;&#x6240;&#x9700;&#x7684;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x7528;&#x94A2;&#x7B14;&#x968F;&#x673A;&#x7ED8;&#x5236;&#x7684;&#x5F62;&#x72B6;&#x5F88;&#x96BE;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x91CD;&#x65B0;&#x521B;&#x5EFA;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5728;&#x6CA1;&#x6709;&#x89E3;&#x91CA;&#x5F62;&#x72B6;&#x8F6E;&#x5ED3;&#x7684;&#x57FA;&#x672C;&#x89C4;&#x5219;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x3002;</p>
<p>&#x5728;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x7AE0;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x5C06;&#x4ECB;&#x7ECD;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x6280;&#x672F;&#x6765;&#x6309;&#x7A0B;&#x5E8F;&#x7ED8;&#x5236;&#x81EA;&#x5B9A;&#x4E49;&#x5F62;&#x72B6;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x9996;&#x5148;&#x7406;&#x89E3;&#x4EE3;&#x7801;&#x4E2D;&#x7ED8;&#x5236;&#x5F62;&#x72B6;&#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x67E5;&#x770B;<code>beginShape()</code>&#x51FD;&#x6570;&#xFF0C;&#x4EE5;&#x53CA;&#x8BB8;&#x591A;&#x53EF;&#x7528;&#x4E8E;&#x5B9A;&#x4E49;&#x5F62;&#x72B6;&#x8F6E;&#x5ED3;&#x7684;&#x9876;&#x70B9;&#x51FD;&#x6570;&#x3002;</p>
<h3 id="&#x7F16;&#x7A0B;&#x5B9A;&#x5236;&#x5F62;&#x72B6;">&#x7F16;&#x7A0B;&#x5B9A;&#x5236;&#x5F62;&#x72B6;</h3>
<p>&#x5927;&#x591A;&#x6570;&#x56FE;&#x5F62;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x5141;&#x8BB8;&#x60A8;&#x7ED8;&#x5236;&#x81EA;&#x5B9A;&#x4E49;&#x5F62;&#x72B6;&#xFF0C;&#x5982;&#x8FDE;&#x63A5;&#x70B9;&#x7ED8;&#x56FE;&#xFF1A;&#x5B9A;&#x4E49;&#x4E00;&#x7CFB;&#x5217;&#x70B9;(&#x6211;&#x4EEC;&#x79F0;&#x4E4B;&#x4E3A;&#x9876;&#x70B9;)&#xFF0C;&#x8FD9;&#x4E9B;&#x70B9;&#x901A;&#x8FC7;&#x7EBF;&#x6761;&#x8FDE;&#x63A5;&#x5F62;&#x6210;&#x5F62;&#x72B6;&#x7684;&#x8F6E;&#x5ED3;&#x3002;</p>
<p>&#x5F62;&#x72B6;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x9876;&#x70B9;&#x51B3;&#x5B9A;&#x5B83;&#x5982;&#x4F55;&#x8FDE;&#x63A5;&#x5230;&#x5B83;&#x4E4B;&#x524D;&#x7684;&#x9876;&#x70B9;&#x3002;&#x5982;&#x679C;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x9876;&#x70B9;&#xFF0C;&#x5B83;&#x5C06;&#x4E0E;&#x4E00;&#x6761;&#x76F4;&#x7EBF;&#x76F8;&#x8FDE;&#x3002;&#x5982;&#x679C;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x5F2F;&#x66F2;&#x7684;&#x9876;&#x70B9;&#xFF0C;&#x5B83;&#x5C06;&#x4E0E;&#x4E00;&#x6761;&#x66F2;&#x7EBF;&#x8FDE;&#x63A5;&#x3002;&#x901A;&#x8FC7;&#x5C06;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x9876;&#x70B9;&#x8FDE;&#x63A5;&#x5230;&#x7B2C;&#x4E00;&#x4E2A;&#x9876;&#x70B9;&#xFF0C;&#x8BE5;&#x5F62;&#x72B6;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x6027;&#x5730;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x5C01;&#x95ED;&#x7684;&#x5F62;&#x72B6;&#x3002;p5.js&#x9075;&#x5FAA;&#x540C;&#x6837;&#x7684;&#x6982;&#x5FF5;&#x3002;&#x4F7F;&#x7528;<code>beginShape()</code>&#x51FD;&#x6570;&#x542F;&#x52A8;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x81EA;&#x5B9A;&#x4E49;&#x5F62;&#x72B6;&#xFF0C;&#x7528;&#x6240;&#x9700;&#x7684;&#x9876;&#x70B9;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#x5F62;&#x72B6;&#x7684;&#x9876;&#x70B9;&#xFF0C;&#x6700;&#x540E;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x53EF;&#x9009;&#x53C2;&#x6570;&#x8C03;&#x7528;<code>endShape()</code>&#x51FD;&#x6570;&#x6765;&#x8FDE;&#x63A5;&#x5F62;&#x72B6;&#x4E2D;&#x7684;&#x7EBF;&#x6761;&#x4EE5;&#x5173;&#x95ED;&#x8BE5;&#x5F62;&#x72B6;&#x3002;&#x5728;&#x4E0B;&#x9762;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x68C0;&#x67E5;&#x8FD9;&#x4E9B;&#x9876;&#x70B9;&#x51FD;&#x6570;&#x3002;</p>
<h3 id="&#x76F4;&#x7EBF;">&#x76F4;&#x7EBF;</h3>
<p><code>vertex()</code>&#x51FD;&#x6570;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x9876;&#x70B9;&#xFF0C;&#x8BE5;&#x9876;&#x70B9;&#x4EE5;&#x4E00;&#x6761;&#x76F4;&#x7EBF;&#x8FDE;&#x63A5;&#x5230;&#x524D;&#x9762;&#x7684;&#x9876;&#x70B9;&#x3002;&#x8FD9;&#x662F;&#x9876;&#x70B9;&#x51FD;&#x6570;&#x4E2D;&#x6700;&#x7B80;&#x5355;&#x7684;&#x4E00;&#x4E2A;&#xFF0C;&#x6240;&#x6709;&#x7528;<code>beginShape()</code>&#x521B;&#x5EFA;&#x7684;&#x5F62;&#x72B6;&#x90FD;&#x5FC5;&#x987B;&#x4ECE;&#x4E00;&#x4E2A;<code>vertex()</code>&#x51FD;&#x6570;&#x8C03;&#x7528;&#x5F00;&#x59CB;&#xFF0C;&#x4EE5;&#x5B9A;&#x4E49;&#x5F62;&#x72B6;&#x7684;&#x8D77;&#x70B9;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x8BF4;&#x660E;&#x4E86;&#x8FD9;&#x4E00;&#x70B9;&#x3002;&#x5C1D;&#x8BD5;&#x62D6;&#x52A8;&#x9876;&#x70B9;&#x4EE5;&#x67E5;&#x770B;&#x7ED3;&#x679C;&#x4EE3;&#x7801;&#x3002;</p>
<p><img src="../images/2.jpg" alt=""></p>
<pre><code class="lang-JavaScript">beginShape();
  vertex(<span class="hljs-number">80</span>, <span class="hljs-number">100</span>);
  vertex(<span class="hljs-number">400</span>, <span class="hljs-number">140</span>);
  vertex(<span class="hljs-number">130</span>, <span class="hljs-number">310</span>);
endShape(CLOSE)
</code></pre>
<p>&#x4E0B;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x90FD;&#x662F;&#x7528;&#x7B80;&#x5355;&#x7684;&#x9876;&#x70B9;&#x521B;&#x5EFA;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x4F7F;&#x7528;&#x7B14;&#x753B;&#x548C;&#x586B;&#x5145;&#x6765;&#x5B9E;&#x73B0;&#x975E;&#x5E38;&#x4E0D;&#x540C;&#x7684;&#x8BBE;&#x8BA1;&#x3002;</p>
<p><img src="../images/p32.png" alt=""></p>
<blockquote>
<p><a href="https://github.com/runemadsen/programmingdesignsystems.com/tree/master/examples/shape/custom-shapes/vertex-arrow.js" target="_blank">&#x6E90;&#x7801;</a></p>
</blockquote>
<p><img src="../images/p33.png" alt=""></p>
<blockquote>
<p><a href="https://github.com/runemadsen/programmingdesignsystems.com/tree/master/examples/shape/custom-shapes/vertex-mountain.js" target="_blank">&#x6E90;&#x7801;</a></p>
</blockquote>
<p><img src="../images/p34.png" alt=""></p>
<blockquote>
<p><a href="https://github.com/runemadsen/programmingdesignsystems.com/tree/master/examples/shape/custom-shapes/vertex-house.js" target="_blank">&#x6E90;&#x7801;</a></p>
</blockquote>
<h3 id="b&#xE9;zier&#x66F2;&#x7EBF;">B&#xE9;zier&#x66F2;&#x7EBF;</h3>
<p>&#x4E3A;&#x4E86;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x7528;&#x66F2;&#x7EBF;&#x8FDE;&#x63A5;&#x5230;&#x9876;&#x70B9;&#x4E4B;&#x524D;&#x7684;&#x9876;&#x70B9;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;<code>quadraticVertex()</code>&#x548C;<code>bezierVertex()</code>&#x51FD;&#x6570;&#x3002;&#x5B83;&#x4EEC;&#x6BD4;<code>vertex()</code>&#x51FD;&#x6570;&#x8981;&#x590D;&#x6742;&#x4E00;&#x4E9B;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x9700;&#x8981;&#x51E0;&#x4E2A;<code>x</code>&#x548C;<code>y</code>&#x5750;&#x6807;&#x6765;&#x63A7;&#x5236;&#x76F4;&#x7EBF;&#x7684;&#x66F2;&#x7EBF;&#x3002;&#x4E3A;&#x4E86;&#x7406;&#x89E3;&#x8FD9;&#x662F;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#x7684;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x7B80;&#x8981;&#x5730;&#x770B;&#x4E00;&#x770B;B&#xE9;zier&#x66F2;&#x7EBF;&#x7684;&#x6982;&#x5FF5;&#x3002;</p>
<p>20&#x4E16;&#x7EAA;60&#x5E74;&#x4EE3;&#xFF0C;&#x76AE;&#x57C3;&#x5C14;&#xB7;&#x8D1D;&#x585E;&#x5C14;(Pierre B&#xE9;zier)&#x5C06;B&#xE9;zier&#x66F2;&#x7EBF;&#x7B97;&#x6CD5;&#x63A8;&#x5E7F;&#x4E3A;&#x89E3;&#x51B3;&#x8BA1;&#x7B97;&#x51E0;&#x4F55;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x5E38;&#x89C1;&#x95EE;&#x9898;&#xFF1A;&#x7ED8;&#x5236;&#x53EF;&#x7F29;&#x653E;&#x5230;&#x4EFB;&#x610F;&#x5C3A;&#x5BF8;&#x7684;&#x66F2;&#x7EBF;&#x3002;B&#xE9;zier&#x66F2;&#x7EBF;&#x7B97;&#x6CD5;&#x901A;&#x8FC7;&#x5F15;&#x5165;&#x63A7;&#x5236;&#x70B9;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x4EE5;&#x975E;&#x5E38;&#x4F18;&#x96C5;&#x7684;&#x65B9;&#x5F0F;&#x89E3;&#x51B3;&#x4E86;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;&#x4E0D;&#x53EF;&#x89C1;&#x7684;&#x91CD;&#x529B;&#x70B9;&#x5438;&#x5F15;&#x7EBF;&#x5F2F;&#x66F2;&#x6210;&#x66F2;&#x7EBF;&#x3002;&#x5177;&#x6709;&#x5355;&#x4E2A;&#x63A7;&#x5236;&#x70B9;&#x7684;B&#xE9;zier&#x66F2;&#x7EBF;&#x79F0;&#x4E3A;&#x4E8C;&#x6B21;B&#xE9;zier&#x66F2;&#x7EBF;&#xFF0C;&#x800C;&#x5177;&#x6709;&#x4E24;&#x4E2A;&#x63A7;&#x5236;&#x70B9;&#x7684;B&#xE9;zier&#x66F2;&#x7EBF;&#x79F0;&#x4E3A;&#x4E09;&#x6B21;B&#xE9;zier&#x66F2;&#x7EBF;&#x3002;&#x5982;&#x679C;&#x60A8;&#x66FE;&#x7ECF;&#x5728;AdobeIlluStrator&#x4E2D;&#x4F7F;&#x7528;&#x8FC7;Pen&#x5DE5;&#x5177;&#xFF0C;&#x90A3;&#x4E48;&#x60A8;&#x5DF2;&#x7ECF;&#x719F;&#x6089;&#x4E86;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#x3002;</p>
<p><img src="../images/p35.png" alt=""></p>
<blockquote>
<p>&#x6B64;&#x52A8;&#x753B;&#x663E;&#x793A;&#x4E8C;&#x6B21;Bezier&#x66F2;&#x7EBF;&#x662F;&#x5982;&#x4F55;&#x8BA1;&#x7B97;&#x7684;&#x3002;</p>
</blockquote>
<p><img src="../images/p36.png" alt=""></p>
<blockquote>
<p>&#x6B64;&#x52A8;&#x753B;&#x663E;&#x793A;&#x5982;&#x4F55;&#x8BA1;&#x7B97;&#x4E09;&#x6B21;B&#xE9;zier&#x66F2;&#x7EBF;&#x3002;</p>
</blockquote>
<p>&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>quadraticBezier()</code>&#x51FD;&#x6570;&#x7ED8;&#x5236;&#x4E8C;&#x6B21;&#x66F2;&#x7EBF;&#xFF0C;&#x4F20;&#x9012;&#x5355;&#x4E2A;&#x63A7;&#x5236;&#x70B9;&#x548C;&#x9876;&#x70B9;&#x672C;&#x8EAB;&#x7684;&#x5750;&#x6807;&#x3002;&#x540C;&#x6837;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>bezierVertex()</code>&#x51FD;&#x6570;&#x7ED8;&#x5236;&#x4E09;&#x6B21;Binherier&#x66F2;&#x7EBF;&#xFF0C;&#x4F7F;&#x4E24;&#x4E2A;&#x63A7;&#x5236;&#x70B9;&#x548C;&#x9876;&#x70B9;&#x672C;&#x8EAB;&#x7684;&#x5750;&#x6807;&#x901A;&#x8FC7;&#x3002;&#x8FD9;&#x4E24;&#x4E2A;&#x51FD;&#x6570;&#x4E4B;&#x95F4;&#x7684;&#x552F;&#x4E00;&#x533A;&#x522B;&#x662F;&#x5728;<code>bezierVertex()</code>&#x51FD;&#x6570;&#x4E2D;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x989D;&#x5916;&#x7684;&#x63A7;&#x5236;&#x70B9;&#xFF0C;&#x8FD9;&#x5141;&#x8BB8;&#x60A8;&#x7ED8;&#x5236;&#x66F4;&#x590D;&#x6742;&#x7684;&#x66F2;&#x7EBF;&#x3002;&#x8FD9;&#x5728;&#x4E0B;&#x9762;&#x8BF4;&#x660E;&#xFF0C;&#x5176;&#x4E2D;&#x4E24;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x66F2;&#x7EBF;&#x90FD;&#x7528;&#x4E8E;&#x7ED8;&#x5236;&#x81EA;&#x5B9A;&#x4E49;&#x5F62;&#x72B6;&#x3002;&#x5C1D;&#x8BD5;&#x62D6;&#x52A8;&#x9876;&#x70B9;&#x548C;&#x63A7;&#x5236;&#x70B9;&#x4EE5;&#x67E5;&#x770B;&#x751F;&#x6210;&#x7684;&#x4EE3;&#x7801;&#x3002;</p>
<p><img src="../images/p37.png" alt=""></p>
<pre><code class="lang-JavaScript">beginShape();
  vertex(<span class="hljs-number">80</span>, <span class="hljs-number">100</span>);
  quadraticVertex(<span class="hljs-number">245</span>, <span class="hljs-number">30</span>, <span class="hljs-number">400</span>, <span class="hljs-number">140</span>);
  bezierVertex(<span class="hljs-number">430</span>, <span class="hljs-number">360</span>, <span class="hljs-number">200</span>, <span class="hljs-number">170</span>, <span class="hljs-number">130</span>, <span class="hljs-number">310</span>);
endShape(CLOSE)
</code></pre>
<p>&#x8981;&#x638C;&#x63E1;B&#xE9;zier&#x51FD;&#x6570;&#x9700;&#x8981;&#x4E00;&#x4E9B;&#x7EC3;&#x4E60;&#xFF0C;&#x800C;&#x4E14;&#x77E5;&#x9053;&#x4F60;&#x9700;&#x8981;&#x591A;&#x5C11;&#x4E2A;B&#xE9;zier&#x624D;&#x80FD;&#x753B;&#x51FA;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x5F62;&#x72B6;&#xFF0C;&#x8FD9;&#x5728;&#x4E00;&#x5F00;&#x59CB;&#x662F;&#x5F88;&#x56F0;&#x96BE;&#x7684;&#x3002;&#x63A7;&#x5236;&#x70B9;&#x662F;&#x4E0D;&#x53EF;&#x89C1;&#x7684;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x5E76;&#x6CA1;&#x6709;&#x5E2E;&#x52A9;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x6DF1;&#x5165;&#x7814;&#x7A76;&#x4EE3;&#x7801;&#x4E4B;&#x524D;&#x82B1;&#x4E00;&#x4E9B;&#x65F6;&#x95F4;&#x5728;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x4E0A;&#x73A9;&#x4F1A;&#x5F88;&#x6709;&#x5E2E;&#x52A9;&#x3002;&#x4E0B;&#x9762;&#x662F;&#x4E09;&#x4E2A;&#x793A;&#x4F8B;&#xFF0C;&#x5B83;&#x4EEC;&#x90FD;&#x4F7F;&#x7528;B&#xE9;zier&#x51FD;&#x6570;&#x521B;&#x5EFA;&#x81EA;&#x5B9A;&#x4E49;&#x5F62;&#x72B6;&#x3002;</p>
<p><img src="../images/p38.png" alt=""></p>
<blockquote>
<p><a href="https://github.com/runemadsen/programmingdesignsystems.com/tree/master/examples/shape/custom-shapes/quad-circle.js" target="_blank">&#x6E90;&#x7801;</a></p>
</blockquote>
<p><img src="../images/p39.png" alt=""></p>
<blockquote>
<p><a href="https://github.com/runemadsen/programmingdesignsystems.com/tree/master/examples/shape/custom-shapes/cubic-key.js" target="_blank">&#x6E90;&#x7801;</a></p>
</blockquote>
<p><img src="../images/p40.png" alt=""></p>
<blockquote>
<p><a href="https://github.com/runemadsen/programmingdesignsystems.com/tree/master/examples/shape/custom-shapes/cubic-letter.js" target="_blank">&#x6E90;&#x7801;</a></p>
</blockquote>
<h3 id="&#x8F6E;&#x5ED3;">&#x8F6E;&#x5ED3;</h3>
<p>&#x867D;&#x7136;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;<code>vertex()</code>&#x3001;<code>quadraticVertex()</code>&#x548C;<code>bezierVertex()</code>&#x7ED8;&#x5236;&#x5927;&#x591A;&#x6570;&#x5F62;&#x72B6;&#xFF0C;&#x4F46;&#x8FD9;&#x4E9B;&#x51FD;&#x6570;&#x4E0D;&#x5141;&#x8BB8;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x5E26;&#x6709;&#x5B54;&#x7684;&#x5F62;&#x72B6;&#x3002;&#x5728;P5.js&#x4E2D;&#xFF0C;&#x4E00;&#x4E2A;&#x6D1E;&#x88AB;&#x79F0;&#x4E3A;&#x7B49;&#x9AD8;&#x7EBF;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>beginContour()</code>&#x548C;<code>endContour()</code>&#x51FD;&#x6570;&#x7ED8;&#x5236;&#x7B49;&#x9AD8;&#x7EBF;&#x5F62;&#x72B6;&#x3002;&#x4ECE;&#x672C;&#x8D28;&#x4E0A;&#x8BB2;&#xFF0C;<code>beginContour()</code>&#x51FD;&#x6570;&#x6307;&#x793A;P5&#x60A8;&#x6B63;&#x5728;&#x542F;&#x52A8;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5F62;&#x72B6;&#xFF0C;&#x8BE5;&#x5F62;&#x72B6;&#x5C06;&#x4ECE;&#x60A8;&#x7684;&#x4E3B;&#x5F62;&#x72B6;&#x4E2D;&#x51CF;&#x53BB;&#x3002;&#x4E0E;<code>beginShape()</code>&#x4E00;&#x6837;&#xFF0C;&#x60A8;&#x4F7F;&#x7528;&#x9876;&#x70B9;&#x51FD;&#x6570;&#x6765;&#x7ED8;&#x5236;&#x8F6E;&#x5ED3;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;<code>endContour()</code>&#x7ED3;&#x675F;&#x8F6E;&#x5ED3;&#x3002;</p>
<p><img src="../images/p41.png" alt=""></p>
<blockquote>
<p><a href="https://github.com/runemadsen/programmingdesignsystems.com/tree/master/examples/shape/custom-shapes/contour.js" target="_blank">&#x6E90;&#x7801;</a></p>
</blockquote>
<pre><code class="lang-JavaScript">beginShape();
  <span class="hljs-comment">// draw rectangle here</span>
  beginContour();
    <span class="hljs-comment">// draw triangle here</span>
  endContour();
endShape();
</code></pre>
<h3 id="&#x6E7F;&#x548C;&#x5C16;&#x5F62;&#x72B6;">&#x201C;&#x6E7F;&#x201D;&#x548C;&#x201C;&#x5C16;&#x201D;&#x5F62;&#x72B6;</h3>
<p>&#x60A8;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7EE7;&#x7EED;&#x524D;&#x51E0;&#x7AE0;&#x4E2D;&#x7684;&#x201C;&#x8BBE;&#x8BA1;&#x5355;&#x8BCD;&#x201D;&#x7EC3;&#x4E60;&#x6765;&#x7EC3;&#x4E60;&#x8BBE;&#x8BA1;&#x81EA;&#x5B9A;&#x4E49;&#x5F62;&#x72B6;&#x3002;&#x6211;&#x5BF9;&#x5B66;&#x751F;&#x7684;&#x4F5C;&#x4E1A;&#x542C;&#x8D77;&#x6765;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;&#x8BBE;&#x8BA1;&#x4E00;&#x4E2A;&#x9ED1;&#x767D;&#x4E24;&#x79CD;&#x5F62;&#x72B6;&#x7684;&#x56FE;&#x6848;&#xFF0C;&#x4EE3;&#x8868;&#x201C;&#x6E7F;&#x201D;&#x548C;&#x201C;&#x5C16;&#x201D;&#x4E24;&#x4E2A;&#x5B57;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x9879;&#x5177;&#x6709;&#x6311;&#x6218;&#x6027;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x6709;&#x51E0;&#x4E2A;&#x539F;&#x56E0;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x5B66;&#x751F;&#x5FC5;&#x987B;&#x8003;&#x8651;&#x5F62;&#x72B6;&#x7684;&#x8F6E;&#x5ED3;&#x5982;&#x4F55;&#x5E2E;&#x52A9;&#x4F20;&#x8FBE;&#x8FD9;&#x4E9B;&#x5355;&#x8BCD;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x3002;&#x5927;&#x591A;&#x6570;&#x8BBE;&#x8BA1;&#x7684;&#x7ED3;&#x679C;&#x662F;&#x7528;&#x5F2F;&#x66F2;&#x7684;&#x9876;&#x70B9;&#x6765;&#x8868;&#x793A;&#x6E7F;&#x70B9;&#xFF0C;&#x7528;&#x7B80;&#x5355;&#x7684;&#x9876;&#x70B9;&#x6765;&#x8868;&#x793A;&#x9510;&#x5229;&#xFF0C;&#x4F46;&#x6709;&#x4E9B;&#x8BBE;&#x8BA1;&#x5DE7;&#x5999;&#x5730;&#x901A;&#x8FC7;&#x76F8;&#x53CD;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x8FBE;&#x5230;&#x76EE;&#x7684;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x8FD9;&#x4E9B;&#x5F62;&#x72B6;&#x5B58;&#x5728;&#x4E8E;&#x540C;&#x4E00;&#x753B;&#x5E03;&#x4E0A;&#xFF0C;&#x8FD9;&#x4E00;&#x4E8B;&#x5B9E;&#x9F13;&#x52B1;&#x5B66;&#x751F;&#x8003;&#x8651;&#x8FD9;&#x4E9B;&#x5F62;&#x72B6;&#x5982;&#x4F55;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#xFF0C;&#x4EE5;&#x8FBE;&#x5230;&#x66F4;&#x620F;&#x5267;&#x6027;&#x7684;&#x6548;&#x679C;&#x3002;&#x5C06;&#x5200;&#x72B6;&#x7684;&#x5F62;&#x72B6;&#x76F4;&#x63A5;&#x6307;&#x5411;&#x5149;&#x6ED1;&#x7684;&#x5F62;&#x72B6;&#x4F1A;&#x4EA7;&#x751F;&#x4E00;&#x5B9A;&#x7684;&#x5F20;&#x529B;&#xFF0C;&#x5982;&#x679C;&#x8BE5;&#x5F62;&#x72B6;&#x6307;&#x5411;&#x53E6;&#x4E00;&#x4E2A;&#x65B9;&#x5411;&#xFF0C;&#x8FD9;&#x79CD;&#x5F20;&#x529B;&#x5C31;&#x4E0D;&#x4F1A;&#x5B58;&#x5728;&#x3002;</p>
<p><img src="../images/p42.png" alt=""></p>
<blockquote>
<p>Luna Chen <a href="https://github.com/runemadsen/programmingdesignsystems.com/tree/master/examples/shape/custom-shapes/wetsharp-luna.js" target="_blank">&#x6E90;&#x7801;</a></p>
</blockquote>
<p><img src="../images/p43.png" alt=""></p>
<blockquote>
<p>Sean McIntyre <a href="https://github.com/runemadsen/programmingdesignsystems.com/tree/master/examples/shape/custom-shapes/wetsharp-sean.js" target="_blank">&#x6E90;&#x7801;</a></p>
</blockquote>
<p>&#x672C;&#x7AE0;&#x4E2D;&#x7684;&#x4F8B;&#x5B50;&#x6709;&#x5F88;&#x591A;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x7CBE;&#x5FC3;&#x5B9A;&#x4E49;&#x7684;&#x9876;&#x70B9;&#xFF0C;&#x5C31;&#x50CF;&#x7528;&#x9F20;&#x6807;&#x7ED8;&#x5236;&#x5B83;&#x4EEC;&#x4E00;&#x6837;&#x3002;&#x8FD9;&#x5F53;&#x7136;&#x4E0D;&#x662F;&#x7B97;&#x6CD5;&#x8BBE;&#x8BA1;&#x7684;&#x7EC8;&#x6781;&#x627F;&#x8BFA;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#x5728;&#x7528;&#x9F20;&#x6807;&#x7ED8;&#x5236;&#x901F;&#x5EA6;&#x66F4;&#x5FEB;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x521B;&#x5EFA;&#x5F62;&#x72B6;&#xFF1F;&#x5728;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x7AE0;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x7814;&#x7A76;&#x4E00;&#x4E9B;&#x6280;&#x672F;&#xFF0C;&#x8FD9;&#x4E9B;&#x6280;&#x672F;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x4EE5;&#x4E00;&#x79CD;&#x66F4;&#x7A0B;&#x5E8F;&#x5316;&#x7684;&#x65B9;&#x5F0F;&#x7ED8;&#x5236;&#x5F62;&#x72B6;&#x3002;</p>
<svg width="100%" height="3" xmlns="http://www.w3.org/2000/svg"><line x1="0" y1="1" x2="100%" y2="1" stroke-dasharray="6, 3" stroke-width="2" stroke="#29b79b"/></svg>

<h3 id="&#x7EC3;&#x4E60;">&#x7EC3;&#x4E60;</h3>
<p>&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x9ED1;&#x8272;&#x548C;&#x767D;&#x8272;&#x4E24;&#x79CD;&#x5F62;&#x72B6;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x4EE3;&#x8868;&#x201C;&#x6E7F;&#x201D;&#x548C;&#x201C;&#x5C16;&#x201D;&#x4E24;&#x4E2A;&#x8BCD;&#x3002;&#x5FC5;&#x987B;&#x4F7F;&#x7528;<code>beginShape()</code>&#x548C;<code>endShape()</code>&#x51FD;&#x6570;&#x521B;&#x5EFA;&#x5F62;&#x72B6;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="1.2.html" class="navigation navigation-prev " aria-label="Previous page: 1.2 基本形状">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="1.4.html" class="navigation navigation-next " aria-label="Next page: 1.4 程序形状">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"1.3 定制形状","level":"1.3.3","depth":2,"next":{"title":"1.4 程序形状","level":"1.3.4","depth":2,"path":"chapters/1.4.md","ref":"chapters/1.4.md","articles":[]},"previous":{"title":"1.2 基本形状","level":"1.3.2","depth":2,"path":"chapters/1.2.md","ref":"chapters/1.2.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"chapters/1.3.md","mtime":"2019-09-25T14:28:16.703Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-09-30T10:31:33.641Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

