
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>1.4 程序形状 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="1.3.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    设计系统编程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    0.设计系统
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="0.html">
            
                <a href="0.html">
            
                    
                    0.1.什么是设计系统
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    1.形状
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="1.1.html">
            
                <a href="1.1.html">
            
                    
                    1.1 图形基础
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="1.2.html">
            
                <a href="1.2.html">
            
                    
                    1.2 基本形状
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="1.3.html">
            
                <a href="1.3.html">
            
                    
                    1.3 定制形状
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3.4" data-path="1.4.html">
            
                <a href="1.4.html">
            
                    
                    1.4 程序形状
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    2.颜色
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="2.1.html">
            
                <a href="2.1.html">
            
                    
                    2.1 颜色理论简史
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="2.2.html">
            
                <a href="2.2.html">
            
                    
                    2.2 颜色模型及颜色空间
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="2.3.html">
            
                <a href="2.3.html">
            
                    
                    2.3 感知颜色空间的一致性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4" data-path="2.4.html">
            
                <a href="2.4.html">
            
                    
                    2.4 配色方案
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" >
            
                <span>
            
                    
                    3.布局
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="3.1.html">
            
                <a href="3.1.html">
            
                    
                    3.1 几何图形简史
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" >
            
                <span>
            
                    
                    未完持续更新...
            
                </span>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >1.4 程序形状</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x7A0B;&#x5E8F;&#x5F62;&#x72B6;">&#x7A0B;&#x5E8F;&#x5F62;&#x72B6;</h2>
<p>&#x6211;&#x4EEC;&#x5B9A;&#x5236;&#x5F62;&#x72B6;&#x793A;&#x4F8B;&#x7684;&#x4EE3;&#x7801;&#x8FC4;&#x4ECA;&#x4E3A;&#x6B62;&#x76F8;&#x5F53;&#x4E4F;&#x5473;&#x3002;&#x5728;&#x9876;&#x70B9;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x884C;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x952E;&#x5165;&#x76F4;&#x7EBF;&#x6765;&#x624B;&#x52A8;&#x521B;&#x5EFA;&#x5F62;&#x72B6;&#xFF0C;&#x5E76;&#x4E14;&#x6B64;&#x7B56;&#x7565;&#x4E0D;&#x9002;&#x7528;&#x4E8E;&#x66F4;&#x590D;&#x6742;&#x7684;&#x5F62;&#x72B6;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x8003;&#x8651;&#x5230;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x6807;&#x9898;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x4F3C;&#x4E4E;&#x6709;&#x70B9;&#x53CD;&#x6C14;&#x5019;&#x3002;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x4E86;&#x89E3;<code>beginShape()</code>&#x7684;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x4E86;&#x89E3;&#x5982;&#x4F55;&#x4F7F;&#x7528;FOR&#x5FAA;&#x73AF;&#x7A0B;&#x5E8F;&#x7ED8;&#x5236;&#x81EA;&#x5B9A;&#x4E49;&#x5F62;&#x72B6;&#xFF0C;&#x4EE5;&#x53CA;<code>sin()</code>&#x548C;<code>cos()</code>&#x51FD;&#x6570;&#x3002;</p>
<h3 id="&#x6B63;&#x4F59;&#x5F26;">&#x6B63;&#x4F59;&#x5F26;</h3>
<p>&#x8FD9;&#x4E9B;&#x5E74;&#x6765;&#xFF0C;&#x6211;&#x770B;&#x5230;&#x8BB8;&#x591A;&#x5B66;&#x751F;&#x4E0E;&#x6B63;&#x5F26;&#x548C;&#x4F59;&#x5F26;&#x640F;&#x6597;&#x3002;&#x8FD9;&#x5F88;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#x4E3A;&#x4EC0;&#x4E48;&#xFF1A;&#x8FD9;&#x4E9B;&#x8BCD;&#x4F3C;&#x4E4E;&#x76F8;&#x5F53;&#x53EF;&#x6015;&#x548C;&#x62BD;&#x8C61;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5982;&#x679C;&#x4F60;&#x8BA4;&#x4E3A;&#x81EA;&#x5DF1;&#x4E0D;&#x64C5;&#x957F;&#x6570;&#x5B66;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x8FD9;&#x65E2;&#x662F;&#x4E0D;&#x5E78;&#x7684;&#xFF0C;&#x4E5F;&#x662F;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x3002;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E24;&#x4E2A;&#x529F;&#x80FD;&#x662F;&#x5927;&#x591A;&#x6570;&#x7F16;&#x7A0B;&#x8BBE;&#x8BA1;&#x7684;&#x57FA;&#x672C;&#x90E8;&#x5206;&#xFF0C;&#x5BF9;&#x5B83;&#x4EEC;&#x7684;&#x826F;&#x597D;&#x7406;&#x89E3;&#x5C06;&#x4F7F;&#x60A8;&#x80FD;&#x591F;&#x89E3;&#x51B3;&#x8BB8;&#x591A;&#x89C6;&#x89C9;&#x95EE;&#x9898;&#x3002;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x5E76;&#x4E0D;&#x96BE;&#x5B66;&#x3002;&#x5373;&#x4F7F;&#x60A8;&#x4E0D;&#x4E86;&#x89E3;&#x672C;&#x7AE0;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x5185;&#x5BB9;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4ECE;&#x8BB0;&#x4F4F;&#x4E24;&#x884C;&#x51E0;&#x4E4E;&#x76F8;&#x540C;&#x7684;&#x4EE3;&#x7801;&#x5F00;&#x59CB;&#x3002;</p>
<p>&#x6B63;&#x5F26;&#x548C;&#x4F59;&#x5F26;&#x5141;&#x8BB8;&#x6211;&#x4EEC;&#x627E;&#x5230;&#x692D;&#x5706;&#x8F6E;&#x5ED3;&#x4E0A;&#x7684;&#x4EFB;&#x4F55;&#x4F4D;&#x7F6E;&#x3002;&#x4ED6;&#x4EEC;&#x901A;&#x8FC7;&#x5C06;&#x4E00;&#x4E2A;&#x89D2;&#x5EA6;&#x8F6C;&#x6362;&#x4E3A;<code>x</code>&#x4F4D;&#x7F6E;(&#x4F59;&#x5F26;)&#x6216;<code>y</code>&#x4F4D;&#x7F6E;(&#x6B63;&#x5F26;)&#x6765;&#x5B9E;&#x73B0;&#x8FD9;&#x4E00;&#x70B9;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x8FD9;&#x4E9B;&#x503C;&#x53EF;&#x4EE5;&#x4E58;&#x4EE5;&#x5B9E;&#x9645;&#x5706;&#x5468;&#x7684;&#x534A;&#x5F84;&#x6765;&#x6269;&#x5C55;&#x5B83;&#x4EEC;&#x3002;&#x867D;&#x7136;&#x4E25;&#x683C;&#x6765;&#x8BF4;&#x4E0D;&#x9700;&#x8981;&#x7406;&#x89E3;&#x8FD9;&#x4E9B;&#x51FD;&#x6570;&#x662F;&#x5982;&#x4F55;&#x5185;&#x90E8;&#x5DE5;&#x4F5C;&#x7684;&#xFF0C;&#x4F46;&#x8FD9;&#x91CC;&#x6709;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x53EF;&#x89C6;&#x5316;&#x6B63;&#x5728;&#x53D1;&#x751F;&#x7684;&#x4E8B;&#x60C5;&#xFF1A;&#x8BBE;&#x60F3;&#x4E00;&#x4E2A;&#x5C06;&#x5706;&#x5FC3;&#x8FDE;&#x63A5;&#x5230;&#x8F6E;&#x5ED3;&#x70B9;&#x7684;&#x53F3;&#x4FA7;&#x4E09;&#x89D2;&#x5F62;&#x3002;&#x6B63;&#x5F26;&#x51FD;&#x6570;&#x662F;&#x5FEB;&#x901F;&#x6C42;&#x51FA;&#x4E09;&#x89D2;&#x5F62;&#x7684;&#x5DE6;&#x4FA7;(&#x4F4E;&#x97F3;)&#x4E0E;&#x53F3;&#x4FA7;(&#x76F8;&#x5BF9;)&#x7684;&#x6BD4;&#x503C;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x3002;&#x4F59;&#x5F26;&#x51FD;&#x6570;&#x540C;&#x6837;&#x662F;&#x4F4E;&#x97F3;&#x548C;&#x4E09;&#x89D2;&#x5F62;&#x5E95;&#x90E8;(&#x90BB;&#x63A5;)&#x4E4B;&#x95F4;&#x7684;&#x6BD4;&#x7387;&#x3002;</p>
<p><img src="../images/3.jpg" alt=""></p>
<p>&#x5728;P5&#x4E2D;&#xFF0C;&#x8FD9;&#x4E9B;&#x51FD;&#x6570;&#x79F0;&#x4E3A;<code>sin()</code>&#x548C;<code>cos()</code>&#x3002;&#x5982;&#x4E0A;&#x6240;&#x8FF0;&#xFF0C;&#x5B83;&#x4EEC;&#x63A5;&#x53D7;&#x4E00;&#x4E2A;&#x53C2;&#x6570;-&#x4E00;&#x4E2A;&#x5F27;&#x5EA6;&#x89D2;-&#x5E76;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x4ECB;&#x4E8E;<code>-1</code>&#x548C;<code>1</code>&#x4E4B;&#x95F4;&#x7684;&#x503C;&#xFF0C;&#x8868;&#x793A;&#x5728;&#x4E00;&#x4E2A;&#x5C0F;&#x5706;&#x4E0A;&#x7684;<code>x</code>&#x6216;<code>y</code>&#x4F4D;&#x7F6E;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x4E24;&#x884C;&#x6F14;&#x793A;&#x4E86;&#x5982;&#x4F55;&#x5F97;&#x5230;&#x8FD9;&#x4E9B;&#x503C;&#xFF0C;&#x5E76;&#x5C06;&#x5B83;&#x4EEC;&#x4E58;&#x4EE5;&#x5B9E;&#x9645;&#x5706;&#x7684;&#x534A;&#x5F84;&#x3002;&#x8BB0;&#x4F4F;&#x8FD9;&#x4E24;&#x53E5;&#x8BDD;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x3002;</p>
<pre><code class="lang-JavaScript"><span class="hljs-keyword">var</span> x = cos(RADIANS) * RADIUS;
<span class="hljs-keyword">var</span> y = sin(RADIANS) * RADIUS;
</code></pre>
<p>&#x8981;&#x5C06;&#x6B64;&#x7F6E;&#x4E8E;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#xFF0C;&#x4EE5;&#x4E0B;&#x662F;&#x4E00;&#x4E2A;&#x793A;&#x4F8B;&#xFF0C;&#x5728;&#x6B64;&#x793A;&#x4F8B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x4EE3;&#x7801;&#x6CBF;&#x7740;&#x8F83;&#x5927;&#x7684;&#x5706;&#x7684;&#x8F6E;&#x5ED3;&#x7ED8;&#x5236;&#x5C0F;&#x7684;&#x5706;330&#x5EA6;&#x3002;</p>
<p><img src="../images/p44.png" alt=""></p>
<pre><code class="lang-JavaScript">translate(width/<span class="hljs-number">2</span>, height/<span class="hljs-number">2</span>);

noFill();
<span class="hljs-keyword">var</span> radius = width * <span class="hljs-number">0.3</span>;
ellipse(<span class="hljs-number">0</span>, <span class="hljs-number">0</span>, radius*<span class="hljs-number">2</span>, radius*<span class="hljs-number">2</span>);

fill(<span class="hljs-number">30</span>);
<span class="hljs-keyword">var</span> x = cos(radians(<span class="hljs-number">330</span>)) * radius;
<span class="hljs-keyword">var</span> y = sin(radians(<span class="hljs-number">330</span>)) * radius;
ellipse(x, y, <span class="hljs-number">20</span>, <span class="hljs-number">20</span>);
</code></pre>
<p>&#x5982;&#x679C;&#x8003;&#x8651;&#x6240;&#x6709;&#x57FA;&#x672C;&#x5F62;&#x72B6;&#x4EE5;&#x53CA;&#x8BB8;&#x591A;&#x590D;&#x6742;&#x5F62;&#x72B6;&#xFF0C;&#x5B83;&#x4EEC;&#x7684;&#x7279;&#x70B9;&#x662F;&#x5177;&#x6709;&#x56F4;&#x7ED5;&#x4E2D;&#x5FC3;&#x70B9;&#x79FB;&#x52A8;&#x7684;&#x975E;&#x91CD;&#x53E0;&#x8F6E;&#x5ED3;&#x3002;&#x67D0;&#x4E9B;&#x5F62;&#x72B6;&#xFF08;&#x5982;&#x4E09;&#x89D2;&#x5F62;&#xFF09;&#x4EC5;&#x6709;&#x51E0;&#x4E2A;&#x9876;&#x70B9;&#xFF0C;&#x800C;&#x5176;&#x4ED6;&#x5F62;&#x72B6;&#xFF08;&#x5982;&#x692D;&#x5706;&#xFF09;&#x5177;&#x6709;&#x591A;&#x4E2A;&#x9876;&#x70B9;&#x3002;<code>sin()</code>&#x548C;<code>cos()</code>&#x51FD;&#x6570;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x4EE5;&#x7A0B;&#x5E8F;&#x65B9;&#x5F0F;&#x7ED8;&#x5236;&#x8FD9;&#x4E9B;&#x7C7B;&#x578B;&#x7684;&#x5F62;&#x72B6;&#x3002;</p>
<h3 id="for&#x5FAA;&#x73AF;">for&#x5FAA;&#x73AF;</h3>
<p>&#x5C3D;&#x7BA1;&#x6211;&#x4EEC;&#x5C06;&#x628A;&#x672C;&#x4E66;&#x7684;&#x6574;&#x4E2A;&#x90E8;&#x5206;&#x7528;&#x4E8E;&#x91CD;&#x590D;&#xFF0C;&#x4F46;&#x8BA9;&#x6211;&#x4EEC;&#x7B80;&#x8981;&#x4ECB;&#x7ECD;&#x4E00;&#x4E0B;<code>for</code>&#x5FAA;&#x73AF;&#x7684;&#x57FA;&#x672C;&#x529F;&#x80FD;&#x3002;<code>for</code>&#x5FAA;&#x73AF;&#x5141;&#x8BB8;&#x6211;&#x4EEC;&#x5728;&#x4E00;&#x884C;&#x4E2D;&#x591A;&#x6B21;&#x6267;&#x884C;&#x4EE3;&#x7801;&#xFF0C;&#x65B9;&#x6CD5;&#x662F;&#x9012;&#x589E;(&#x6216;&#x9012;&#x51CF;)&#x4E00;&#x4E2A;&#x53D8;&#x91CF;(&#x901A;&#x5E38;&#x79F0;&#x4E3A;<code>i</code>)&#xFF0C;&#x76F4;&#x5230;&#x8868;&#x8FBE;&#x5F0F;&#x4E0D;&#x518D;&#x4E3A;&#x771F;&#xFF0C;&#x5FAA;&#x73AF;&#x505C;&#x6B62;&#x3002;&#x5728;&#x4E0B;&#x9762;&#x7684;&#x793A;&#x4F8B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x7528;&#x6570;&#x5B57;<code>0</code>&#x521D;&#x59CB;&#x5316;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#xFF0C;&#x5728;&#x53D8;&#x91CF;&#x5C0F;&#x4E8E;<code>10</code>&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x8FED;&#x4EE3;&#xFF0C;&#x5E76;&#x5728;&#x6BCF;&#x6B21;&#x8FED;&#x4EE3;&#x4E4B;&#x95F4;&#x589E;&#x52A0;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x3002;&#x7ED3;&#x679C;&#x662F;&#x4E00;&#x4E2A;&#x5FAA;&#x73AF;&#xFF0C;&#x7528;&#x6211;&#x4EEC;&#x7684;&#x53D8;&#x91CF;&#x4ECE;0&#x589E;&#x52A0;&#x5230;9&#xFF0C;&#x5FAA;&#x73AF;10&#x6B21;&#xFF0C;&#x5728;&#x5C4F;&#x5E55;&#x4E0A;&#x7ED8;&#x5236;10&#x4E2A;&#x77E9;&#x5F62;&#x3002;</p>
<p><img src="../images/p45.png" alt=""></p>
<pre><code class="lang-JavaScript"><span class="hljs-keyword">for</span>(<span class="hljs-keyword">var</span> i = <span class="hljs-number">0</span>; i &lt; <span class="hljs-number">10</span>; i++) {
  rect(<span class="hljs-number">0</span>, <span class="hljs-number">0</span>, <span class="hljs-number">100</span>, <span class="hljs-number">100</span>);
}
</code></pre>
<p>&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x77E9;&#x5F62;&#x90FD;&#x6709;&#x76F8;&#x540C;&#x7684;&#x4F4D;&#x7F6E;&#x548C;&#x5927;&#x5C0F;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x4E00;&#x6B21;&#x53C8;&#x4E00;&#x6B21;&#x5730;&#x5C06;&#x76F8;&#x540C;&#x7684;&#x9759;&#x6001;&#x6570;&#x5B57;&#x4F20;&#x9012;&#x7ED9;<code>rect()</code>&#x51FD;&#x6570;&#x3002;&#x8FD9;&#x5C31;&#x662F;<code>i</code>&#x8981;&#x53D1;&#x6325;&#x7684;&#x5730;&#x65B9;&#xFF1A;&#x56E0;&#x4E3A;&#x5B83;&#x5728;&#x5FAA;&#x73AF;&#x7684;&#x6BCF;&#x4E00;&#x6B21;&#x8FED;&#x4EE3;&#x4E4B;&#x95F4;&#x90FD;&#x4F1A;&#x53D1;&#x751F;&#x53D8;&#x5316;&#xFF0C;&#x6240;&#x4EE5;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x5728;&#x6BCF;&#x4E2A;&#x77E9;&#x5F62;&#x4E4B;&#x95F4;&#x521B;&#x5EFA;&#x5DEE;&#x5F02;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x793A;&#x4F8B;&#x4F7F;&#x7528;<code>i</code>&#x6765;&#x5B9A;&#x4F4D;x&#x8F74;&#x4E0A;&#x7684;&#x5341;&#x4E2A;&#x77E9;&#x5F62;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x50CF;&#x7D20;&#x76F8;&#x8DDD;1&#x50CF;&#x7D20;&#x3002;</p>
<p><img src="../images/p46.png" alt=""></p>
<pre><code class="lang-JavaScript"><span class="hljs-keyword">for</span>(<span class="hljs-keyword">var</span> i = <span class="hljs-number">0</span>; i &lt; <span class="hljs-number">10</span>; i++) {
  rect(i, <span class="hljs-number">0</span>, <span class="hljs-number">100</span>, <span class="hljs-number">100</span>);
}
</code></pre>
<p>&#x867D;&#x7136;&#x8FD9;&#x53EF;&#x80FD;&#x5E76;&#x4E0D;&#x7ACB;&#x5373;&#x6E05;&#x695A;&#xFF0C;&#x4F46;&#x5F53;&#x7ED8;&#x5236;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x65F6;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x9879;&#x91CD;&#x8981;&#x7684;&#x6280;&#x672F;&#x3002;&#x56E0;&#x4E3A;<code>i</code>&#x5728;&#x6BCF;&#x6B21;&#x8FED;&#x4EE3;&#x4E4B;&#x95F4;&#x9012;&#x589E;&#x4E00;&#x4E2A;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x6807;&#x91CF;&#x6765;&#x5206;&#x5E03;&#x5728;&#x753B;&#x5E03;&#x4E0A;&#x7684;&#x5F62;&#x72B6;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x5B9A;&#x4F4D;&#x5F7C;&#x6B64;&#x76F8;&#x90BB;&#x7684;&#x77E9;&#x5F62;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x5C06;<code>i</code>&#x4E58;&#x4EE5;&#x5927;&#x4E8E;&#x77E9;&#x5F62;&#x5BBD;&#x5EA6;&#x7684;&#x6570;&#x3002;</p>
<p><img src="../images/p47.png" alt=""></p>
<pre><code class="lang-JavaScript"><span class="hljs-keyword">for</span>(<span class="hljs-keyword">var</span> i = <span class="hljs-number">0</span>; i &lt; <span class="hljs-number">10</span>; i++) {
  rect(i * <span class="hljs-number">105</span>, <span class="hljs-number">0</span>, <span class="hljs-number">100</span>, <span class="hljs-number">100</span>);
}
</code></pre>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x540C;&#x6837;&#x7684;&#x6280;&#x672F;&#x7ED8;&#x5236;&#x81EA;&#x5B9A;&#x4E49;&#x5F62;&#x72B6;&#x3002;&#x4E0D;&#x662F;&#x5728;&#x5FAA;&#x73AF;&#x4E2D;&#x7ED8;&#x5236;&#x5404;&#x4E2A;&#x5F62;&#x72B6;&#xFF0C;&#x800C;&#x662F;&#x4F7F;&#x7528;for&#x5FAA;&#x73AF;&#x7A0B;&#x5E8F;&#x5728;<code>beginShape()</code>&#x548C;<code>endShape()</code>&#x51FD;&#x6570;&#x8C03;&#x7528;&#x4E4B;&#x95F4;&#x6DFB;&#x52A0;&#x9876;&#x70B9;&#x3002;&#x5728;&#x4E0B;&#x9762;&#x7684;&#x793A;&#x4F8B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x6B64;&#x6280;&#x672F;&#x7ED8;&#x5236;&#x753B;&#x5E03;&#x4E2D;&#x5FC3;&#x7684;&#x5341;&#x4E2A;&#x968F;&#x673A;&#x9876;&#x70B9;&#x3002;</p>
<p><img src="../images/p48.png" alt=""></p>
<pre><code class="lang-JavaScript">translate(width/<span class="hljs-number">2</span>, height/<span class="hljs-number">2</span>);
beginShape();
<span class="hljs-keyword">for</span>(<span class="hljs-keyword">var</span> i = <span class="hljs-number">0</span>; i &lt; <span class="hljs-number">10</span>; i++) {
  <span class="hljs-keyword">var</span> x = random(<span class="hljs-number">-100</span>, <span class="hljs-number">100</span>);
  <span class="hljs-keyword">var</span> y = random(<span class="hljs-number">-100</span>, <span class="hljs-number">100</span>);
  vertex(x, y);
}
endShape();
</code></pre>
<p>&#x7ED3;&#x679C;&#x5F53;&#x7136;&#x662F;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#x5F62;&#x72B6;&#xFF0C;&#x4F46;&#x662F;&#x4F7F;&#x7528;<code>random()</code>&#x5E76;&#x4E0D;&#x80FD;&#x8BA9;&#x6211;&#x4EEC;&#x5BF9;&#x9876;&#x70B9;&#x7684;&#x653E;&#x7F6E;&#x6709;&#x5F88;&#x5927;&#x7684;&#x63A7;&#x5236;&#xFF1A;&#x8FD9;&#x4E2A;&#x5F62;&#x72B6;&#x53EA;&#x662F;&#x4E00;&#x5806;&#x968F;&#x673A;&#x4EA4;&#x53C9;&#x7684;&#x7EBF;&#x3002;&#x6700;&#x540E;&#x4E00;&#x6B65;&#x662F;&#x5C06;&#x6211;&#x4EEC;&#x7684;&#x4E24;&#x79CD;&#x6280;&#x672F;&#x653E;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x5E76;&#x5728;<code>for</code>&#x5FAA;&#x73AF;&#x4E2D;&#x4F7F;&#x7528;<code>sin()</code>&#x548C;<code>cos()</code>&#x751F;&#x6210;&#x5F62;&#x72B6;&#x3002;</p>
<h3 id="&#x628A;&#x5B83;&#x653E;&#x5728;&#x4E00;&#x8D77;">&#x628A;&#x5B83;&#x653E;&#x5728;&#x4E00;&#x8D77;</h3>
<p>&#x4ECE;&#x4E0A;&#x9762;&#x7684;&#x968F;&#x673A;&#x5F62;&#x72B6;&#x4EE3;&#x7801;&#x5F00;&#x59CB;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x7528;&#x6CBF;&#x692D;&#x5706;&#x8F6E;&#x5ED3;&#x987A;&#x5E8F;&#x653E;&#x7F6E;&#x7684;&#x9876;&#x70B9;&#x66FF;&#x6362;&#x968F;&#x673A;&#x9876;&#x70B9;&#x3002;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x524D;&#x9762;&#x8BB0;&#x5FC6;&#x7684;&#x4E24;&#x884C;&#x7EBF;&#x6765;&#x5B9E;&#x73B0;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x4F46;&#x662F;&#x6CA1;&#x6709;&#x5C06;&#x76F8;&#x540C;&#x7684;&#x89D2;&#x5EA6;&#x4F20;&#x9012;&#x7ED9;sin()&#x548C;cos()&#xFF0C;&#x800C;&#x662F;&#x5728;&#x6BCF;&#x6B21;&#x8FED;&#x4EE3;&#x4E2D;&#x901A;&#x8FC7;&#x5C06;i&#x4E58;&#x4EE5;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x7684;&#x9876;&#x70B9;&#x4E4B;&#x95F4;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x8BA1;&#x7B97;&#x4E0D;&#x540C;&#x7684;&#x89D2;&#x5EA6;&#x3002;&#x7ED3;&#x679C;&#x662F;&#x4E00;&#x4E2A;&#x5F62;&#x72B6;&#xFF0C;10&#x4E2A;&#x9876;&#x70B9;&#x5747;&#x5300;&#x5730;&#x5206;&#x5E03;&#x5728;&#x753B;&#x5E03;&#x7684;&#x4E2D;&#x5FC3;&#x3002;</p>
<p><img src="../images/p49.png" alt=""></p>
<pre><code class="lang-JavaScript">translate(width/<span class="hljs-number">2</span>, height/<span class="hljs-number">2</span>);
beginShape();
<span class="hljs-keyword">for</span>(<span class="hljs-keyword">var</span> i = <span class="hljs-number">0</span>; i &lt; <span class="hljs-number">10</span>; i++) {
  <span class="hljs-keyword">var</span> x = cos(radians(i * <span class="hljs-number">36</span>)) * <span class="hljs-number">100</span>;
  <span class="hljs-keyword">var</span> y = sin(radians(i * <span class="hljs-number">36</span>)) * <span class="hljs-number">100</span>;
  vertex(x, y);
}
endShape();
</code></pre>
<p>&#x901A;&#x8FC7;&#x6539;&#x53D8;&#x8FED;&#x4EE3;&#x6B21;&#x6570;&#x548C;&#x9876;&#x70B9;&#x4E4B;&#x95F4;&#x7684;&#x95F4;&#x8DDD;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x7ED8;&#x5236;&#x6240;&#x6709;&#x57FA;&#x672C;&#x5F62;&#x72B6;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x5728;&#x8349;&#x56FE;&#x7684;&#x9876;&#x90E8;&#x6DFB;&#x52A0;&#x4E86;&#x51E0;&#x4E2A;&#x53D8;&#x91CF;&#xFF0C;&#x6839;&#x636E;&#x9876;&#x70B9;&#x7684;&#x6570;&#x91CF;&#x81EA;&#x52A8;&#x8BA1;&#x7B97;&#x95F4;&#x8DDD;&#x3002;&#x66F4;&#x6539;numVertices&#x53D8;&#x91CF;&#xFF0C;&#x5C06;&#x51FA;&#x73B0;&#x53E6;&#x4E00;&#x4E2A;&#x5F62;&#x72B6;&#x3002;</p>
<p><img src="../images/p50.png" alt=""></p>
<pre><code class="lang-JavaScript"><span class="hljs-keyword">var</span> numVertices = <span class="hljs-number">3</span>; <span class="hljs-comment">// or 4 or 30</span>
<span class="hljs-keyword">var</span> spacing = <span class="hljs-number">360</span> / numVertices;
translate(width/<span class="hljs-number">2</span>, height/<span class="hljs-number">2</span>);
beginShape();
<span class="hljs-keyword">for</span>(<span class="hljs-keyword">var</span> i = <span class="hljs-number">0</span>; i &lt; <span class="hljs-number">10</span>; i++) {
  <span class="hljs-keyword">var</span> x = cos(radians(i * spacing)) * <span class="hljs-number">100</span>;
  <span class="hljs-keyword">var</span> y = sin(radians(i * spacing)) * <span class="hljs-number">100</span>;
  vertex(x, y);
}
endShape();
</code></pre>
<p>&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x8BF4;&#xFF0C;&#x201C;&#x592A;&#x597D;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x91CD;&#x65B0;&#x53D1;&#x660E;&#x4E86;&#x57FA;&#x672C;&#x7684;&#x5F62;&#x72B6;&#x529F;&#x80FD;&#x201D;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x8FD9;&#x79CD;&#x6280;&#x672F;&#x53EF;&#x4EE5;&#x8BA9;&#x6211;&#x4EEC;&#x753B;&#x51FA;&#x66F4;&#x590D;&#x6742;&#x7684;&#x5F62;&#x72B6;&#x3002;&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x51E0;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x5B83;&#x4EEC;&#x90FD;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;sin()&#x548C;cos()&#x516C;&#x5F0F;&#x6765;&#x7ED8;&#x5236;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x5F62;&#x72B6;&#x3002;&#x6211;&#x4EEC;&#x4ECE;&#x4E0B;&#x9762;&#x7684;&#x5706;&#x5708;&#x5F00;&#x59CB;&#xFF0C;&#x6BCF;&#x4E2A;&#x9876;&#x70B9;&#x7684;&#x534A;&#x5F84;&#x90FD;&#x662F;&#x968F;&#x673A;&#x7684;&#xFF0C;&#x8FD9;&#x6837;&#x770B;&#x8D77;&#x6765;&#x5C31;&#x50CF;&#x624B;&#x5DE5;&#x753B;&#x7684;&#x4E00;&#x6837;&#x3002;</p>
<p><img src="../images/p51.png" alt=""></p>
<pre><code class="lang-JavaScript">translate(width/<span class="hljs-number">2</span>, height/<span class="hljs-number">2</span>);

beginShape();
<span class="hljs-keyword">for</span>(<span class="hljs-keyword">var</span> i = <span class="hljs-number">0</span>; i &lt; <span class="hljs-number">100</span>; i++) {
  <span class="hljs-keyword">var</span> radius = <span class="hljs-number">100</span> + random(<span class="hljs-number">5</span>); <span class="hljs-comment">// &#x6539;&#x53D8;&#x6BCF;&#x4E2A;&#x9876;&#x70B9;&#x7684;&#x534A;&#x5F84;</span>
  <span class="hljs-keyword">var</span> x = cos(radians(i * <span class="hljs-number">3.6</span>)) * radius;
  <span class="hljs-keyword">var</span> y = sin(radians(i * <span class="hljs-number">3.6</span>)) * radius;
  vertex(x, y);
}
endShape();
</code></pre>
<p>&#x4E0B;&#x9762;&#x7684;&#x6052;&#x661F;&#x662F;&#x901A;&#x8FC7;&#x5728;&#x6BCF;&#x4E2A;&#x9876;&#x70B9;&#x7684;&#x4F4E;&#x534A;&#x5F84;&#x548C;&#x9AD8;&#x534A;&#x5F84;&#x4E4B;&#x95F4;&#x4EA4;&#x66FF;&#x4EA7;&#x751F;&#x7684;&#x3002;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x5B57;&#x6216;&#x66F4;&#x591A;&#x7684;&#x9876;&#x70B9;&#xFF0C;&#x6216;&#x8005;&#x4F7F;&#x7528;&#x65CB;&#x8F6C;&#xFF08;&#xFF09;&#x6765;&#x6539;&#x53D8;&#x6052;&#x661F;&#x7684;&#x65B9;&#x5411;&#xFF0C;&#x5F88;&#x5BB9;&#x6613;&#x8C03;&#x6574;&#x6052;&#x661F;&#x7684;&#x98CE;&#x683C;&#x3002;</p>
<p><img src="../images/p52.png" alt=""></p>
<pre><code class="lang-JavaScript">translate(width/<span class="hljs-number">2</span>, height/<span class="hljs-number">2</span>);
<span class="hljs-keyword">var</span> radius = <span class="hljs-number">100</span>; <span class="hljs-comment">// &#x5C06;&#x521D;&#x59CB;&#x534A;&#x5F84;&#x8BBE;&#x7F6E;&#x4E3A;100</span>
beginShape();
<span class="hljs-keyword">for</span>(<span class="hljs-keyword">var</span> i = <span class="hljs-number">0</span>; i &lt; <span class="hljs-number">10</span>; i++) { <span class="hljs-comment">// &#x4F7F;&#x7528;cos/sin&#x516C;&#x5F0F;&#x4E2D;&#x7684;&#x534A;&#x5F84;&#x3002;</span>
  <span class="hljs-keyword">var</span> x = cos(radians(i * <span class="hljs-number">36</span>)) * radius;
  <span class="hljs-keyword">var</span> y = sin(radians(i * <span class="hljs-number">36</span>)) * radius;
  vertex(x, y);
  <span class="hljs-keyword">if</span>(radius == <span class="hljs-number">100</span>) { <span class="hljs-comment">// &#x6539;&#x53D8;&#x4E0B;&#x4E00;&#x4E2A;&#x9876;&#x70B9;&#x7684;&#x534A;&#x5F84;</span>
    radius = <span class="hljs-number">50</span>;
  } <span class="hljs-keyword">else</span> {
    radius = <span class="hljs-number">100</span>;
  }
}
endShape();
</code></pre>
<p>&#x8FD9;&#x91CC;&#x662F;&#x4E00;&#x4E2A;&#x7528;&#x4E8C;&#x6B21;&#x9876;&#x70B9;()&#x521B;&#x5EFA;&#x7684;&#x82B1;&#xFF0C;&#x5176;&#x4E2D;&#x6240;&#x6709;&#x7684;&#x9876;&#x70B9;&#x548C;&#x63A7;&#x5236;&#x70B9;&#x90FD;&#x4F7F;&#x7528;<code>sin()</code>&#x548C;<code>cos()</code>&#x5B9A;&#x4F4D;&#x3002;&#x901A;&#x8FC7;&#x5BF9;&#x63A7;&#x5236;&#x70B9;&#x4F7F;&#x7528;&#x66F4;&#x5927;&#x7684;&#x534A;&#x5F84;(&#x4E0A;&#x9762;&#x661F;&#x56FE;&#x7684;&#x53CD;&#x4F8B;)&#xFF0C;&#x66F2;&#x7EBF;&#x5C31;&#x4F1A;&#x5411;&#x5916;&#x5EF6;&#x4F38;&#x3002;&#x4F7F;&#x7528;B&#xE9;zier&#x66F2;&#x7EBF;&#x65F6;&#xFF0C;&#x8BF7;&#x8BB0;&#x4F4F;&#x4F7F;&#x7528;<code>vertex()</code>&#x51FD;&#x6570;&#x8C03;&#x7528;&#x5F00;&#x59CB;&#x5F62;&#x72B6;&#x3002;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x68C0;&#x67E5;&#x5FAA;&#x73AF;&#x4E2D;<code>i</code>&#x7684;&#x503C;&#x6765;&#x505A;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#x3002;</p>
<p><img src="../images/p53.png" alt=""></p>
<pre><code class="lang-JavaScript"><span class="hljs-keyword">var</span> numVertices = <span class="hljs-number">7</span>; <span class="hljs-comment">// &#x81EA;&#x52A8;&#x8BA1;&#x7B97;&#x95F4;&#x8DDD;</span>
<span class="hljs-keyword">var</span> spacing = <span class="hljs-number">360</span> / numVertices;

beginShape();

<span class="hljs-keyword">for</span>(<span class="hljs-keyword">var</span> i = <span class="hljs-number">0</span>; i &lt; numVertices+<span class="hljs-number">1</span>; i++) { <span class="hljs-comment">// &#x5C06;&#x4E00;&#x4E2A;&#x989D;&#x5916;&#x7684;&#x65F6;&#x95F4;&#x5FAA;&#x73AF;&#x5230;&#x5177;&#x6709;&#x66F2;&#x7EBF;&#x7684;&#x5F62;&#x72B6;&#x3002;</span>

  <span class="hljs-keyword">var</span> angle = i * spacing; <span class="hljs-comment">// &#x627E;&#x5230;&#x9876;&#x70B9;&#x7684;&#x4F4D;&#x7F6E;</span>
  <span class="hljs-keyword">var</span> x = cos(radians(angle)) * <span class="hljs-number">100</span>;
  <span class="hljs-keyword">var</span> y = sin(radians(angle)) * <span class="hljs-number">100</span>;

  <span class="hljs-keyword">if</span>(i == <span class="hljs-number">0</span>) {
    vertex(x, y); <span class="hljs-comment">// &#x5982;&#x679C;&#x8FD9;&#x662F;&#x5FAA;&#x73AF;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x8FD0;&#x884C;&#xFF0C;&#x521B;&#x5EFA;&#x7B80;&#x5355;&#x7684;&#x9876;&#x70B9;&#x3002;</span>
  }
  <span class="hljs-keyword">else</span> { <span class="hljs-comment">// &#x5426;&#x5219;&#xFF0C;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x4E8C;&#x6B21;B&#xE9;zier&#x9876;&#x70B9;&#xFF0C;&#x63A7;&#x5236;&#x70B9;&#x4F4D;&#x4E8E;&#x70B9;&#x4E2D;&#x95F4;&#xFF0C;&#x534A;&#x5F84;&#x8F83;&#x9AD8;&#x3002;</span>
    <span class="hljs-keyword">var</span> cAngle = angle - spacing/<span class="hljs-number">2</span>;
    <span class="hljs-keyword">var</span> cX = cos(radians(cAngle)) * <span class="hljs-number">180</span>;
    <span class="hljs-keyword">var</span> cY = sin(radians(cAngle)) * <span class="hljs-number">180</span>;
    quadraticVertex(cX, cY, x, y)
  }
}
endShape();
</code></pre>
<p>&#x4F60;&#x7ECF;&#x5E38;&#x4F1A;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x53EA;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x5FAA;&#x73AF;&#x51FD;&#x6570;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x4E24;&#x4E2A;&#x5F62;&#x72B6;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x521B;&#x5EFA;&#x7684;&#xFF1A;&#x7B2C;&#x4E00;&#x4E2A;&#x4F7F;&#x7528;<code>sin()</code>&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x4F7F;&#x7528;<code>cos()</code>&#xFF08;&#x5982;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x6240;&#x793A;&#xFF09;&#x3002;</p>
<p><img src="../images/p54.png" alt="">
<img src="../images/p55.png" alt=""></p>
<pre><code class="lang-JavaScript">strokeWeight(<span class="hljs-number">20</span>);
strokeCap(SQUARE);
translate((width/<span class="hljs-number">2</span>) - <span class="hljs-number">200</span>, height/<span class="hljs-number">2</span>);
beginShape();
<span class="hljs-keyword">for</span>(<span class="hljs-keyword">var</span> i = <span class="hljs-number">0</span>; i &lt; <span class="hljs-number">200</span>; i++) {
  <span class="hljs-keyword">var</span> x = i * <span class="hljs-number">2</span>; <span class="hljs-comment">// x&#x8F74;&#x4E0A;2&#x50CF;&#x7D20;&#x95F4;&#x8DDD;.</span>
  <span class="hljs-keyword">var</span> y = cos(i * radians(<span class="hljs-number">2</span>)) * <span class="hljs-number">100</span>; <span class="hljs-comment">// y&#x8F74;&#x4E0A;200&#x50CF;&#x7D20;&#x9AD8;&#x7684;&#x6CE2;&#x5F62;.</span>
  vertex(x, y);
}
endShape();
</code></pre>
<p>&#x6B63;&#x5F26;&#x548C;&#x4F59;&#x5F26;&#x53EF;&#x7528;&#x4E8E;&#x5728;&#x8BBE;&#x8BA1;&#x8FC7;&#x7A0B;&#x4E2D;&#x521B;&#x5EFA;&#x4E00;&#x7CFB;&#x5217;&#x4E0D;&#x540C;&#x7684;&#x5F62;&#x72B6;&#x3002;&#x5728;&#x7EA6;&#x745F;&#x592B;&#xB7;&#x7A46;&#x52D2;-&#x5E03;&#x7F57;&#x514B;&#x66FC;&#x7684;&#x8BBE;&#x8BA1;&#x4E2D;&#xFF0C;&#x4E00;&#x7CFB;&#x5217;&#x6307;&#x6570;&#x589E;&#x957F;&#x7684;&#x5F27;&#x7EBF;&#x56F4;&#x7ED5;&#x7740;&#x753B;&#x5E03;&#x7684;&#x5DE6;&#x4E0B;&#x89D2;&#x65CB;&#x8F6C;&#x3002;</p>
<p><img src="https://www.programmingdesignsystems.com/assets/shape/procedural-shapes/brockmann.jpg" alt=""></p>
<blockquote>
<p>&#x7531;Josef M&#xFC;ller-Brockmann&#x8BBE;&#x8BA1;&#x7684;&#x6D77;&#x62A5;&#x300A;Beethoven&#x300B;</p>
</blockquote>
<p>&#x6C89;&#x6DC0;&#x7269;&#x706B;&#x661F;&#x662F;&#x7531;&#x8428;&#x62C9;&#xB7;&#x54C8;&#x62C9;&#x8D6B;&#x548C;&#x963F;&#x83B1;&#x6851;&#x5FB7;&#x62C9;&#xB7;&#x7EF4;&#x62C9;&#x7C73;&#x5C14;&#x8BBE;&#x8BA1;&#x7684;&#x4E00;&#x7CFB;&#x5217;&#x751F;&#x6210;&#x6D77;&#x62A5;&#x3002;<code>sin()</code>&#x548C;<code>cos()</code>&#x51FD;&#x6570;&#x7528;&#x4E8E;&#x751F;&#x6210;&#x692D;&#x5706;&#x5F62;&#x72B6;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x968F;&#x673A;&#x503C;&#x6DFB;&#x52A0;&#x5230;&#x692D;&#x5706;&#x5F62;&#x72B6;&#x4E2D;&#x3002;</p>
<p><img src="https://www.programmingdesignsystems.com/assets/shape/procedural-shapes/sedimentmars.jpg" alt=""></p>
<blockquote>
<p>&#x7531;Sarah Hallacher &#x548C; Alessandra Villaamil &#x8BBE;&#x8BA1;&#x7684;&#x300A;&#x706B;&#x661F;&#x6C89;&#x79EF;&#x7269;&#x300B;</p>
</blockquote>
<p>&#x9879;&#x76EE;&#x751F;&#x6210;&#x6E38;&#x620F;&#x662F;AdriaNavarro&#x7684;&#x4E00;&#x4E2A;&#x7EB8;&#x724C;&#x6E38;&#x620F;&#xFF0C;&#x5B83;&#x4F7F;&#x7528;&#x8FC7;&#x7A0B;&#x7ED8;&#x56FE;&#x6765;&#x521B;&#x5EFA;&#x65E0;&#x9650;&#x6570;&#x91CF;&#x7684;&#x751F;&#x6210;&#x5B57;&#x7B26;&#x3002;&#x5B57;&#x7B26;&#x4F53;&#x662F;&#x4F7F;&#x7528;<code>sin()</code>&#x548C;<code>cos()</code>&#x521B;&#x5EFA;&#x7684;&#x3002;</p>
<p><img src="https://www.programmingdesignsystems.com/assets/shape/procedural-shapes/generativeplay.jpg" alt=""></p>
<blockquote>
<p>&#x7531;Adria Navarro&#x8BBE;&#x8BA1;&#x7684;&#x751F;&#x6210;&#x620F;</p>
</blockquote>
<p>&#x672C;&#x7AE0;&#x4ECB;&#x7ECD;&#x4E86;&#x4E00;&#x79CD;&#x4E0E;&#x4F20;&#x7EDF;&#x8BBE;&#x8BA1;&#x8FC7;&#x7A0B;&#x672C;&#x8D28;&#x4E0D;&#x540C;&#x7684;&#x8BBE;&#x8BA1;&#x65B9;&#x6CD5;&#x3002;&#x4E0E;&#x5176;&#x5C06;&#x6BCF;&#x4E2A;&#x5F62;&#x72B6;&#x5355;&#x72EC;&#x653E;&#x7F6E;&#x5728;&#x753B;&#x5E03;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x4E3A;&#x6211;&#x4EEC;&#x7F16;&#x5199;&#x4E86;&#x7B97;&#x6CD5;&#x3002;&#x4F7F;&#x7528;&#x5FAA;&#x73AF;&#x7ED8;&#x5236;&#x5F62;&#x72B6;&#x662F;&#x4E00;&#x4E2A;&#x5F3A;&#x5927;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5141;&#x8BB8;&#x8BBE;&#x8BA1;&#x8005;&#x7528;&#x66F4;&#x5C11;&#x7684;&#x4EE3;&#x7801;&#x505A;&#x66F4;&#x591A;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x4ECE;&#x800C;&#x51CF;&#x8F7B;&#x624B;&#x5DE5;&#x6784;&#x5EFA;&#x6BCF;&#x4E2A;&#x8BBE;&#x8BA1;&#x5BF9;&#x8C61;&#x7684;&#x75DB;&#x82E6;&#x3002;&#x8FD9;&#x4E5F;&#x662F;&#x8FC7;&#x7A0B;&#x8BBE;&#x8BA1;&#x4E2D;&#x6700;&#x96BE;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x56E0;&#x4E3A;&#x8BBE;&#x8BA1;&#x5E08;&#x9700;&#x8981;&#x82B1;&#x66F4;&#x591A;&#x7684;&#x65F6;&#x95F4;&#x5C06;&#x7CFB;&#x7EDF;&#x5206;&#x89E3;&#x6210;&#x4EE3;&#x7801;&#xFF0C;&#x800C;&#x4E14;&#x4ED6;&#x4EEC;&#x4E0D;&#x80FD;&#x50CF;&#x5728;&#x4F20;&#x7EDF;&#x7684;&#x8BBE;&#x8BA1;&#x5DE5;&#x5177;&#x4E2D;&#x90A3;&#x6837;&#x8F7B;&#x677E;&#x5730;&#x64CD;&#x4F5C;&#x5355;&#x4E2A;&#x5F62;&#x72B6;&#x3002;&#x7F8E;&#x56FD;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x5BB6;DonaldKnuth&#x79F0;&#x8FD9;&#x662F;&#x4ECE;&#x8BBE;&#x8BA1;&#x5230;&#x5143;&#x8BBE;&#x8BA1;&#x7684;&#x8FC7;&#x6E21;&#xFF1A;</p>
<p><em>&#x201C;&#x5143;&#x8BBE;&#x8BA1;&#x6BD4;&#x8BBE;&#x8BA1;&#x96BE;&#x5F97;&#x591A;&#xFF1B;&#x753B;&#x4E1C;&#x897F;&#x6BD4;&#x89E3;&#x91CA;&#x600E;&#x4E48;&#x753B;&#x5BB9;&#x6613;&#x5F97;&#x591A;&#x3002;[&#x2026;]&#x7136;&#x800C;&#xFF0C;&#x4E00;&#x65E6;&#x6211;&#x4EEC;&#x6210;&#x529F;&#x5730;&#x89E3;&#x91CA;&#x4E86;&#x5982;&#x4F55;&#x4EE5;&#x8DB3;&#x591F;&#x7B3C;&#x7EDF;&#x7684;&#x65B9;&#x5F0F;&#x753B;&#x4E1C;&#x897F;&#xFF0C;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x540C;&#x6837;&#x7684;&#x89E3;&#x91CA;&#x5C06;&#x9002;&#x7528;&#x4E8E;&#x76F8;&#x5173;&#x7684;&#x5F62;&#x72B6;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x82B1;&#x5728;&#x7CBE;&#x786E;&#x89E3;&#x91CA;&#x4E0A;&#x7684;&#x65F6;&#x95F4;&#x662F;&#x503C;&#x5F97;&#x7684;&#x3002;&#x201C;</em></p>
<blockquote>
<p>Donald Knuth(1986) &#x300A;The Metafont Book&#x300B;</p>
</blockquote>
<p>&#x8FD9;&#x4E5F;&#x662F;&#x672C;&#x4E66;&#x7684;&#x4E3B;&#x8981;&#x8BBA;&#x9898;&#x3002;&#x5F53;&#x8BBE;&#x8BA1;&#x5E08;&#x4E0D;&#x4EC5;&#x5B66;&#x4F1A;&#x7CFB;&#x7EDF;&#x5730;&#x601D;&#x8003;&#x8BBE;&#x8BA1;&#x8FC7;&#x7A0B;&#xFF0C;&#x800C;&#x4E14;&#x5B66;&#x4F1A;&#x5728;&#x8F6F;&#x4EF6;&#x4E2D;&#x5B9E;&#x73B0;&#x8FD9;&#x4E9B;&#x7CFB;&#x7EDF;&#x65F6;&#xFF0C;&#x4ED6;&#x4EEC;&#x53EF;&#x4EE5;&#x6784;&#x5EFA;&#x4EE5;&#x524D;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#x4E1C;&#x897F;&#x3002;</p>
<svg width="100%" height="3" xmlns="http://www.w3.org/2000/svg"><line x1="0" y1="1" x2="100%" y2="1" stroke-dasharray="6, 3" stroke-width="2" stroke="#29b79b"/></svg>

<h3 id="&#x7EC3;&#x4E60;">&#x7EC3;&#x4E60;</h3>
<p>&#x5C1D;&#x8BD5;&#x4F7F;&#x7528;&#x672C;&#x7AE0;&#x4ECB;&#x7ECD;&#x7684;&#x6280;&#x672F;&#x7ED8;&#x5236;&#x6240;&#x6709;&#x57FA;&#x672C;&#x5F62;&#x72B6;&#x3002;&#x7136;&#x540E;&#x7EE7;&#x7EED;&#x751F;&#x6210;&#x5176;&#x4ED6;&#x7C7B;&#x578B;&#x7684;&#x5F62;&#x72B6;&#x3002;&#x4F60;&#x80FD;&#x7528;<code>random()</code>&#x6765;&#x64CD;&#x7EB5;&#x5F62;&#x72B6;&#x8F6E;&#x5ED3;&#x5417;&#xFF1F;&#x4F60;&#x80FD;&#x7528;B&#xE9;zier&#x66F2;&#x7EBF;&#x4EE3;&#x66FF;&#x7B80;&#x5355;&#x7684;&#x9876;&#x70B9;&#x5417;&#xFF1F;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="1.3.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 1.3 定制形状">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"1.4 程序形状","level":"1.3.4","depth":2,"next":{"title":"2.颜色","level":"1.4","depth":1,"ref":"","articles":[{"title":"2.1 颜色理论简史","level":"1.4.1","depth":2,"path":"chapters/2.1.md","ref":"chapters/2.1.md","articles":[]},{"title":"2.2 颜色模型及颜色空间","level":"1.4.2","depth":2,"path":"chapters/2.2.md","ref":"chapters/2.2.md","articles":[]},{"title":"2.3 感知颜色空间的一致性","level":"1.4.3","depth":2,"path":"chapters/2.3.md","ref":"chapters/2.3.md","articles":[]},{"title":"2.4 配色方案","level":"1.4.4","depth":2,"path":"chapters/2.4.md","ref":"chapters/2.4.md","articles":[]}]},"previous":{"title":"1.3 定制形状","level":"1.3.3","depth":2,"path":"chapters/1.3.md","ref":"chapters/1.3.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"chapters/1.4.md","mtime":"2019-09-25T14:22:20.588Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-09-30T10:31:33.641Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

