
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>2.1 颜色理论的小历史 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="2.2.html" />
    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    编程设计系统
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="0.html">
            
                <a href="0.html">
            
                    
                    0.什么是设计系统
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    1.形状
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="1.1.html">
            
                <a href="1.1.html">
            
                    
                    1.1 图形基础
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="1.2.html">
            
                <a href="1.2.html">
            
                    
                    1.2 基本形状
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="1.3.html">
            
                <a href="1.3.html">
            
                    
                    1.3 定制形状
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="1.4.html">
            
                <a href="1.4.html">
            
                    
                    1.4 程序形状
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    2.颜色
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.4.1" data-path="2.1.html">
            
                <a href="2.1.html">
            
                    
                    2.1 颜色理论的小历史
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="2.2.html">
            
                <a href="2.2.html">
            
                    
                    2.2 颜色模型及颜色空间
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="2.3.html">
            
                <a href="2.3.html">
            
                    
                    2.3 感知颜色空间的一致性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4" data-path="2.4.html">
            
                <a href="2.4.html">
            
                    
                    2.4 配色方案
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" >
            
                <span>
            
                    
                    3.布局
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="3.1.html">
            
                <a href="3.1.html">
            
                    
                    3.1 几何图形简史
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" >
            
                <span>
            
                    
                    未完持续更新...
            
                </span>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >2.1 颜色理论的小历史</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x7F16;&#x7A0B;&#x8BBE;&#x8BA1;&#x7CFB;&#x7EDF;&#x4E4B;&#x989C;&#x8272;">&#x7F16;&#x7A0B;&#x8BBE;&#x8BA1;&#x7CFB;&#x7EDF;&#x4E4B;&#x989C;&#x8272;</h2>
<h3 id="&#x989C;&#x8272;&#x7406;&#x8BBA;&#x7684;&#x5C0F;&#x5386;&#x53F2;">&#x989C;&#x8272;&#x7406;&#x8BBA;&#x7684;&#x5C0F;&#x5386;&#x53F2;</h3>
<p>&#x6240;&#x6709;&#x51FA;&#x73B0;&#x5728;&#x8FD9;&#x672C;&#x4E66;&#x4E2D;&#x7684;&#x4E3B;&#x9898;&#xFF0C;&#x6700;&#x590D;&#x6742;&#x7684;&#x5E94;&#x8BE5;&#x662F;&#x5173;&#x4E8E;&#x989C;&#x8272;&#x7406;&#x8BBA;&#x7684;&#x90E8;&#x5206;&#x3002;&#x5C3D;&#x7BA1;&#x5BF9;&#x4E8E;&#x8272;&#x8C31;&#x7684;&#x57FA;&#x7840;&#x7406;&#x89E3;&#x662F;&#x76F8;&#x5F53;&#x5BB9;&#x6613;&#x53D1;&#x5C55;&#x7684;&#xFF0C;&#x989C;&#x8272;&#x7406;&#x8BBA;&#x662F;&#x4E00;&#x79CD;&#x51E0;&#x4E4E;&#x65E0;&#x7A77;&#x590D;&#x6742;&#x7684;&#x5B66;&#x79D1;&#xFF0C;&#x65E2;&#x6709;&#x79D1;&#x5B66;&#x7684;&#x6839;&#x6E90;&#x4E5F;&#x6709;&#x827A;&#x672F;&#x7684;&#x6839;&#x6E90;&#x3002;&#x7528;&#x4E00;&#x79CD;&#x65E2;&#x7B26;&#x5408;&#x827A;&#x672F;&#x5386;&#x53F2;&#x53C8;&#x7B26;&#x5408;&#x79D1;&#x5B66;&#x771F;&#x7406;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x5B66;&#x4E60;&#x5173;&#x4E8E;&#x8272;&#x5F69;&#x6784;&#x6210;&#x6210;&#x4E3A;&#x4E86;&#x4E00;&#x9879;&#x8270;&#x5DE8;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x5E76;&#x4E14;&#x6211;&#x89C1;&#x8FC7;&#x8BB8;&#x591A;&#x8BBE;&#x8BA1;&#x5E08;&#x53D7;&#x5230;&#x963B;&#x4E8E;&#x6700;&#x57FA;&#x7840;&#x7684;&#x95EE;&#x9898;&#xFF1A;&#x9EC4;&#x8272;&#x662F;&#x539F;&#x8272;&#x5417;&#xFF1F;&#x8272;&#x5F69;&#x7EC4;&#x5408;&#x6700;&#x548C;&#x8C10;&#x7684;&#x662F;&#x54EA;&#x79CD;&#xFF1F;&#x84DD;&#x8272;&#x771F;&#x6B63;&#x7684;&#x4E92;&#x8865;&#x8272;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;</p>
<p>&#x6211;&#x5E0C;&#x671B;&#x672C;&#x7AE0;&#x8272;&#x5F69;&#x539F;&#x7406;&#x7684;&#x5386;&#x53F2;&#x80FD;&#x591F;&#x901A;&#x8FC7;&#x5F3A;&#x8C03;&#x8BE5;&#x9886;&#x57DF;&#x4E2D;&#x5173;&#x952E;&#x4EBA;&#x7269;&#x7684;&#x9519;&#x8BEF;&#x4E0E;&#x6210;&#x529F;&#x6765;&#x5E2E;&#x52A9;&#x4F60;&#x56DE;&#x7B54;&#x90E8;&#x5206;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x3002;&#x5728;&#x8FD9;&#x7F29;&#x5199;&#x548C;&#x72ED;&#x7A84;&#x7684;&#x4ECB;&#x7ECD;&#x4E2D;&#xFF0C;&#x6211;&#x7279;&#x522B;&#x5BF9;&#x4E24;&#x4E2A;&#x72EC;&#x7279;&#x4F46;&#x53C8;&#x76F8;&#x5173;&#x7684;&#x9886;&#x57DF;&#x4E4B;&#x95F4;&#x7684;&#x51B2;&#x7A81;&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x4E8C;&#x8005;&#x5747;&#x5728;&#x201C;&#x8272;&#x5F69;&#x7406;&#x8BBA;&#x201D;&#x7684;&#x4E00;&#x8BCD;&#x4E0B;&#x8FD0;&#x4F5C;&#xFF1A;&#x827A;&#x672F;&#x7684;&#x8272;&#x5F69;&#x7406;&#x8BBA;&#xFF0C;&#x5B83;&#x5173;&#x6CE8;&#x5728;&#x7F8E;&#x672F;&#x4E2D;&#x8272;&#x5F69;&#x7EC4;&#x5408;&#x7684;&#x89C6;&#x89C9;&#x5F71;&#x54CD;&#xFF0C;&#x4EE5;&#x53CA;&#x79D1;&#x5B66;&#x8272;&#x5F69;&#x7406;&#x8BBA;&#xFF0C;&#x901A;&#x8FC7;&#x8D8A;&#x6765;&#x8D8A;&#x590D;&#x6742;&#x4F46;&#x7CBE;&#x786E;&#x7684;&#x8272;&#x5F69;&#x6A21;&#x578B;&#x6765;&#x63CF;&#x8FF0;&#x989C;&#x8272;&#x7684;&#x672C;&#x8D28;&#x3002;&#x540E;&#x9762;&#x7684;&#x7AE0;&#x8282;&#x5C06;&#x5EFA;&#x7ACB;&#x4E8E;&#x672C;&#x7AE0;&#x8282;&#x7684;&#x5B66;&#x4E60;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x5E76;&#x4E14;&#x6211;&#x76F8;&#x4FE1;,&#x8BBE;&#x8BA1;&#x5E08;&#x4EEC;&#x6709;&#x5FC5;&#x8981;&#x5BF9;&#x8BE5;&#x5386;&#x53F2;&#x6709;&#x4E00;&#x4E2A;&#x7684;&#x6DF1;&#x523B;&#x89C1;&#x89E3;&#xFF0C;&#x624D;&#x80FD;&#x5BF9;&#x8272;&#x5F69;&#x4F5C;&#x51FA;&#x66F4;&#x597D;&#x9009;&#x62E9;&#x3002;</p>
<p>&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x5DF2;&#x77E5;&#x7684;&#x8272;&#x5F69;&#x7406;&#x8BBA;&#x80FD;&#x591F;&#x5728;&#x300A;On Colors&#x300B;&#x4E2D;&#x627E;&#x5230;&#xFF0C;&#x4E00;&#x6BB5;&#x5199;&#x5728;&#x53E4;&#x5E0C;&#x814A;&#x7684;&#x7B80;&#x77ED;&#x6587;&#x5B57;&#x3002;&#x8BE5;&#x6587;&#x6700;&#x65E9;&#x51FA;&#x81EA;&#x4E8E;&#x4E9A;&#x91CC;&#x58EB;&#x591A;&#x5FB7;&#xFF0C;&#x4F46;&#x73B0;&#x5728;&#x88AB;&#x666E;&#x904D;&#x8BA4;&#x4E3A;&#x662F;&#x7531;&#x4ED6;&#x7684;&#x900D;&#x9065;&#x5B66;&#x6D3E;&#x5B66;&#x6821;&#x6210;&#x5458;&#x4EEC;&#x6240;&#x5199;&#x3002;&#x57FA;&#x4E8E;&#x5BF9;&#x81EA;&#x7136;&#x4E2D;&#x8272;&#x5F69;&#x6709;&#x4F55;&#x79CD;&#x8868;&#x73B0;&#x7684;&#x89C2;&#x5BDF;&#xFF0C;&#x8BE5;&#x6587;&#x8BA4;&#x4E3A;&#x6240;&#x6709;&#x8272;&#x5F69;&#x5B58;&#x5728;&#x4E8E;&#x6697;&#x4E0E;&#x5149;&#x4E4B;&#x95F4;&#x7684;&#x5149;&#x8C31;&#x4E2D;&#xFF0C;&#x5E76;&#x4E14;&#x56DB;&#x539F;&#x8272;&#x6765;&#x81EA;&#x4E8E;&#x56DB;&#x79CD;&#x8981;&#x7D20;&#xFF0C;&#x706B;&#x3001;&#x7A7A;&#x6C14;&#x3001;&#x6C34;&#x3001;&#x5730;&#x7403;&#x3002;&#x8FD9;&#x5728;&#x4ECA;&#x5929;&#x770B;&#x6765;&#x53EF;&#x662F;&#x76F8;&#x5F53;&#x602A;&#x5F02;&#x548C;&#x53D6;&#x5DE7;&#xFF0C;&#x4F46;&#x8FD9;&#x4E9B;&#x89C2;&#x6D4B;&#x5728;&#x90A3;&#x662F;&#x662F;&#x5408;&#x7406;&#x7684;&#xFF1A;&#x5728;&#x5927;&#x5730;&#x4E0A;&#x7684;&#x690D;&#x7269;&#x662F;&#x7EFF;&#x8272;&#x7684;&#x4E14;&#x6839;&#x90E8;&#x662F;&#x767D;&#x8272;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x8272;&#x5F69;&#x5FC5;&#x987B;&#x6765;&#x81EA;&#x4E8E;&#x592A;&#x9633;&#x3002;&#x540C;&#x6837;&#x5730;&#xFF0C;&#x5E72;&#x71E5;&#x7684;&#x690D;&#x7269;&#x4F1A;&#x5931;&#x53BB;&#x9C9C;&#x8273;&#x7684;&#x989C;&#x8272;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x540C;&#x6837;&#x6C34;&#x4E5F;&#x63D0;&#x4F9B;&#x8272;&#x5F69;&#x3002;&#x8FD9;&#x4E2A;&#x7406;&#x8BBA;&#x662F;&#x51E0;&#x4E2A;&#x4E16;&#x7EAA;&#x4EE5;&#x6765;&#x8272;&#x5F69;&#x7406;&#x8BBA;&#x5BB6;&#x7528;&#x4E8E;&#x5EFA;&#x7ACB;&#x5B87;&#x5B99;&#x4E00;&#x822C;&#x7406;&#x8BBA;&#x7684;&#x5178;&#x578B;&#x4F8B;&#x5B50;&#x3002;&#x5C3D;&#x7BA1;&#x8FD9;&#x662F;&#x4E2A;&#x9519;&#x8BEF;&#x7684;&#x7406;&#x8BBA;&#xFF0C;On Color&#x6709;&#x4E00;&#x7CFB;&#x5217;&#x91CD;&#x8981;&#x7684;&#x89C2;&#x6D4B;&#xFF0C;&#x5982;&#x201C;&#x6697;&#x4E0D;&#x662F;&#x4E00;&#x79CD;&#x8272;&#x5F69;&#xFF0C;&#x4EC5;&#x4EC5;&#x53EA;&#x662F;&#x4E00;&#x79CD;&#x5149;&#x7684;&#x7F3A;&#x5931;&#x201D;&#x8FD9;&#x4E00;&#x4E8B;&#x5B9E;&#x3002;- &#x8BE5;&#x53D1;&#x73B0;&#x662F;&#x901A;&#x8FC7;&#x89C2;&#x5BDF;&#x4E91;&#x5C42;&#x53D8;&#x539A;&#x65F6;&#x5982;&#x4F55;&#x53D8;&#x6697;&#x800C;&#x63A8;&#x52A8;&#x7684;&#x3002;</p>
<p>&#x50CF;&#x8BB8;&#x591A;&#x5176;&#x4ED6;&#x79D1;&#x5B66;&#x7684;&#x9886;&#x57DF;&#x4E00;&#x6837;&#xFF0C;&#x827E;&#x8428;&#x514B;&#xB7;&#x725B;&#x987F;&#x5F53;&#x4ED6;&#x5728;1704&#x5E74;&#x53D1;&#x8868;&#x4E86;&#x300A;&#x5149;&#x5B66;&#x300B;&#x7684;&#x7B2C;&#x4E00;&#x7248;&#xFF0C;&#x5F7B;&#x5E95;&#x91CD;&#x65B0;&#x5B9A;&#x4E49;&#x4E86;&#x5149;&#x884C;&#x4E3A;&#x7684;&#x4F20;&#x7EDF;&#x7406;&#x8BBA;&#x3002;&#x800C;&#x4E0D;&#x662F;&#x5C06;&#x5149;&#x770B;&#x4F5C;&#x662F;&#x65E0;&#x8272;&#x7684;&#x989C;&#x8272;&#xFF0C;&#x725B;&#x987F;&#x53D1;&#x73B0;&#x767D;&#x5149;&#x662F;&#x4E00;&#x79CD;&#x7531;&#x5149;&#x8C31;&#x4E2D;&#x6240;&#x6709;&#x989C;&#x8272;&#x7684;&#x7EC4;&#x5408;&#x3002;&#x4ED6;&#x5B9E;&#x9A8C;&#x7684;&#x57FA;&#x7840;&#x662F;&#x4E00;&#x79CD;&#x5E7F;&#x4E3A;&#x4EBA;&#x77E5;&#x7684;&#x73B0;&#x8C61;&#xFF1A;&#x5F53;&#x4F60;&#x5C06;&#x767D;&#x5149;&#x7167;&#x8FDB;&#x68F1;&#x955C;&#x4E2D;&#xFF0C;&#x5149;&#x4F1A;&#x4ECE;&#x8272;&#x8C31;&#x4E2D;&#x5206;&#x79BB;&#x6210;&#x4E0D;&#x540C;&#x989C;&#x8272;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x725B;&#x987F;&#x53D1;&#x73B0;&#x4ED6;&#x80FD;&#x591F;&#x518D;&#x4E00;&#x6B21;&#x91CD;&#x65B0;&#x7EC4;&#x5408;&#x8FD9;&#x4E9B;&#x5149;&#x8C31;&#x989C;&#x8272;&#xFF0C;&#x4EE4;&#x4ED6;&#x4EEC;&#x53D8;&#x6210;&#x767D;&#x5149;&#x3002;</p>
<p>&#x725B;&#x987F;&#x4E5F;&#x90FD;&#x53D1;&#x73B0;&#x5982;&#x679C;&#x4ED6;&#x878D;&#x5408;&#x5149;&#x8C31;&#x4E2D;&#x7B2C;&#x4E00;&#x79CD;&#x989C;&#x8272;&#xFF08;&#x7EA2;&#x8272;&#xFF09;&#x548C;&#x6700;&#x540E;&#x4E00;&#x79CD;&#x989C;&#x8272;&#xFF08;&#x7D2B;&#x8272;&#xFF09;&#xFF0C;&#x4ED6;&#x80FD;&#x591F;&#x5236;&#x9020;&#x6D0B;&#x7EA2;&#x8272;&#xFF0C;&#x4E00;&#x79CD;&#x4E0D;&#x5B58;&#x5728;&#x4E8E;&#x5F69;&#x8679;&#x4E2D;&#x5149;&#x8C31;&#x4E4B;&#x5916;&#x7684;&#x989C;&#x8272;&#x3002;&#x8FD9;&#x4FC3;&#x4F7F;&#x4ED6;&#x5C06;&#x8272;&#x8C31;&#x5305;&#x88F9;&#x6210;&#x4E00;&#x4E2A;&#x73AF;&#x72B6;&#xFF0C;&#x5F00;&#x59CB;&#x4E86;&#x4F7F;&#x7528;&#x57FA;&#x7840;&#x5F62;&#x72B6;&#x6765;&#x8868;&#x793A;&#x8272;&#x5F69;&#x4E4B;&#x95F4;&#x5173;&#x7CFB;&#x7684;&#x4F20;&#x7EDF;&#x3002;&#x725B;&#x987F;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x73AF;&#x56E0;&#x4E3A;&#x5B83;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6307;&#x51FA;&#x4E24;&#x79CD;&#x8272;&#x5F69;&#x4E2D;&#x95F4;&#x7684;&#x989C;&#x8272;&#x6765;&#x9884;&#x6D4B;&#x4E24;&#x79CD;&#x989C;&#x8272;&#x6DF7;&#x5408;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x5728;&#x725B;&#x987F;&#x73AF;&#x4E2D;&#x7684;&#x989C;&#x8272;&#x5F7C;&#x6B64;&#x95F4;&#x7684;&#x8DDD;&#x79BB;&#x662F;&#x4E0D;&#x5BF9;&#x79F0;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x725B;&#x987F;&#x5E0C;&#x671B;&#x8FD9;&#x4E2A;&#x73AF;&#x72B6;&#x62E5;&#x6709;&#x4E03;&#x79CD;&#x989C;&#x8272;-&#x4E00;&#x5468;&#x4E2D;&#x7684;&#x786E;&#x5207;&#x5929;&#x6570;&#x548C;&#x516B;&#x5EA6;&#x97F3;&#x9636;&#x4E2D;&#x7684;&#x97F3;&#x7B26;&#x3002;</p>
<p><img src="https://www.programmingdesignsystems.com/assets/color/a-short-history-of-color-theory/newton-color-circle.jpg" alt="&#x725B;&#x987F;&#x73AF;"></p>
<p>&#x5F53;&#x725B;&#x987F;&#x5BF9;&#x989C;&#x8272;&#x79D1;&#x5B66;&#x89E3;&#x91CA;&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x5FB7;&#x56FD;&#x8BD7;&#x4EBA;&#x6C83;&#x5C14;&#x592B;&#x5188;&#xB7;&#x51AF;&#xB7;&#x6B4C;&#x5FB7;&#x5728;1810&#x5E74;&#x51FA;&#x7248;&#x7684;&#x300A;&#x8272;&#x5F69;&#x7406;&#x8BBA;&#x300B;&#x4E00;&#x4E66;&#x4E2D;&#xFF0C;&#x8D21;&#x732E;&#x4E86;&#x4E00;&#x79CD;&#x66F4;&#x52A0;&#x4EE5;&#x4EBA;&#x4E3A;&#x672C;&#x7684;&#x8272;&#x5F69;&#x611F;&#x77E5;&#x5206;&#x6790;&#x3002;&#x5C3D;&#x7BA1;&#x4E00;&#x7CFB;&#x5217;&#x5B9E;&#x9A8C;&#x6D4B;&#x91CF;&#x51FA;&#x4EBA;&#x773C;&#x5BF9;&#x7279;&#x5B9A;&#x989C;&#x8272;&#x7684;&#x53CD;&#x5E94;&#xFF0C;&#x6B4C;&#x5FB7;&#x521B;&#x9020;&#x4E86;&#x6709;&#x53F2;&#x4EE5;&#x6765;&#x6700;&#x8457;&#x540D;&#x8272;&#x5F69;&#x73AF;&#x3002;&#x8BE5;&#x73AF;&#x6709;&#x4E09;&#x79CD;&#x4E3B;&#x8981;&#x989C;&#x8272;-&#x7EA2;&#x3001;&#x9EC4;&#x3001;&#x84DD;-&#x4ED6;&#x76F8;&#x4FE1;&#x80FD;&#x591F;&#x6DF7;&#x5408;&#x51FA;&#x8272;&#x8C31;&#x4E2D;&#x5176;&#x4ED6;&#x6240;&#x6709;&#x989C;&#x8272;&#x3002;</p>
<p>&#x8BE5;&#x4E66;&#x5728;&#x8BB8;&#x591A;&#x65B9;&#x9762;&#x4E0E;&#x725B;&#x987F;&#x7406;&#x8BBA;&#x4E0D;&#x4E00;&#x81F4;&#xFF0C;&#x56E0;&#x4E3A;&#x6B4C;&#x5FB7;&#x76F8;&#x4FE1;&#x662F;&#x68F1;&#x955C;&#x800C;&#x4E0D;&#x662F;&#x5149;&#x521B;&#x9020;&#x4E86;&#x989C;&#x8272;&#xFF0C;&#x9ED1;&#x6697;&#x4E0D;&#x662F;&#x6CA1;&#x6709;&#x5149;&#x3002;&#x5C3D;&#x7BA1;&#x725B;&#x987F;&#x6700;&#x7EC8;&#x8D62;&#x5F97;&#x4E86;&#x5149;&#x7684;&#x672C;&#x8D28;&#x7684;&#x4E89;&#x8BBA;&#xFF0C;&#x6B4C;&#x5FB7;&#x7684;&#x5DE5;&#x4F5C;&#x5BF9;&#x4E8E;&#x6211;&#x4EEC;&#x800C;&#x8A00;&#x662F;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5173;&#x6CE8;&#x989C;&#x8272;&#x5BF9;&#x4EBA;&#x7C7B;&#x7684;&#x8BA4;&#x77E5;&#x5F71;&#x54CD;&#x3002;&#x4ED6;&#x5BF9;&#x540E;&#x50CF;&#x6548;&#x5E94;&#x548C;&#x5149;&#x5B66;&#x9519;&#x89C9;&#x7684;&#x7814;&#x7A76;&#x7279;&#x522B;&#x611F;&#x5174;&#x8DA3;&#x3002;&#x56E0;&#x4E3A;&#x5B83;&#x6307;&#x5411;&#x7EA6;&#x7FF0;&#x5185;&#x65AF;&#xB7;&#x4F0A;&#x6ED5;&#x548C;&#x7EA6;&#x745F;&#x592B;&#xB7;&#x963F;&#x5C14;&#x4F2F;&#x65AF;&#x7684;&#x665A;&#x671F;&#x4F5C;&#x54C1;&#x3002;</p>
<p><img src="https://www.programmingdesignsystems.com/assets/color/a-short-history-of-color-theory/goethe-color-circle.jpg" alt="&#x5177;&#x6709;&#x7EA2;&#x3001;&#x9EC4;&#x3001;&#x84DD;&#x4E3B;&#x8272;&#x7684;&#x6B4C;&#x5FB7;&#x8272;&#x73AF;"></p>
<p>&#x5C3D;&#x7BA1;&#x725B;&#x987F;&#x548C;&#x6B4C;&#x5FB7;&#x7684;&#x8272;&#x73AF;&#x4F3C;&#x4E4E;&#x4E92;&#x76F8;&#x77DB;&#x76FE;&#xFF0C;&#x4ED6;&#x4EEC;&#x5728;&#x67D0;&#x4E9B;&#x65B9;&#x9762;&#x540C;&#x6837;&#x662F;&#x6B63;&#x786E;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x9610;&#x660E;&#x4E86;&#x51FA;&#x5728;&#x4E0D;&#x540C;&#x6750;&#x6599;&#x4E2D;&#x989C;&#x8272;&#x7684;&#x884C;&#x4E3A;&#x3002;&#x725B;&#x987F;&#x63CF;&#x8FF0;&#x4ED6;&#x7684;&#x5149;&#x8C31;&#x989C;&#x8272;&#x5982;&#x4F55;&#x5408;&#x6210;&#x51FA;&#x5305;&#x62EC;&#x767D;&#x8272;&#x5728;&#x5185;&#x7684;&#x5927;&#x90E8;&#x5206;&#x53EF;&#x89C1;&#x989C;&#x8272;&#xFF0C;&#x800C;&#x4E14;&#x8FD9;&#x662F;&#x6B63;&#x786E;&#x7684;&#x56E0;&#x4E3A;&#x5149;&#x7EBF;&#x4EE5;&#x53E0;&#x52A0;&#x7684;&#x65B9;&#x5F0F;&#x6DF7;&#x5408;&#xFF1A;&#x7EC4;&#x5408;&#x4E0D;&#x540C;&#x989C;&#x8272;&#x7684;&#x5149;&#x7EBF;&#x80FD;&#x591F;&#x6700;&#x540E;&#x5F97;&#x51FA;&#x767D;&#x5149;&#x3002;&#x6B4C;&#x5FB7;&#x63CF;&#x8FF0;&#x4ED6;&#x7684;&#x4E09;&#x539F;&#x8272;&#x5982;&#x4F55;&#x6DF7;&#x5408;&#x51FA;&#x5305;&#x62EC;&#x9ED1;&#x8272;&#x5728;&#x5185;&#x7684;&#x5927;&#x90E8;&#x5206;&#x989C;&#x8272;&#xFF0C;&#x800C;&#x4E14;&#x8FD9;&#x662F;&#x6B63;&#x786E;&#x7684;&#x56E0;&#x4E3A;&#x8272;&#x7D20;&#x4EE5;&#x51CF;&#x6CD5;&#x7684;&#x65B9;&#x5F0F;&#x6DF7;&#x5408;:&#x4EE5;&#x4E0D;&#x540C;&#x989C;&#x8272;&#x6DF7;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x901A;&#x8FC7;&#x51CF;&#x5C11;&#x5149;&#x6CE2;&#xFF0C;&#x6700;&#x7EC8;&#x5F97;&#x51FA;&#x9ED1;&#x8272;&#x989C;&#x6599;&#x3002;</p>
<p><img src="https://www.programmingdesignsystems.com/assets/color/a-short-history-of-color-theory/additive.svg" alt="RGB&#x53E0;&#x52A0;&#x989C;&#x8272;&#x6DF7;&#x5408;"></p>
<p><img src="https://www.programmingdesignsystems.com/assets/color/a-short-history-of-color-theory/subtractive.svg" alt="CMY&#x51CF;&#x5C11;&#x989C;&#x8272;&#x6DF7;&#x5408;"></p>
<p>&#x5728;&#x4E3A;&#x989C;&#x8272;&#x521B;&#x5EFA;&#x7EDF;&#x4E00;&#x8868;&#x793A;&#x6CD5;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x50CF;&#x6211;&#x4EEC;&#x4ECE;&#x4E50;&#x8C31;&#x4E2D;&#x77E5;&#x9053;&#x7684;&#x90A3;&#x6837;-&#x827A;&#x672F;&#x5BB6;&#x5F88;&#x5FEB;&#x5C31;&#x5F00;&#x59CB;&#x5C06;&#x8272;&#x8C31;&#x63CF;&#x7ED8;&#x6210;&#x4E09;&#x7EF4;&#x7ACB;&#x4F53;&#x3002;&#x4ECE;&#x6258;&#x62DC;&#x5384;&#x65AF;&#xB7;&#x6885;&#x5C14;&#x7684;&#x8272;&#x5F69;&#x4E09;&#x89D2;&#x4E2D;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x76F8;&#x5173;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x51FA;&#x81EA;1775&#x5E74;&#x51FA;&#x7248;&#x7684;&#x300A;&#x8272;&#x5F69;&#x8BC4;&#x8BBA;&#x7684;&#x4EB2;&#x548C;&#x529B;&#x300B;&#x4E00;&#x4E66;&#x4E2D;&#x3002;&#x8FC8;&#x5C14;&#x5BFB;&#x6C42;&#x7CBE;&#x786E;&#x5730;&#x5B9A;&#x4E49;&#x4EBA;&#x773C;&#x80FD;&#x770B;&#x5230;&#x7684;&#x989C;&#x8272;&#x6570;&#x91CF;&#xFF0C;&#x8FD9;&#x8981;&#x6C42;&#x4ED6;&#x589E;&#x52A0;&#x53E6;&#x4E00;&#x4E2A;&#x7EAC;&#x5EA6;&#x53BB;&#x8868;&#x793A;&#x5404;&#x79CD;&#x989C;&#x8272;&#x4EAE;&#x5EA6;&#x53D8;&#x5316;&#x3002;&#x6885;&#x5C14;&#x7528;&#x4F20;&#x7EDF;&#x7ED8;&#x753B;&#x4E2D;&#x7684;&#x4E09;&#x539F;&#x8272;&#xFF08;&#x7EA2;&#x3001;&#x9EC4;&#x3001;&#x84DD;&#xFF09;&#x6765;&#x7ED8;&#x5236;&#x4E09;&#x89D2;&#x5F62;&#x7684;&#x89D2;&#xFF0C;&#x5E76;&#x4E14;&#x901A;&#x8FC7;&#x5C06;&#x76F8;&#x53CD;&#x7684;&#x989C;&#x8272;&#x6DF7;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x8FDE;&#x63A5;&#x8FD9;&#x4E9B;&#x89D2;&#x3002;&#x4E0E;&#x4F20;&#x7EDF;&#x7684;&#x8272;&#x73AF;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x662F;&#xFF0C;&#x4ED6;&#x901A;&#x8FC7;&#x5C06;&#x4E0D;&#x540C;&#x4EAE;&#x5EA6;&#x7684;&#x4E09;&#x89D2;&#x5F62;&#x6765;&#x5806;&#x53E0;&#x5728;&#x5F7C;&#x6B64;&#x7684;&#x9876;&#x90E8;&#x6765;&#x521B;&#x9020;&#x8BB8;&#x591A;&#x4E09;&#x89D2;&#x5F62;&#x7684;&#x53D8;&#x4F53;&#x3002;&#x8FD9;&#x8BA9;&#x901A;&#x8FC7;&#x5728;&#x4E09;&#x7EF4;&#x7A7A;&#x95F4;&#x4E2D;&#x81EA;&#x8EAB;&#x4F4D;&#x7F6E;&#x6765;&#x5B9A;&#x4E49;&#x989C;&#x8272;&#x6210;&#x4E3A;&#x4E86;&#x53EF;&#x80FD;&#xFF0C;&#x76F4;&#x81F3;&#x4ECA;&#x65E5;&#x8BE5;&#x6280;&#x672F;&#x4ECD;&#x5728;&#x4F7F;&#x7528;&#x3002;&#x6885;&#x5C14;&#x6700;&#x7EC8;&#x672A;&#x80FD;&#x6784;&#x89C6;&#x89C9;&#x5747;&#x5300;&#x6B65;&#x5E45;&#x7684;&#x8272;&#x5F69;&#x6A21;&#x578B;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4E0D;&#x4E86;&#x89E3;&#x4EBA;&#x773C;&#x7684;&#x4E0D;&#x89C4;&#x5219;&#x6027;&#x3002;</p>
<p><img src="https://www.programmingdesignsystems.com/assets/color/a-short-history-of-color-theory/mayer-color-triangles.jpg" alt="&#x6258;&#x62DC;&#x5384;&#x65AF;.&#x6885;&#x5C14;&#x8272;&#x5F69;&#x4E09;&#x89D2;"></p>
<p>&#x5FB7;&#x56FD;&#x753B;&#x5BB6;&#x83F2;&#x5229;&#x666E;.&#x5965;&#x6258;.&#x4F26;&#x683C;&#x5728;&#x4ED6;&#x521B;&#x5EFA;&#x7403;&#x5F62;&#x8272;&#x8C31;&#x8868;&#x793A;&#x6CD5;&#x65F6;&#x4F7F;&#x7528;&#x4E86;&#x540C;&#x6837;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;1810&#x5E74;&#x53D1;&#x8868;&#x5728;&#x4ED6;&#x7684;&#x300A;&#x8272;&#x5F69;&#x7403;&#x4F53;&#x300B;&#x624B;&#x7A3F;&#x4E2D;&#x3002;&#x4F26;&#x683C;&#x7684;&#x7403;&#x4F53;&#x62E5;&#x6709;&#x767D;&#x8272;&#x548C;&#x9ED1;&#x8272;&#x6781;&#xFF0C;&#x4E24;&#x7EA7;&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x8272;&#x5E26;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x548C;&#x4E4B;&#x524D;&#x5176;&#x4ED6;&#x7684;&#x989C;&#x8272;&#x8868;&#x793A;&#x6CD5;&#x4E00;&#x6837;&#xFF0C;&#x8BE5;&#x6A21;&#x578B;&#x672A;&#x80FD;&#x533A;&#x5206;&#x4EAE;&#x5EA6;&#x548C;&#x9971;&#x548C;&#x5EA6;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5F97;&#x5230;&#x7684;&#x6A21;&#x578B;&#x5728;&#x989C;&#x8272;&#x5F3A;&#x5EA6;&#x4E0A;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#x53D8;&#x5316;&#x3002;&#x8FD9;&#x4E2A;&#x7403;&#x5F62;&#x62E5;&#x6709;&#x548C;&#x6885;&#x5C14;&#x4E09;&#x89D2;&#x540C;&#x6837;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x6B65;&#x5E45;&#x5E76;&#x4E0D;&#x89C6;&#x89C9;&#x5747;&#x5300;&#x3002;</p>
<p><img src="https://www.programmingdesignsystems.com/assets/color/a-short-history-of-color-theory/runge-color-sphere.jpg" alt="&#x83F2;&#x5229;&#x666E;.&#x5965;&#x6258;.&#x4F26;&#x683C;&#x7684;&#x8272;&#x5F69;&#x7403;&#x4F53;"></p>
<p>&#x7C73;&#x6B47;&#x5C14;&#xB7;&#x6B27;&#x4EC1;&#xB7;&#x8C22;&#x5F17;&#x52D2;&#x5C14;&#x4ECE;1839&#x5E74;&#x5F00;&#x59CB;&#x5C31;&#x5C1D;&#x8BD5;&#x5728;&#x4ED6;&#x7684;&#x534A;&#x7403;&#x8272;&#x5F69;&#x7CFB;&#x7EDF;&#x4E2D;&#x53BB;&#x4FEE;&#x6B63;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x4ED6;&#x6CA1;&#x6709;&#x901A;&#x8FC7;&#x5173;&#x6CE8;&#x6240;&#x7528;&#x989C;&#x6599;&#x7684;&#x989C;&#x8272;&#x6765;&#x6DF7;&#x8272;&#x989C;&#x8272;&#xFF0C;&#x800C;&#x662F;&#x6839;&#x636E;&#x611F;&#x77E5;&#x4E0A;&#x770B;&#x4F3C;&#x6B63;&#x786E;&#x7684;&#x6DF7;&#x5408;&#x7269;&#x6765;&#x9009;&#x62E9;&#x3002;&#x7075;&#x611F;&#x6765;&#x81EA;&#x4E8E;&#x6B4C;&#x5FB7;&#x7684;&#x4F5C;&#x54C1;&#xFF0C;&#x8C22;&#x5F17;&#x52D2;&#x5C14;&#x4F7F;&#x7528;&#x540E;&#x50CF;&#x6765;&#x6D4B;&#x8BD5;&#x4ED6;&#x6DF7;&#x5408;&#x7269;&#x7684;&#x6709;&#x6548;&#x6027;&#x3002;&#x5F53;&#x4E00;&#x4E2A;&#x4EBA;&#x957F;&#x65F6;&#x95F4;&#x51DD;&#x89C6;&#x5728;&#x4E00;&#x4E2A;&#x7EFF;&#x8272;&#x65B9;&#x5757;&#x4E0A;&#x7136;&#x540E;&#x671B;&#x7740;&#x4E00;&#x9762;&#x767D;&#x5899;&#xFF0C;&#x4E00;&#x4E2A;&#x7EA2;&#x8272;&#x7684;&#x65B9;&#x5757;&#x5C31;&#x4F1A;&#x51FA;&#x73B0;&#x3002;&#x90A3;&#x662F;&#x7531;&#x4E8E;&#x773C;&#x775B;&#x4E2D;&#x7EFF;&#x8272;&#x5149;&#x53D7;&#x4F53;&#x7684;&#x75B2;&#x52B3;&#x9020;&#x6210;&#x7684;&#xFF0C;&#x8C22;&#x5F17;&#x52D2;&#x5C14;&#x5229;&#x7528;&#x8FD9;&#x70B9;&#x5728;&#x4ED6;&#x7684;&#x6A21;&#x578B;&#x4E2D;&#x5EFA;&#x7ACB;&#x4E86;&#x4E92;&#x8865;&#x8272;&#x3002;</p>
<p><img src="https://www.programmingdesignsystems.com/assets/color/a-short-history-of-color-theory/chevreul-color-sphere.jpg" alt="&#x7C73;&#x6B47;&#x5C14;&#xB7;&#x6B27;&#x4EC1;&#xB7;&#x8C22;&#x5F17;&#x52D2;&#x5C14;&#x8272;&#x5F69;&#x7403;&#x4F53;"></p>
<p>20&#x4E16;&#x7EAA;&#x521D;&#xFF0C;&#x7F8E;&#x56FD;&#x753B;&#x5BB6;&#x963F;&#x5C14;&#x4F2F;&#x7279;.&#x4EA8;&#x5229;.&#x8292;&#x585E;&#x5C14;&#x521B;&#x9020;&#x4E86;&#x5386;&#x53F2;&#x4E0A;&#x6700;&#x91CD;&#x8981;&#x4E4B;&#x4E00;&#x7684;&#x8272;&#x7ACB;&#x4F53;&#x3002;&#x50CF;&#x4ED6;&#x4E4B;&#x524D;&#x7684;&#x524D;&#x8F88;&#x4E00;&#x6837;&#xFF0C;&#x8292;&#x585E;&#x5C14;&#x60F3;&#x8981;&#x521B;&#x9020;&#x4E00;&#x4E2A;&#x89C6;&#x89C9;&#x5747;&#x5300;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x5C3D;&#x7BA1;&#x4ED6;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x753B;&#x5BB6;&#xFF0C;&#x4ED6;&#x7684;&#x65B9;&#x6CD5;&#x5341;&#x5206;&#x79D1;&#x5B66;&#xFF1A;&#x4ED6;&#x7528;&#x4EBA;&#x4F53;&#x5B9E;&#x9A8C;&#x5BF9;&#x8C61;&#x548C;&#x4ED6;&#x53D1;&#x660E;&#x4E86;&#x4E00;&#x4E9B;&#x5217;&#x673A;&#x68B0;&#x4EEA;&#x5668;&#x6765;&#x521B;&#x9020;&#x4E00;&#x4E2A;&#x5341;&#x5206;&#x7CBE;&#x51C6;&#x7684;&#x6A21;&#x578B;&#x3002;&#x4E00;&#x4E2A;&#x5173;&#x4E8E;&#x8292;&#x585E;&#x5C14;&#x8272;&#x5F69;&#x7CFB;&#x7EDF;&#x7684;&#x91CD;&#x8981;&#x7EC6;&#x8282;&#x662F;&#xFF0C;&#x4ED6;&#x628A;&#x8272;&#x5F69;&#x7A7A;&#x95F4;&#x5212;&#x5206;&#x5230;&#x4E09;&#x4E2A;&#x65B0;&#x7684;&#x7EAC;&#x5EA6;&#x3002;&#x8272;&#x8C03;&#x51B3;&#x5B9A;&#x4E86;&#x989C;&#x8272;&#x7684;&#x7C7B;&#x578B;&#xFF08;&#x7EA2;&#xFF0C;&#x84DD;&#x7B49;&#xFF09;&#xFF0C;&#x503C;&#x51B3;&#x5B9A;&#x989C;&#x8272;&#x7684;&#x4EAE;&#x5EA6;&#xFF08;&#x4EAE;&#x6216;&#x6697;&#xFF09;&#xFF0C;&#x8272;&#x5EA6;&#x51B3;&#x5B9A;&#x989C;&#x8272;&#x7684;&#x9971;&#x548C;&#x5EA6;&#xFF08;&#x989C;&#x8272;&#x7684;&#x7EAF;&#x5EA6;&#xFF09;&#x3002;&#x76F4;&#x81F3;&#x4ECA;&#x5929;&#xFF0C;&#x5728;RGB&#x989C;&#x8272;&#x6A21;&#x578B;&#x7684;&#x4E00;&#x4E9B;&#x8868;&#x793A;&#x4E2D;&#x4ECD;&#x7136;&#x5728;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x7EAC;&#x5EA6;&#x3002;</p>
<p><img src="https://www.programmingdesignsystems.com/assets/color/a-short-history-of-color-theory/munsell-color-tree.jpg" alt="1943&#x5E74;&#x91CD;&#x4FEE;&#x7684;&#x53EF;&#x89C6;&#x5316;&#x963F;&#x5C14;&#x4F2F;&#x7279;&#xB7;&#x4EA8;&#x5229;&#xB7;&#x8292;&#x585E;&#x5C14;&#x8272;&#x5F69;&#x6811;"></p>
<p>&#x8292;&#x585E;&#x5C14;&#x4E00;&#x5F00;&#x59CB;&#x5C1D;&#x8BD5;&#x5C06;&#x4ED6;&#x7684;&#x989C;&#x8272;&#x6392;&#x5217;&#x5728;&#x7403;&#x4F53;&#x5185;&#xFF0C;&#x4F46;&#x9996;&#x5148;&#x6307;&#x51FA;&#xFF0C;&#x201C;&#x60F3;&#x8981;&#x7B26;&#x5408;&#x9009;&#x7684;&#x8F6E;&#x5ED3;&#x7EBF;&#xFF0C;&#x5982;&#x91D1;&#x5B57;&#x5854;&#x3001;&#x9525;&#x4F53;&#x6216;&#x7ACB;&#x65B9;&#x4F53;&#xFF0C;&#x52A0;&#x4E0A;&#x7F3A;&#x4E4F;&#x9002;&#x5F53;&#x7684;&#x6D4B;&#x8BD5;&#xFF0C;&#x5BFC;&#x81F4;&#x4E86;&#x8BB8;&#x591A;&#x8272;&#x5F69;&#x5173;&#x7CFB;&#x7684;&#x6B6A;&#x66F2;&#x9648;&#x8FF0;&#x201D;&#x3002;&#x5B9E;&#x8D28;&#x4E0A;&#xFF0C;&#x8292;&#x585E;&#x5C14;&#x610F;&#x8BC6;&#x5230;&#x4ED6;&#x7684;&#x8272;&#x7ACB;&#x4F53;&#x9700;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x4E0D;&#x89C4;&#x5219;&#x5F62;&#x72B6;&#x6765;&#x9002;&#x914D;&#x4ED6;&#x7684;&#x989C;&#x8272;&#x3002;&#x5BF9;&#x6B64;&#x7684;&#x89E3;&#x91CA;&#x53EF;&#x662F;&#x76F8;&#x5F53;&#x7B80;&#x5355;&#x3002;&#x4F4E;&#x4EAE;&#x5EA6;&#x7684;&#x989C;&#x8272;&#x5728;&#x4ECB;&#x4E4E;0&#x5230;&#x5B8C;&#x5168;&#x9971;&#x548C;&#x4E4B;&#x95F4;&#x5177;&#x6709;&#x66F4;&#x5C11;&#x7684;&#x53EF;&#x89C1;&#x989C;&#x8272;&#x3002;&#xFF08;0&#x4EAE;&#x5EA6;&#x989C;&#x8272;&#x53EA;&#x6709;&#x4E00;&#x79CD;&#xFF0C;&#x9ED1;&#x8272;&#xFF09;&#x540C;&#x6837;&#x5730;&#xFF0C;&#x6709;&#x4E9B;&#x8272;&#x5F69;&#x6BD4;&#x8D77;&#x5176;&#x4ED6;&#x5177;&#x6709;&#x66F4;&#x5E7F;&#x7684;&#x8303;&#x56F4;&#x3002;&#x6BD4;&#x8D77;&#x9EC4;&#x8272;&#x4E0E;&#x767D;&#x8272;&#x4E4B;&#x95F4;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x7EA2;&#x8272;&#x4E0E;&#x767D;&#x8272;&#x4E4B;&#x95F4;&#x6DF7;&#x5408;&#x66F4;&#x591A;&#x7684;&#x53EF;&#x89C1;&#x989C;&#x8272;&#xFF0C;&#x56E0;&#x4E3A;&#x9EC4;&#x8272;&#x662F;&#x6700;&#x4EAE;&#x7684;&#x989C;&#x8272;&#x3002;&#x8292;&#x585E;&#x5C14;&#x989C;&#x8272;&#x7CFB;&#x7EDF;&#x4E2D;&#x53E6;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7EC6;&#x8282;&#x662F;&#x4ED6;&#x66F4;&#x559C;&#x6B22;&#x4F7F;&#x7528;&#x6570;&#x5B66;&#x8BED;&#x6CD5;&#x800C;&#x4E0D;&#x662F;&#x989C;&#x8272;&#x540D;&#x79F0;&#x6765;&#x6307;&#x793A;&#x989C;&#x8272;&#x5728;&#x989C;&#x8272;&#x7A7A;&#x95F4;&#x4E2D;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x8FD9;&#x4E0E;&#x5F53;&#x4ECA;&#x6211;&#x4EEC;&#x7528;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x6765;&#x5B9A;&#x4E49;&#x989C;&#x8272;&#x6CA1;&#x4EC0;&#x4E48;&#x4E0D;&#x540C;&#x3002;&#x8292;&#x585E;&#x5C14;&#x989C;&#x8272;&#x7CFB;&#x7EDF;&#x62E5;&#x6709;&#x81EA;&#x8EAB;&#x7684;&#x7F3A;&#x9677;&#x4E0E;&#x4E0D;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x4F46;&#x5B83;&#x4EE5;&#x4E0E;&#x4EE5;&#x5F80;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x5F0F;&#x67B6;&#x8D77;&#x4E86;&#x827A;&#x672F;&#x4E0E;&#x79D1;&#x5B66;&#x7684;&#x6865;&#x6881;&#xFF0C;&#x5E76;&#x4E14;&#x5B83;&#x4ECD;&#x7136;&#x662F;&#x8BB8;&#x591A;&#x7F8E;&#x672F;&#x5B66;&#x9662;&#x8BFE;&#x7A0B;&#x7684;&#x57FA;&#x7840;&#x3002;</p>
<p>&#x5728;20&#x4E16;&#x7EAA;&#x65E9;&#x671F;&#x8BB8;&#x591A;&#x6B27;&#x6D32;&#x827A;&#x672F;&#x8FD0;&#x52A8;&#x5BF9;&#x827A;&#x672F;&#x7684;&#x4E3B;&#x89C2;&#x4F53;&#x9A8C;&#x6709;&#x7740;&#x6D53;&#x539A;&#x7684;&#x5174;&#x8DA3;&#xFF0C;&#x800C;&#x4E14;&#x5C3D;&#x7BA1;&#x5FB7;&#x56FD;&#x7684;&#x5305;&#x8C6A;&#x65AF;&#x5B66;&#x9662;&#x662F;&#x4E00;&#x6240;&#x91CD;&#x89C6;&#x827A;&#x672F;&#x3001;&#x8BBE;&#x8BA1;&#x548C;&#x5EFA;&#x7B51;&#x7684;&#x73B0;&#x4EE3;&#x65B9;&#x6CD5;&#x5B66;&#x6821;&#xFF0C;&#x4F46;&#x5305;&#x8C6A;&#x65AF;&#x5B66;&#x9662;&#x7684;&#x6559;&#x5E08;&#x4EEC;&#x64B0;&#x5199;&#x4E86;&#x4E24;&#x672C;&#x5173;&#x4E8E;&#x8272;&#x5F69;&#x548C;&#x611F;&#x77E5;&#x7684;&#x91CD;&#x8981;&#x8457;&#x4F5C;&#xFF1A;&#x7EA6;&#x7FF0;&#x5185;&#x65AF;&#x4F0A;&#x85E4;&#x6240;&#x5199;&#x7684;&#x300A;&#x989C;&#x8272;&#x7684;&#x827A;&#x672F;&#x300B;&#x548C;&#x7EA6;&#x745F;&#x592B;&#x963F;&#x5C14;&#x4F2F;&#x65AF;&#x6240;&#x5199;&#x7684;&#x300A;&#x989C;&#x8272;&#x7684;&#x4EA4;&#x4E92;&#x300B;&#x3002;</p>
<p>&#x4F5C;&#x4E3A;&#x9A6C;&#x624E;&#x5179;&#x5357;&#x5B97;&#x6559;&#x7684;&#x8FFD;&#x968F;&#x8005;&#xFF0C;&#x4F0A;&#x85E4;&#x7684;&#x827A;&#x672F;&#x89C2;&#x70B9;&#x6DF1;&#x53D7;&#x5176;&#x7CBE;&#x795E;&#x4FE1;&#x4EF0;&#x7684;&#x5F71;&#x54CD;&#x3002;&#x9075;&#x4ECE;&#x4E25;&#x683C;&#x7684;&#x7D20;&#x98DF;&#xFF0C;&#x4ED6;&#x4EE5;&#x4E0E;&#x5B66;&#x751F;&#x8FDB;&#x884C;&#x6709;&#x8282;&#x594F;&#x7684;&#x547C;&#x5438;&#x7EC3;&#x4E60;&#x800C;&#x95FB;&#x540D;&#xFF0C;&#x76EE;&#x7684;&#x662F;&#x4E3A;&#x4E86;&#x8BA9;&#x5B66;&#x6821;&#x5145;&#x5206;&#x53D1;&#x6325;&#x4ED6;&#x4EEC;&#x7684;&#x521B;&#x9020;&#x6F5C;&#x80FD;&#x3002;&#x5728;&#x4ED6;&#x601D;&#x60F3;&#x4E2D;&#xFF0C;&#x5C31;&#x50CF;&#x6B4C;&#x5FB7;&#x4E00;&#x6837;&#xFF0C;&#x8272;&#x5F69;&#x7684;&#x4E3B;&#x89C2;&#x4F53;&#x9A8C;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x4ED6;&#x7684;&#x4E66;&#x5173;&#x6CE8;&#x7684;&#x662F;&#x5982;&#x4F55;&#x7ED3;&#x5408;&#x989C;&#x8272;&#x6765;&#x5524;&#x8D77;&#x89C2;&#x4F17;&#x7684;&#x611F;&#x53D7;&#x3002;&#x4F0A;&#x85E4;&#x5DE5;&#x4F5C;&#x7684;&#x6838;&#x5FC3;&#x601D;&#x60F3;&#x662F;&#x827A;&#x672F;&#x5BB6;&#x5FC5;&#x987B;&#x638C;&#x63E1;&#x4E03;&#x79CD;&#x989C;&#x8272;&#x7684;&#x5BF9;&#x6BD4;&#xFF0C;&#x4EE5;&#x4FBF;&#x4E86;&#x89E3;&#x5176;&#x989C;&#x8272;&#x9009;&#x62E9;&#x7684;&#x6548;&#x679C;&#x3002;&#x5176;&#x4E2D;&#x4E00;&#x4E9B;&#x5BF9;&#x6BD4;&#x8272;&#x6BD4;&#x8F83;&#x7B80;&#x5355;&#xFF0C;&#x5982;&#x5F53;&#x4E0D;&#x540C;&#x4EAE;&#x5EA6;&#x7684;&#x989C;&#x8272;&#x5F7C;&#x6B64;&#x76F8;&#x90BB;&#x65F6;&#x5B58;&#x5728;&#x4EAE;&#x4E0E;&#x6697;&#x7684;&#x5BF9;&#x6BD4;&#xFF0C;&#x6216;&#x5F53;&#x4E0D;&#x540C;&#x8272;&#x8C03;&#x7684;&#x989C;&#x8272;&#x4F7F;&#x7528;&#x5728;&#x4E00;&#x8D77;&#x65F6;&#x5C31;&#x80FD;&#x770B;&#x89C1;&#x8272;&#x8C03;&#x7684;&#x5BF9;&#x6BD4;&#x3002;&#x6709;&#x62B1;&#x8D1F;&#x7684;&#x8BBE;&#x8BA1;&#x5E08;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x7528;&#x8FD9;&#x4E9B;&#x89C2;&#x5BDF;&#x7ED3;&#x679C;&#x6765;&#x6307;&#x5BFC;&#x6709;&#x5173;&#x989C;&#x8272;&#x7684;&#x51B3;&#x7B56;,&#x6B63;&#x5982;&#x4ED6;&#x4EEC;&#x7ED9;&#x6211;&#x4EEC;&#x63D0;&#x4F9B;&#x4E00;&#x79CD;&#x9014;&#x5F84;&#x53BB;&#x5206;&#x7C7B;&#x989C;&#x8272;&#x5E76;&#x7CFB;&#x7EDF;&#x5730;&#x8003;&#x8651;&#x5B83;&#x4EEC;&#x7684;&#x4F7F;&#x7528;&#x3002;&#x4F0A;&#x85E4;&#x751A;&#x81F3;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x4E0E;&#x6717;&#x683C;&#x975E;&#x5E38;&#x76F8;&#x4F3C;&#x7684;RYB&#x7403;&#x4F53;&#x6765;&#x5E2E;&#x52A9;&#x89E3;&#x91CA;&#x8FD9;&#x4E9B;&#x60F3;&#x6CD5;&#x3002;&#x4F0A;&#x85E4;&#x7684;&#x5176;&#x4ED6;&#x5BF9;&#x6BD4;&#x8272;&#x770B;&#x8D77;&#x6765;&#x5C31;&#x76F8;&#x5F53;&#x4E3B;&#x89C2;&#x6027;&#x4E86;&#xFF0C;&#x5982;&#x4ED6;&#x7684;&#x540C;&#x65F6;&#x5BF9;&#x6BD4;&#x5B9A;&#x5F8B;&#xFF0C;&#x5B83;&#x8BF4;&#x660E;&#x5F53;&#x67D0;&#x4E9B;&#x989C;&#x8272;&#x4E00;&#x8D77;&#x4F7F;&#x7528;&#x65F6;&#x662F;&#x5982;&#x4F55;&#x4EA7;&#x751F;&#x89C6;&#x89C9;&#x6548;&#x679C;&#x7684;&#x3002;&#x4F0A;&#x85E4;&#x7ECF;&#x5E38;&#x7528;&#x81EA;&#x5DF1;&#x4E3B;&#x89C2;&#x7ECF;&#x9A8C;&#x6765;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x5173;&#x4E8E;&#x989C;&#x8272;&#x548C;&#x611F;&#x77E5;&#x7684;&#x5E7F;&#x4E49;&#x7406;&#x8BBA;&#xFF0C;&#x5982;&#x4E0B;&#x9762;&#x5F15;&#x6587;&#x6240;&#x793A;&#x3002;</p>
<blockquote>
<p>&#x7136;&#x800C;&#xFF0C;&#x5BF9;&#x4E8E;&#x5927;&#x591A;&#x95EE;&#x9898;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#xFF0C;&#x5BA2;&#x89C2;&#x7684;&#x8003;&#x8651;&#x591A;&#x4F59;&#x4E3B;&#x89C2;&#x7684;&#x504F;&#x597D;&#x3002;&#x56E0;&#x6B64;&#x8089;&#x7C7B;&#x5E02;&#x573A;&#x53EF;&#x4EE5;&#x7528;&#x6D45;&#x7EFF;&#x8272;&#x548C;&#x84DD;&#x7EFF;&#x8272;&#x8C03;&#x6765;&#x88C5;&#x9970;&#xFF0C;&#x8FD9;&#x6837;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x8089;&#x770B;&#x8D77;&#x6765;&#x5C31;&#x4F1A;&#x66F4;&#x65B0;&#x9C9C;&#x66F4;&#x7EA2;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x5546;&#x4E1A;&#x827A;&#x672F;&#x5BB6;&#x8981;&#x4E3A;&#x5496;&#x5561;&#x8BBE;&#x8BA1;&#x4E00;&#x4E2A;&#x5E26;&#x9EC4;&#x8272;&#x548C;&#x767D;&#x8272;&#x6761;&#x7EB9;&#x7684;&#x5305;&#x88C5;&#xFF0C;&#x6216;&#x8005;&#x4E3A;&#x610F;&#x5927;&#x5229;&#x9762;&#x8BBE;&#x8BA1;&#x4E00;&#x4E2A;&#x5E26;&#x84DD;&#x8272;&#x5706;&#x70B9;&#x7684;&#x5305;&#x88C5;&#xFF0C;&#x90A3;&#x4E48;&#x4ED6;&#x5C31;&#x9519;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x5F62;&#x5F0F;&#x548C;&#x989C;&#x8272;&#x7279;&#x5F81;&#x90FD;&#x4E0E;&#x4E3B;&#x9898;&#x76F8;&#x51B2;&#x7A81;&#x3002;</p>
</blockquote>
<p>&#x8FD9;&#x91CC;&#xFF0C;&#x4F0A;&#x85E4;&#x5BF9;&#x8C03;&#x8272;&#x677F;&#x7684;&#x4E2A;&#x4EBA;&#x504F;&#x597D;&#x53D8;&#x6210;&#x4E86;&#x5BF9;&#x989C;&#x8272;&#x4E0E;&#x4E3B;&#x9898;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x4E25;&#x683C;&#x6982;&#x62EC;&#x3002;&#x8C01;&#x8BF4;&#x9EC4;&#x8272;&#x6761;&#x7EB9;&#x548C;&#x84DD;&#x8272;&#x5706;&#x70B9;&#x4E0D;&#x80FD;&#x6709;&#x6548;&#x5730;&#x7528;&#x4E8E;&#x98DF;&#x54C1;&#x6807;&#x7B7E;&#x7684;&#x8BBE;&#x8BA1;&#x3002;</p>
<p>&#x7EA6;&#x745F;&#x592B;&#x963F;&#x5C14;&#x4F2F;&#x65AF;&#xFF0C;&#x5728;&#x4F0A;&#x85E4;&#x5728;&#x5305;&#x8C6A;&#x65AF;&#x5B66;&#x9662;&#x7684;&#x5B66;&#x751F;&#xFF0C;&#x4ECE;1963&#x5E74;&#x5F00;&#x59CB;&#xFF0C;&#x5728;&#x4ED6;&#x300A;&#x8272;&#x5F69;&#x7684;&#x4EA4;&#x4E92;&#x300B;&#x4E2D;&#x91C7;&#x7528;&#x4E86;&#x4E00;&#x79CD;&#x66F4;&#x5177;&#x8BF4;&#x660E;&#x6027;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x7528;&#x4E0D;&#x900F;&#x660E;&#x7684;&#x8272;&#x7EB8;&#xFF0C;&#x963F;&#x5C14;&#x4F2F;&#x65AF;&#x5F00;&#x59CB;&#x5C55;&#x793A;&#x8272;&#x5F69;&#x7684;&#x9AD8;&#x5EA6;&#x52A8;&#x6001;&#x6027;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x4EBA;&#x7C7B;&#x5982;&#x4F55;&#x6839;&#x636E;&#x5468;&#x8FB9;&#x989C;&#x8272;&#x6765;&#x611F;&#x77E5;&#x989C;&#x8272;&#x7684;&#x3002;&#x800C;&#x4E0D;&#x662F;&#x8BD5;&#x56FE;&#x5EFA;&#x7ACB;&#x4E00;&#x4E9B;&#x5173;&#x4E8E;&#x989C;&#x8272;&#x4E3A;&#x4F55;&#x5982;&#x6B64;&#x7684;&#x7EDF;&#x4E00;&#x7406;&#x8BBA;&#x3002;&#x963F;&#x5C14;&#x4F2F;&#x65AF;&#x63CF;&#x8FF0;&#x5B66;&#x751F;&#x5982;&#x4F55;&#x91CD;&#x590D;&#x8FD9;&#x4E9B;&#x5B9E;&#x9A8C;&#x6765;&#x4EB2;&#x8EAB;&#x4F53;&#x9A8C;&#x3002;&#x8FD9;&#x4EE4;&#x300A;&#x8272;&#x5F69;&#x7684;&#x4EA4;&#x4E92;&#x300B;&#x4E00;&#x4E66;&#x5728;&#x8272;&#x5F69;&#x6784;&#x6210;&#x4E2D;&#x6210;&#x4E3A;&#x6700;&#x91CD;&#x8981;&#x548C;&#x6700;&#x7ECF;&#x5F97;&#x8D77;&#x65F6;&#x95F4;&#x8003;&#x9A8C;&#x7684;&#x4E66;&#x7C4D;&#x4E4B;&#x4E00;&#x3002;&#x4E0B;&#x56FE;&#x662F;&#x4ED6;&#x6700;&#x8457;&#x540D;&#x7684;&#x5B9E;&#x9A8C;&#x4E4B;&#x4E00;&#xFF0C;&#x5728;&#x5F69;&#x8272;&#x7684;&#x80CC;&#x666F;&#x4E0A;&#x6709;&#x4E24;&#x4E2A;&#x5C0F;&#x65B9;&#x5757;&#x3002;</p>
<p>&#x5982;&#x4E0A;&#x56FE;&#x6240;&#x793A;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x827A;&#x672F;&#x53F2;&#x5145;&#x6EE1;&#x4E86;&#x5173;&#x4E8E;&#x539F;&#x8272;&#x672C;&#x8D28;&#x7684;&#x4E89;&#x8BBA;,&#x8FD9;&#x5728;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x662F;&#x7531;&#x4E8E;&#x5BF9;&#x51CF;&#x6CD5;&#x548C;&#x52A0;&#x6CD5;&#x989C;&#x8272;&#x6A21;&#x578B;&#x7684;&#x6DF7;&#x6DC6;&#x9020;&#x6210;&#x7684;&#x3002;&#x4F17;&#x6240;&#x5468;&#x77E5;&#xFF0C;&#x5C06;&#x9EC4;&#x8272;&#x548C;&#x6DF1;&#x8272;&#x989C;&#x6599;&#x6DF7;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x662F;&#x5F88;&#x56F0;&#x96BE;&#x7684;,&#x8FD9;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x6B4C;&#x5FB7;&#x548C;&#x5176;&#x4ED6;&#x827A;&#x672F;&#x5BB6;&#x8BA4;&#x4E3A;&#x9EC4;&#x8272;&#x662F;&#x4E00;&#x79CD;&#x201C;&#x7EAF;&#x201D;&#x7684;&#x989C;&#x8272;&#xFF0C;&#x5176;&#x54C1;&#x8D28;&#x4E0E;&#x5176;&#x4ED6;&#x8272;&#x8C31;&#x4E0D;&#x540C;&#x3002;&#x4ECA;&#x5929;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#xFF0C;&#x539F;&#x8272;&#x7684;&#x6982;&#x5FF5;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x4E00;&#x4E2A;&#x76F8;&#x5F53;&#x968F;&#x610F;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x5E76;&#x4E14;&#x989C;&#x6599;&#x4E5F;&#x4E0D;&#x5B58;&#x5728;&#x201C;&#x7EAF;&quot;&#x539F;&#x8272;&#x3002;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x4EFB;&#x610F;&#x4E09;&#x79CD;&#x989C;&#x8272;&#x6765;&#x6DF7;&#x5408;&#x5149;&#x8C31;&#x7684;&#x5B50;&#x96C6;&#xFF0C;&#x867D;&#x7136;&#x4E00;&#x4E9B;&#x539F;&#x8272;&#x53EF;&#x4EE5;&#x6DF7;&#x5408;&#x66F4;&#x5E7F;&#x6CDB;&#x7684;&#x989C;&#x8272;&#xFF0C;&#x4F46;&#x4E0D;&#x53EF;&#x80FD;&#x5728;&#x51CF;&#x8272;&#x6CD5;&#x4E2D;&#x6DF7;&#x5408;&#x6574;&#x4E2A;&#x53EF;&#x89C1;&#x5149;&#x8C31;&#x3002;</p>
<blockquote>
<p>&#x7ED3;&#x8BBA;&#x662F;...&#x539F;&#x8272;&#x53EA;&#x662F;&#x4E00;&#x79CD;&#x6709;&#x6548;&#x7684;&#x675C;&#x64B0;&#xFF0C;&#x4ED6;&#x4EEC;&#x6216;&#x8005;&#x662F;&#x7531;&#x8272;&#x89C9;&#x6570;&#x636E;&#x6A21;&#x578B;&#x91C7;&#x7528;&#x7684;&#x5047;&#x8C61;&#x53D8;&#x91CF;&#xFF0C;&#x8981;&#x4E48;&#x662F;&#x4E0D;&#x5B8C;&#x7F8E;&#xFF0C;&#x4F46;&#x5728;&#x7528;&#x706F;&#x5149;&#x3001;&#x6CB9;&#x6F06;&#x3001;&#x71C3;&#x6599;&#x3001;&#x6CB9;&#x58A8;&#x6DF7;&#x5408;&#x7279;&#x5B9A;&#x989C;&#x8272;&#x65F6;&#xFF0C;&#x4ED6;&#x4EEC;&#x662F;&#x7ECF;&#x6D4E;&#x4E0A;&#x7684;&#x59A5;&#x534F;&#x3002; - &#x5E03;&#x9C81;&#x65AF;&#x9EA6;&#x514B;&#x6C83;&#x4F0A;</p>
</blockquote>
<p>&#x8FD9;&#x4E9B;&#x53D1;&#x73B0;&#x5DF2;&#x7ECF;&#x6DF1;&#x6DF1;&#x5730;&#x878D;&#x5165;&#x6211;&#x4EEC;&#x7684;&#x65E5;&#x5E38;&#x751F;&#x6D3B;&#x4E2D;&#x6240;&#x7528;&#x7684;&#x8BBE;&#x5907;&#x91CC;&#x3002;&#x684C;&#x9762;&#x6253;&#x5370;&#x673A;&#x7684;&#x5DE5;&#x4E1A;&#x6807;&#x51C6;&#x548C;&#x5176;&#x4ED6;&#x57FA;&#x4E8E;&#x989C;&#x6599;&#x7684;&#x5370;&#x5237;&#x673A;&#x5236;&#x4E0E;&#x51CF;&#x8272;&#x6DF7;&#x5408;&#x662F;&#x57FA;&#x4E8E;CMY&#x989C;&#x8272;&#x6A21;&#x578B;&#x7684;&#x4E09;&#x79CD;&#x989C;&#x8272;&#xFF1A;&#x9752;&#x8272;&#x3001;&#x54C1;&#x7EA2;&#x8272;&#x3001;&#x9EC4;&#x8272;&#x3002;&#x73B0;&#x5728;&#x5927;&#x5BB6;&#x90FD;&#x5F88;&#x6E05;&#x695A;&#xFF0C;&#x8FD9;&#x7EC4;&#x7279;&#x6B8A;&#x7684;&#x989C;&#x8272;&#x53EF;&#x4EE5;&#x7528;&#x58A8;&#x6C34;&#x6DF7;&#x5408;&#x51FA;&#x4E00;&#x4E2A;&#x53EF;&#x63A5;&#x53D7;&#x7684;&#x989C;&#x8272;&#x8303;&#x56F4;&#x3002;&#x6253;&#x5370;&#x673A;&#x4E5F;&#x6709;&#x9ED1;&#x8272;&#x58A8;&#x6C34;&#x662F;&#x56E0;&#x4E3A;&#x4E09;&#x539F;&#x8272;&#x4E0D;&#x80FD;&#x6DF7;&#x5408;&#x51FA;&#x771F;&#x6B63;&#x7684;&#x9ED1;&#x8272;&#x6765;&#xFF0C;&#x800C;&#x4E14;&#x5B83;&#x8FD8;&#x6709;&#x7740;&#x8282;&#x7701;&#x6602;&#x8D35;&#x5F69;&#x8272;&#x58A8;&#x6C34;&#x7684;&#x9644;&#x52A0;&#x4F18;&#x52BF;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x4E13;&#x4E1A;&#x6253;&#x5370;&#x673A;&#x6709;&#x7740;&#x66F4;&#x591A;&#x7684;&#x58A8;&#x76D2;&#x6765;&#x5448;&#x73B0;&#x66F4;&#x597D;&#x7684;&#x989C;&#x8272;&#x3002;&#x7231;&#x666E;&#x751F;&#xFF0C;&#x7535;&#x5B50;&#x6253;&#x5370;&#x6280;&#x672F;&#x7684;&#x9886;&#x519B;&#x8005;&#xFF0C;&#x5728;&#x4ED6;&#x7684;UltraChrome&#xAE; HDR&#x6280;&#x672F;&#x4E2D;&#x4F7F;&#x7528;&#x4E86;10&#x79CD;&#x5F69;&#x8272;&#x58A8;&#x6C34;&#x3002;</p>
<p>&#x7535;&#x8111;&#x5C4F;&#x5E55;&#x548C;&#x5176;&#x4ED6;&#x57FA;&#x4E8E;&#x52A0;&#x8272;&#x6DF7;&#x5408;&#x7684;&#x5149;&#x663E;&#x793A;&#x6280;&#x672F;&#x7684;&#x5DE5;&#x4E1A;&#x6807;&#x51C6;&#x662F;&#x57FA;&#x4E8E;RGB&#x989C;&#x8272;&#x6A21;&#x578B;&#xFF0C;&#x6BCF;&#x4E2A;&#x50CF;&#x7D20;&#x4E0A;&#x6709;&#x4E09;&#x4E2A;&#x4E09;&#x539F;&#x8272;&#xFF1A;&#x7EA2;&#x3001;&#x7EFF;&#x3001;&#x84DD;&#x3002;&#x8FD9;&#x4E09;&#x79CD;&#x989C;&#x8272;&#x6DF7;&#x5408;&#x4E00;&#x4E2A;&#x53EF;&#x89C6;&#x8272;&#x8C31;&#x7684;&#x53EF;&#x63A5;&#x53D7;&#x8303;&#x56F4;&#xFF0C;&#x8272;&#x5F69;&#x7684;&#x7CBE;&#x786E;&#x6570;&#x91CF;&#x53D6;&#x51B3;&#x4E8E;&#x5C4F;&#x5E55;&#x7684;&#x8D28;&#x91CF;&#xFF0C;&#x4F46;&#x4E5F;&#x4E0E;&#x7535;&#x8111;&#x7684;&#x663E;&#x5361;&#x6709;&#x5173;&#x3002;&#x4ECA;&#x5929;&#x4EFB;&#x4F55;&#x6570;&#x7801;&#x8BBE;&#x8BA1;&#x5DE5;&#x5177;&#x90FD;&#x5141;&#x8BB8;&#x8BBE;&#x8BA1;&#x5E08;&#x57FA;&#x4E8E;&#x8FD9;&#x4E09;&#x79CD;&#x57FA;&#x672C;&#x989C;&#x8272;&#x7684;&#x7EC4;&#x5408;&#x6765;&#x5B9A;&#x4E49;&#x989C;&#x8272;&#x3002;RGB&#x548C;CMY&#x989C;&#x8272;&#x6A21;&#x578B;&#x7684;&#x4E00;&#x4E2A;&#x7279;&#x522B;&#x597D;&#x5904;&#x662F;&#xFF0C;&#x5373;&#x4F7F;&#x5B83;&#x4EEC;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x539F;&#x8272;&#xFF0C;&#x5B83;&#x4EEC;&#x4E5F;&#x5171;&#x4EAB;&#x4E92;&#x8865;&#x8272;&#x3002;</p>
<p>&#x5C31;&#x50CF;&#x4ECA;&#x5929;&#x4EBA;&#x4EEC;&#x5BF9;&#x989C;&#x8272;&#x7684;&#x6027;&#x8D28;&#x7684;&#x79D1;&#x5B66;&#x6027;&#x8FBE;&#x6210;&#x4E86;&#x5171;&#x8BC6;&#xFF0C;&#x4F17;&#x6240;&#x5468;&#x77E5;&#xFF0C;&#x4EBA;&#x7C7B;&#x5BF9;&#x989C;&#x8272;&#x7684;&#x4F53;&#x9A8C;&#x662F;&#x4E00;&#x79CD;&#x9AD8;&#x5EA6;&#x590D;&#x6742;&#x4E14;&#x4E3B;&#x89C2;&#x7684;&#x73B0;&#x8C61;&#x3002;&#x4EBA;&#x4EEC;&#x666E;&#x904D;&#x8BA4;&#x4E3A;&#xFF0C;&#x4E0D;&#x53EF;&#x80FD;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5173;&#x4E8E;&#x8272;&#x5F69;&#x548C;&#x8C10;&#x7684;&#x7B80;&#x5355;&#x3001;&#x9884;&#x6D4B;&#x6027;&#x7684;&#x7406;&#x8BBA;-&#x6B4C;&#x5FB7;&#x548C;&#x4F0A;&#x85E4;&#x6240;&#x76F8;&#x4FE1;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x4E00;&#x7CFB;&#x5217;&#x56E0;&#x7D20;&#x51B3;&#x5B9A;&#x4F60;&#x5BF9;&#x7279;&#x5B9A;&#x989C;&#x8272;&#x7EC4;&#x5408;&#x7684;&#x53CD;&#x5E94;&#xFF0C;&#x5305;&#x62EC;&#x6027;&#x522B;&#xFF0C;&#x5E74;&#x9F84;&#xFF0C;&#x5FC3;&#x60C5;&#xFF0C;&#x4E2A;&#x4EBA;&#x80CC;&#x666F;&#x548C;&#x5F53;&#x524D;&#x793E;&#x4F1A;&#x7684;&#x8D8B;&#x52BF;&#x3002;&#x5728;&#x67D0;&#x79CD;&#x610F;&#x4E49;&#x4E0A;&#xFF0C;&#x5BF9;&#x4E8E;&#x6709;&#x62B1;&#x8D1F;&#x7684;&#x8BBE;&#x8BA1;&#x5E08;&#x6765;&#x8BF4;&#x5E94;&#x8BE5;&#x662F;&#x4E00;&#x79CD;&#x89E3;&#x8131;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E0D;&#x5FC5;&#x53C2;&#x4E0E;&#x5173;&#x4E8E;&#x54EA;&#x4E2A;&#x8272;&#x73AF;&#x5177;&#x6709;&#x201C;&#x6B63;&#x786E;&#x201D;&#x4E92;&#x8865;&#x8272;&#x7684;&#x65E0;&#x5173;&#x8BA8;&#x8BBA;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x7B97;&#x6CD5;&#x6765;&#x67E5;&#x627E;&#x534F;&#x8C03;&#x989C;&#x8272;&#xFF0C;&#x5B66;&#x751F;&#x522B;&#x65E0;&#x4ED6;&#x6CD5;&#xFF0C;&#x53EA;&#x80FD;&#x7528;&#x81EA;&#x5DF1;&#x7684;&#x53CC;&#x773C;&#x3002;</p>
<p>&#x5F53;&#x6211;&#x8BFB;&#x5230;&#x8FD9;&#x7BC7;&#x5173;&#x4E8E;&#x827A;&#x672F;&#x5BB6;&#x548C;&#x79D1;&#x5B66;&#x5BB6;&#x7684;&#x62A5;&#x9053;&#x65F6;&#xFF0C;&#x4ED6;&#x4EEC;&#x628A;&#x81EA;&#x5DF1;&#x7684;&#x804C;&#x4E1A;&#x751F;&#x6DAF;&#x5949;&#x732E;&#x7ED9;&#x4E86;&#x6A21;&#x578B;&#x7684;&#x521B;&#x4F5C;&#xFF0C;&#x5E2E;&#x52A9;&#x5176;&#x4ED6;&#x827A;&#x672F;&#x5BB6;&#x5BF9;&#x8272;&#x5F69;&#x6784;&#x6210;&#x505A;&#x51FA;&#x6709;&#x6839;&#x636E;&#x7684;&#x51B3;&#x5B9A;&#xFF0C;&#x5E94;&#x8BE5;&#x6E05;&#x695A;&#x7684;&#x662F;&#xFF0C;&#x73B0;&#x65F6;&#x8BBE;&#x8BA1;&#x5E08;&#x4E0E;&#x989C;&#x8272;&#x7684;&#x4EA4;&#x4E92;&#x65B9;&#x5F0F;-&#x62FE;&#x8272;&#x5668;-&#x4ECD;&#x6709;&#x5F88;&#x591A;&#x9700;&#x8981;&#x6539;&#x8FDB;&#x7684;&#x65B9;&#x9762;&#x3002;&#x62FE;&#x8272;&#x5668;&#x65E0;&#x5904;&#x4E0D;&#x5728;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x88AB;&#x6253;&#x7834;&#x4E86;&#xFF1A;&#x5728;&#x8FC7;&#x53BB;&#x5341;&#x5E74;&#x5E76;&#x65E0;&#x663E;&#x8457;&#x53D8;&#x5316;&#xFF0C;&#x4ED6;&#x4E0D;&#x80FD;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x6709;&#x610F;&#x4E49;&#x7684;&#x5F69;&#x8272;&#x5149;&#x8C31;&#x7684;&#x89C6;&#x89C9;&#x8868;&#x8FBE;&#xFF0C;&#x5C3D;&#x7BA1;&#x8FD9;&#x6837;&#x7684;&#x6A21;&#x578B;&#x5DF2;&#x7ECF;&#x51FA;&#x73B0;&#x4E86;300&#x591A;&#x5E74;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x5B83;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x77E9;&#x5F62;&#x533A;&#x57DF;&#x4E00;&#x6B21;&#x5C55;&#x793A;&#x4E00;&#x79CD;&#x5355;&#x4E00;&#x8272;&#x8C03;&#xFF0C;&#x8BBE;&#x8BA1;&#x5E08;&#x65E0;&#x6CD5;&#x53EF;&#x89C6;&#x5316;&#x6240;&#x6709;&#x989C;&#x8272;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x751A;&#x81F3;&#x65E0;&#x6CD5;&#x7406;&#x89E3;&#x611F;&#x77E5;&#x4E0A;&#x4E00;&#x81F4;&#x7684;&#x989C;&#x8272;&#x6A21;&#x578B;&#x7684;&#x5DEE;&#x5F02;&#x3002;&#x7ED3;&#x679C;&#x662F;&#xFF0C;&#x5728;&#x73B0;&#x4EE3;&#x8BBE;&#x8BA1;&#x5DE5;&#x5177;&#x4E2D;&#xFF0C;&#x8FD9;&#x6574;&#x4E2A;&#x8272;&#x5F69;&#x7406;&#x8BBA;&#x7684;&#x5386;&#x53F2;&#x88AB;&#x5FFD;&#x89C6;&#x4E86;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5B66;&#x751F;&#x4E5F;&#x5931;&#x53BB;&#x4E86;&#x5B83;&#x3002;</p>
<p>&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x5728;&#x8FD9;&#x672C;&#x4E66;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5E76;&#x4E0D;&#x4E00;&#x5B9A;&#x8981;&#x4F7F;&#x7528;&#x6570;&#x7801;&#x8BBE;&#x8BA1;&#x5DE5;&#x5177;&#x3002;&#x5728;&#x4E0B;&#x4E00;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x7814;&#x7A76;&#x989C;&#x8272;&#x6A21;&#x578B;&#x3001;&#x8272;&#x5F69;&#x7A7A;&#x95F4;&#x548C;&#x8BB8;&#x591A;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x4EE3;&#x7801;&#x751F;&#x6210;&#x989C;&#x8272;&#x65B9;&#x6848;&#x7684;&#x6280;&#x672F;&#x3002;&#x3002;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x548C;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x7684;&#x4EBA;&#x72AF;&#x540C;&#x6837;&#x7684;&#x9519;&#x8BEF;&#xFF0C;&#x8FD9;&#x4E9B;&#x7AE0;&#x8282;&#x4E0D;&#x4F1A;&#x8BD5;&#x56FE;&#x63D0;&#x51FA;&#x4E00;&#x4E2A;&#x7EDF;&#x4E00;&#x7684;&#x7406;&#x8BBA;&#xFF0C;&#x5173;&#x4E8E;&#x54EA;&#x79CD;&#x989C;&#x8272;&#x6700;&#x9002;&#x5408;&#x67D0;&#x4E9B;&#x573A;&#x666F;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4E86;&#x89E3;&#x8C03;&#x8272;&#x677F;&#xFF0C;&#x5E76;&#x5B66;&#x4E60;&#x5982;&#x4F55;&#x770B;&#x5230;&#x4E0D;&#x540C;&#x989C;&#x8272;&#x7EC4;&#x5408;&#x7684;&#x6548;&#x679C;&#x3002;&#x8FD9;&#x5C06;&#x4E3A;&#x5B66;&#x751F;&#x7684;&#x5B9E;&#x8DF5;&#x6253;&#x4E0B;&#x575A;&#x5B9E;&#x7684;&#x7406;&#x8BBA;&#x57FA;&#x7840;&#x3002;</p>
<p><img src="&#x53E0;&#x52A0;RGB&#x548C;&#x9012;&#x51CF;CMY&#x5171;&#x4EAB;&#x4E92;&#x8865;&#x8272;" alt="https://www.programmingdesignsystems.com/assets/color/a-short-history-of-color-theory/shared-primaries.jpg"></p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
                <a href="2.2.html" class="navigation navigation-next navigation-unique" aria-label="Next page: 2.2 颜色模型及颜色空间">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"2.1 颜色理论的小历史","level":"1.4.1","depth":2,"next":{"title":"2.2 颜色模型及颜色空间","level":"1.4.2","depth":2,"path":"chapters/2.2.md","ref":"chapters/2.2.md","articles":[]},"previous":{"title":"2.颜色","level":"1.4","depth":1,"ref":"","articles":[{"title":"2.1 颜色理论的小历史","level":"1.4.1","depth":2,"path":"chapters/2.1.md","ref":"chapters/2.1.md","articles":[]},{"title":"2.2 颜色模型及颜色空间","level":"1.4.2","depth":2,"path":"chapters/2.2.md","ref":"chapters/2.2.md","articles":[]},{"title":"2.3 感知颜色空间的一致性","level":"1.4.3","depth":2,"path":"chapters/2.3.md","ref":"chapters/2.3.md","articles":[]},{"title":"2.4 配色方案","level":"1.4.4","depth":2,"path":"chapters/2.4.md","ref":"chapters/2.4.md","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"chapters/2.1.md","mtime":"2019-08-06T08:35:48.389Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-09-25T14:35:43.663Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

