
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>2.4 配色方案 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="2.3.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    设计系统编程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    0.设计系统
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="0.html">
            
                <a href="0.html">
            
                    
                    0.1.什么是设计系统
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    1.形状
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="1.1.html">
            
                <a href="1.1.html">
            
                    
                    1.1 图形基础
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="1.2.html">
            
                <a href="1.2.html">
            
                    
                    1.2 基本形状
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="1.3.html">
            
                <a href="1.3.html">
            
                    
                    1.3 定制形状
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="1.4.html">
            
                <a href="1.4.html">
            
                    
                    1.4 程序形状
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    2.颜色
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="2.1.html">
            
                <a href="2.1.html">
            
                    
                    2.1 颜色理论简史
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="2.2.html">
            
                <a href="2.2.html">
            
                    
                    2.2 颜色模型及颜色空间
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="2.3.html">
            
                <a href="2.3.html">
            
                    
                    2.3 感知颜色空间的一致性
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4.4" data-path="2.4.html">
            
                <a href="2.4.html">
            
                    
                    2.4 配色方案
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" >
            
                <span>
            
                    
                    3.布局
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="3.1.html">
            
                <a href="3.1.html">
            
                    
                    3.1 几何图形简史
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" >
            
                <span>
            
                    
                    未完持续更新...
            
                </span>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >2.4 配色方案</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x914D;&#x8272;&#x65B9;&#x6848;">&#x914D;&#x8272;&#x65B9;&#x6848;</h2>
<p>&#x8272;&#x5F69;&#x7684;&#x6709;&#x6548;&#x8FD0;&#x7528;&#x5BF9;&#x4E8E;&#x4EFB;&#x4F55;&#x8BBE;&#x8BA1;&#x9879;&#x76EE;&#x7684;&#x6210;&#x529F;&#x90FD;&#x662F;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x7684;&#x3002;&#x60F3;&#x8C61;&#x4E00;&#x4E0B;&#xFF0C;&#x4E00;&#x4E2A;&#x9EC4;&#x8272;&#x7684;&#x53EF;&#x53E3;&#x53EF;&#x4E50;&#x6807;&#x5FD7;&#x6216;&#x7528;&#x9971;&#x548C;&#x7C89;&#x8272;&#x7ED8;&#x5236;&#x7684;&#x8499;&#x5A1C;&#x4E3D;&#x838E;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x610F;&#x8BC6;&#x5230;&#x989C;&#x8272;&#x7684;&#x9009;&#x62E9;&#x5BF9;&#x4EFB;&#x4F55;&#x8BBE;&#x8BA1;&#x90FD;&#x6709;&#x5DE8;&#x5927;&#x7684;&#x5F71;&#x54CD;&#x3002;&#x8FD9;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x989C;&#x8272;&#x603B;&#x662F;&#x6709;&#x4E00;&#x4E2A;&#x660E;&#x786E;&#x7684;&#x7B26;&#x53F7;&#x5B66;&#x76EE;&#x7684;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#x505C;&#x8F66;&#x6807;&#x5FD7;&#x88AB;&#x6D82;&#x6210;&#x7EA2;&#x8272;&#x53EF;&#x80FD;&#x662F;&#x663E;&#x800C;&#x6613;&#x89C1;&#x7684;(&#x8B66;&#x544A;&#xFF0C;&#x5371;&#x9669;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5FFD;&#x89C6;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x5C31;&#x4F1A;&#x6709;&#x8840;&#x8FF9;)&#xFF0C;&#x4F46;&#x5927;&#x591A;&#x6570;&#x914D;&#x8272;&#x65B9;&#x6848;&#x90FD;&#x5F88;&#x96BE;&#x5982;&#x6B64;&#x76F4;&#x63A5;&#x5730;&#x89E3;&#x91CA;&#x3002;&#x8FD9;&#x7ED9;&#x6211;&#x4EEC;&#x7559;&#x4E0B;&#x4E86;&#x4E00;&#x79CD;&#x827A;&#x672F;&#x5F62;&#x5F0F;&#xFF0C;&#x5C31;&#x50CF;&#x5E73;&#x9762;&#x8BBE;&#x8BA1;&#x4E00;&#x822C;&#xFF0C;&#x65E2;&#x6709;&#x5BA2;&#x89C2;&#x7684;&#xFF0C;&#x4E5F;&#x6709;&#x4E3B;&#x89C2;&#x7684;&#x3002;&#x5BA2;&#x89C2;&#x5730;&#x8BF4;&#xFF0C;&#x5728;&#x767D;&#x8272;&#x80CC;&#x666F;&#x4E0A;&#x4F7F;&#x7528;&#x9EC4;&#x8272;&#x6587;&#x672C;&#x662F;&#x4E00;&#x4E2A;&#x574F;&#x4E3B;&#x610F;&#xFF0C;&#x56E0;&#x4E3A;&#x7F3A;&#x4E4F;&#x5BF9;&#x6BD4;&#x4F1A;&#x4F7F;&#x6587;&#x672C;&#x96BE;&#x4EE5;&#x9605;&#x8BFB;&#x3002;&#x540C;&#x6837;&#xFF0C;&#x5F53;&#x5168;&#x7403;&#x7EA6;8%&#x7684;&#x7537;&#x6027;&#x60A3;&#x6709;&#x7EA2;&#x7EFF;&#x8272;&#x76F2;&#x65F6;&#xFF0C;&#x4E0D;&#x5E94;&#x5C06;&#x7EA2;&#x8272;&#x548C;&#x7EFF;&#x8272;&#x4F5C;&#x4E3A;&#x6570;&#x636E;&#x53EF;&#x89C6;&#x5316;&#x7684;&#x4E3B;&#x8981;&#x989C;&#x8272;&#x3002;&#x5728;&#x5904;&#x7406;&#x989C;&#x8272;&#x65F6;&#xFF0C;&#x4E86;&#x89E3;&#x8FD9;&#x4E9B;&#x89C4;&#x5219;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x4F7F;&#x8BBE;&#x8BA1;&#x4EBA;&#x5458;&#x80FD;&#x591F;&#x521B;&#x9020;&#x5927;&#x591A;&#x6570;&#x7528;&#x6237;&#x90FD;&#x6613;&#x4E8E;&#x5BDF;&#x89C9;&#x7684;&#x56FE;&#x5F62;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x8981;&#x638C;&#x63E1;&#x8272;&#x5F69;&#x7EC4;&#x5408;&#x7684;&#x827A;&#x672F;&#xFF0C;&#x8BBE;&#x8BA1;&#x5E08;&#x8FD8;&#x5FC5;&#x987B;&#x77E5;&#x9053;&#x8272;&#x5F69;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x6587;&#x5316;&#x548C;&#x8BED;&#x5883;&#x4E2D;&#x7684;&#x8FD0;&#x7528;&#xFF0C;&#x89C2;&#x5BDF;&#x5F53;&#x524D;&#x827A;&#x672F;&#x7684;&#x8D8B;&#x52BF;&#xFF0C;&#x5E76;&#x5728;&#x6B64;&#x57FA;&#x7840;&#x4E0A;&#x5F62;&#x6210;&#x81EA;&#x5DF1;&#x7684;&#x98CE;&#x683C;&#x3002;&#x6B63;&#x56E0;&#x4E3A;&#x5982;&#x6B64;&#xFF0C;&#x8BB8;&#x591A;&#x4F5C;&#x8005;&#x4E00;&#x76F4;&#x5728;&#x52AA;&#x529B;&#x521B;&#x9020;&#x4E00;&#x79CD;&#x6559;&#x8BBE;&#x8BA1;&#x5E08;&#x5982;&#x4F55;&#x601D;&#x8003;&#x8272;&#x5F69;&#x7EC4;&#x5408;&#x7684;&#x597D;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x4E00;&#x79CD;&#x6D41;&#x884C;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x6839;&#x636E;&#x6BCF;&#x4E2A;&#x65B9;&#x6848;&#x4E2D;&#x989C;&#x8272;&#x7684;&#x8272;&#x8C03;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x6765;&#x521B;&#x5EFA;&#x989C;&#x8272;&#x65B9;&#x6848;&#x7684;&#x7C7B;&#x522B;&#x3002;&#x8FD9;&#x4E9B;&#x7C7B;&#x522B;&#x88AB;&#x547D;&#x540D;&#x4E3A;&#x4E92;&#x8865;&#x8272;&#xFF08;&#x4E24;&#x79CD;&#x989C;&#x8272;&#x5177;&#x6709;&#x76F8;&#x53CD;&#x7684;&#x8272;&#x8C03;&#xFF09;&#x3001;&#x4E09;&#x8272;&#xFF08;&#x4E09;&#x79CD;&#x989C;&#x8272;&#x5747;&#x5300;&#x5206;&#x5E03;&#x5728;&#x8272;&#x8C31;&#x4EEA;&#x4E0A;&#xFF09;&#x548C;&#x56DB;&#x8272;&#xFF08;&#x56DB;&#x79CD;&#x989C;&#x8272;&#x5747;&#x5300;&#x5206;&#x5E03;&#x5728;&#x8272;&#x8C31;&#x4EEA;&#x4E0A;&#xFF09;&#x3002;&#x4F5C;&#x8005;&#x8FD8;&#x5305;&#x62EC;&#x4E00;&#x4E2A;&#x66F4;&#x6DF7;&#x5408;&#x7684;&#x7C7B;&#x522B;&#x96C6;&#xFF0C;&#x7528;&#x4E8E;&#x4E0D;&#x9002;&#x5408;&#x4EFB;&#x4F55;&#x524D;&#x4E00;&#x4E2A;&#x7C7B;&#x522B;&#x7684;&#x914D;&#x8272;&#x65B9;&#x6848;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x4E4B;&#x6240;&#x4EE5;&#x53D7;&#x6B22;&#x8FCE;&#xFF0C;&#x4E00;&#x4E2A;&#x539F;&#x56E0;&#x53EF;&#x80FD;&#x662F;&#x6559;&#x5E08;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5728;&#x5F69;&#x8272;&#x5706;&#x5708;&#x4E0A;&#x653E;&#x7F6E;&#x5F62;&#x72B6;&#x6765;&#x53EF;&#x89C6;&#x5316;&#x7C7B;&#x522B;&#xFF0C;&#x5B66;&#x751F;&#x53EF;&#x4EE5;&#x6539;&#x53D8;&#x8FD9;&#x4E9B;&#x5F62;&#x72B6;&#x7684;&#x5C3A;&#x5BF8;&#x6765;&#x521B;&#x5EFA;&#x4E0D;&#x540C;&#x7684;&#x989C;&#x8272;&#x65B9;&#x6848;&#x3002;&#x8FD9;&#x9879;&#x6280;&#x672F;&#x5728;&#x8BB8;&#x591A;&#x5173;&#x4E8E;&#x5E73;&#x9762;&#x8BBE;&#x8BA1;&#x7684;&#x4E66;&#x4E2D;&#x90FD;&#x6709;&#x63CF;&#x8FF0;&#xFF0C;&#x4F60;&#x5728;&#x8BBE;&#x8BA1;&#x8BC4;&#x8BBA;&#x4E2D;&#x7ECF;&#x5E38;&#x4F1A;&#x9047;&#x5230;&#x8FD9;&#x4E9B;&#x672F;&#x8BED;&#x3002;</p>
<p><img src="../images/62.png" alt=""></p>
<blockquote>
<p>&#x4E00;&#x79CD;&#x7531;&#x4E09;&#x79CD;&#x5747;&#x5300;&#x95F4;&#x9694;&#x7684;&#x8272;&#x8C03;&#x6784;&#x6210;&#x7684;&#x4E09;&#x8FDB;&#x8272;&#x7CFB;</p>
</blockquote>
<p><img src="../images/63.png" alt=""></p>
<blockquote>
<p>&#x4E00;&#x79CD;&#x7531;&#x56DB;&#x79CD;&#x5747;&#x5300;&#x95F4;&#x9694;&#x7684;&#x8272;&#x8C03;&#x6784;&#x6210;&#x7684;&#x56DB;&#x8FDB;&#x8272;&#x7CFB;</p>
</blockquote>
<p>&#x5C3D;&#x7BA1;&#x8FD9;&#x79CD;&#x7CFB;&#x7EDF;&#x5316;&#x7684;&#x65B9;&#x6CD5;&#x4F3C;&#x4E4E;&#x975E;&#x5E38;&#x9002;&#x5408;&#x8FD9;&#x672C;&#x4E66;&#xFF0C;&#x4F46;&#x6211;&#x8BA4;&#x4E3A;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x5B58;&#x5728;&#x5F88;&#x5927;&#x7684;&#x95EE;&#x9898;&#x3002;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x5355;&#x4E00;&#x7C7B;&#x522B;&#x5185;&#x7684;&#x989C;&#x8272;&#x65B9;&#x6848;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x8FDE;&#x8D2F;&#x7684;&#x89C6;&#x89C9;&#x6548;&#x679C;&#x3002;&#x5982;&#x679C;&#x7A0D;&#x5FAE;&#x8C03;&#x6574;&#x8272;&#x8C03;&#x4E4B;&#x95F4;&#x7684;&#x95F4;&#x8DDD;&#xFF0C;&#x4E09;&#x8272;&#x548C;&#x56DB;&#x8272;&#x7684;&#x914D;&#x8272;&#x65B9;&#x6848;&#x53EF;&#x80FD;&#x770B;&#x8D77;&#x6765;&#x975E;&#x5E38;&#x76F8;&#x4F3C;&#xFF0C;&#x751A;&#x81F3;&#x5B8C;&#x5168;&#x76F8;&#x540C;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x5728;sRGB&#x989C;&#x8272;&#x7A7A;&#x95F4;&#x4E2D;&#xFF0C;&#x7EAF;&#x4E09;&#x5143;&#x7EC4;&#x989C;&#x8272;&#x65B9;&#x6848;&#x7684;&#x89C6;&#x89C9;&#x6548;&#x679C;&#x4E0E;CIELUV&#x4E2D;&#x7684;&#x76F8;&#x540C;&#x989C;&#x8272;&#x65B9;&#x6848;&#x975E;&#x5E38;&#x4E0D;&#x540C;&#x3002;&#x6700;&#x7CDF;&#x7CD5;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x503E;&#x5411;&#x4E8E;&#x5FFD;&#x7565;&#x9971;&#x548C;&#x5EA6;&#x548C;&#x660E;&#x5EA6;&#x7EF4;&#x5EA6;&#xFF0C;&#x8FD9;&#x4E9B;&#x7EF4;&#x5EA6;&#x7559;&#x7ED9;&#x8BBE;&#x8BA1;&#x5E08;&#x81EA;&#x5DF1;&#x53BB;&#x89E3;&#x51B3;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x4E09;&#x79CD;&#x989C;&#x8272;&#x65B9;&#x6848;&#x90FD;&#x6709;&#x76F8;&#x540C;&#x7684;&#x8272;&#x8C03;&#x503C;&#xFF0C;&#x4F46;&#x662F;&#x901A;&#x8FC7;&#x6539;&#x53D8;&#x5B83;&#x4EEC;&#x7684;&#x9971;&#x548C;&#x5EA6;&#x548C;&#x660E;&#x5EA6;&#x503C;&#x6765;&#x4EA7;&#x751F;&#x622A;&#x7136;&#x4E0D;&#x540C;&#x7684;&#x89C6;&#x89C9;&#x6548;&#x679C;&#x3002;&#x4E00;&#x4E2A;&#x5FFD;&#x7565;&#x4E09;&#x5206;&#x4E4B;&#x4E8C;&#x989C;&#x8272;&#x7EF4;&#x5EA6;&#x7684;&#x8272;&#x5F69;&#x7406;&#x8BBA;&#x5C06;&#x65E0;&#x6CD5;&#x5E2E;&#x52A9;&#x8BBE;&#x8BA1;&#x5E08;&#x505A;&#x51FA;&#x66F4;&#x597D;&#x7684;&#x51B3;&#x7B56;&#x3002;</p>
<p><img src="../images/64.png" alt=""></p>
<p><img src="../images/65.png" alt=""></p>
<p><img src="../images/66.png" alt=""></p>
<blockquote>
<p>&#x8FD9;&#x4E09;&#x79CD;&#x989C;&#x8272;&#x65B9;&#x6848;&#x5177;&#x6709;&#x76F8;&#x540C;&#x7684;&#x8272;&#x8C03;&#x503C;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x989C;&#x8272;&#x5706;&#x4E0A;&#x7ED8;&#x5236;&#x65F6;&#x770B;&#x8D77;&#x6765;&#x76F8;&#x540C;&#x3002;&#x201C;&#x4E09;&#x5143;&#x201D;&#x4E00;&#x8BCD;&#x65E0;&#x52A9;&#x4E8E;&#x63CF;&#x8FF0;&#x5B83;&#x4EEC;&#x72EC;&#x7279;&#x7684;&#x89C6;&#x89C9;&#x6548;&#x679C;&#x3002;</p>
</blockquote>
<p>&#x76F8;&#x53CD;&#xFF0C;&#x672C;&#x7AE0;&#x5C06;&#x56F4;&#x7ED5;HSL&#x989C;&#x8272;&#x6A21;&#x578B;&#x7684;&#x4E09;&#x4E2A;&#x7EF4;&#x5EA6;&#x6784;&#x5EFA;&#x7684;&#x989C;&#x8272;&#x7406;&#x8BBA;&#x3002;&#x901A;&#x8FC7;&#x5173;&#x6CE8;&#x989C;&#x8272;&#x7684;&#x8272;&#x8C03;&#x3001;&#x9971;&#x548C;&#x5EA6;&#x548C;&#x4EAE;&#x5EA6;&#x2014;&#x2014;&#x4EE5;&#x53CA;&#x8FD9;&#x4E9B;&#x7EF4;&#x5EA6;&#x5982;&#x4F55;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#x2014;&#x2014;&#x8BBE;&#x8BA1;&#x5E08;&#x53EF;&#x4EE5;&#x4E86;&#x89E3;&#x4EE3;&#x7801;&#x4E2D;&#x7684;&#x53D8;&#x5316;&#x5982;&#x4F55;&#x5728;&#x89C6;&#x89C9;&#x4E0A;&#x53CD;&#x6620;&#x51FA;&#x6765;&#xFF0C;&#x5E76;&#x6839;&#x636E;&#x8FD9;&#x4E9B;&#x77E5;&#x8BC6;&#x7EC4;&#x5408;&#x6709;&#x8DA3;&#x7684;&#x989C;&#x8272;&#x3002;&#x5728;&#x4E0B;&#x9762;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4EE5;&#x76F8;&#x53CD;&#x7684;&#x987A;&#x5E8F;&#x904D;&#x5386;&#x8FD9;&#x4E9B;&#x7EF4;&#x5EA6;&#xFF0C;&#x4F7F;&#x7528;<a href="https://www.programmingdesignsystems.com/color/perceptually-uniform-color-spaces/index.html#hsluv" target="_blank">HSLuv&#x5E93;</a>&#x6765;&#x786E;&#x4FDD;&#x4EE3;&#x7801;&#x4E2D;&#x7684;&#x66F4;&#x6539;&#x53CD;&#x6620;&#x4E86;&#x989C;&#x8272;&#x7684;&#x5B9E;&#x9645;&#x611F;&#x77E5;&#x66F4;&#x6539;&#x3002;</p>
<h3 id="&#x4EAE;&#x5EA6;">&#x4EAE;&#x5EA6;</h3>
<p>&#x989C;&#x8272;&#x7684;&#x4EAE;&#x5EA6;&#x51B3;&#x5B9A;&#x4E86;&#x989C;&#x8272;&#x4E2D;&#x6DF7;&#x5408;&#x4E86;&#x591A;&#x5C11;&#x9ED1;&#x8272;(&#x53C2;&#x89C1;<a href="https://www.programmingdesignsystems.com/color/color-models-and-color-spaces/index.html#hsl-description" target="_blank">&#x989C;&#x8272;&#x6A21;&#x578B;&#x548C;&#x989C;&#x8272;&#x7A7A;&#x95F4;</a>)&#x3002;&#x660E;&#x6697;&#x5BF9;&#x6BD4;&#x662F;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x5BF9;&#x6BD4;&#xFF0C;&#x5373;&#x4F7F;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x63A7;&#x5236;HSL&#x7684;&#x4EFB;&#x4F55;&#x7EF4;&#x5EA6;&#x6765;&#x521B;&#x5EFA;&#x989C;&#x8272;&#x4E4B;&#x95F4;&#x7684;&#x5BF9;&#x6BD4;&#xFF0C;&#x201C;&#x5BF9;&#x6BD4;&#x201D;&#x8FD9;&#x4E2A;&#x672F;&#x8BED;&#x5927;&#x591A;&#x6570;&#x65F6;&#x5019;&#x6307;&#x7684;&#x662F;&#x4EAE;&#x5EA6;&#x7684;&#x53D8;&#x5316;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x6F14;&#x793A;&#x4E86;&#x4F4E;&#x5BF9;&#x6BD4;&#x5EA6;&#x548C;&#x9AD8;&#x5BF9;&#x6BD4;&#x5EA6;&#x914D;&#x8272;&#x65B9;&#x6848;&#x7684;&#x6548;&#x679C;&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x662F;&#x67D4;&#x548C;&#x548C;&#x8F7B;&#xFF0C;&#x8FD9;&#x662F;&#x7531;&#x4E8E;&#x4EAE;&#x5EA6;&#x503C;&#x9AD8;&#xFF0C;&#x6BCF;&#x79CD;&#x989C;&#x8272;&#x4E4B;&#x95F4;&#x7684;&#x4EAE;&#x5EA6;&#x5DEE;&#x5F02;&#x5F88;&#x5C0F;&#x3002;&#x7B2C;&#x4E8C;&#x4E2A;&#x4F8B;&#x5B50;&#x663E;&#x5F97;&#x66F4;&#x5927;&#x80C6;&#xFF0C;&#x5E76;&#x4E14;&#x7531;&#x4E8E;&#x76F8;&#x90BB;&#x989C;&#x8272;&#x4EAE;&#x5EA6;&#x7684;&#x5DE8;&#x5927;&#x5DEE;&#x5F02;&#x800C;&#x4EA7;&#x751F;&#x4E86;&#x663E;&#x8457;&#x7684;&#x6B63;&#x9762;/&#x8D1F;&#x9762;&#x5F71;&#x54CD;&#x3002;</p>
<p><img src="../images/67.png" alt=""></p>
<blockquote>
<p>&#x4F4E;&#x5BF9;&#x6BD4;&#x5EA6;&#x7684;&#x914D;&#x8272;&#x65B9;&#x6848;</p>
</blockquote>
<pre><code class="lang-javascript">fillHsluv(<span class="hljs-number">0</span>, <span class="hljs-number">0</span>, <span class="hljs-number">90</span>);
rect(<span class="hljs-number">0</span>, <span class="hljs-number">0</span>, width, height);
fillHsluv(<span class="hljs-number">0</span>, <span class="hljs-number">0</span>, <span class="hljs-number">85</span>);
rect(<span class="hljs-number">145</span>, <span class="hljs-number">95</span>, <span class="hljs-number">375</span>, <span class="hljs-number">200</span>);
fillHsluv(<span class="hljs-number">0</span>, <span class="hljs-number">0</span>, <span class="hljs-number">95</span>);
rect(<span class="hljs-number">85</span>, <span class="hljs-number">155</span>, <span class="hljs-number">375</span>, <span class="hljs-number">200</span>);
</code></pre>
<p><img src="../images/68.png" alt=""></p>
<blockquote>
<p>&#x9AD8;&#x5BF9;&#x6BD4;&#x5EA6;&#x7684;&#x914D;&#x8272;&#x65B9;&#x6848;</p>
</blockquote>
<pre><code class="lang-javascript">fillHsluv(<span class="hljs-number">0</span>, <span class="hljs-number">0</span>, <span class="hljs-number">0</span>);
rect(<span class="hljs-number">0</span>, <span class="hljs-number">0</span>, width, height);
fillHsluv(<span class="hljs-number">0</span>, <span class="hljs-number">0</span>, <span class="hljs-number">50</span>);
rect(<span class="hljs-number">145</span>, <span class="hljs-number">95</span>, <span class="hljs-number">375</span>, <span class="hljs-number">200</span>);
fillHsluv(<span class="hljs-number">0</span>, <span class="hljs-number">0</span>, <span class="hljs-number">100</span>);
rect(<span class="hljs-number">85</span>, <span class="hljs-number">155</span>, <span class="hljs-number">375</span>, <span class="hljs-number">200</span>);
</code></pre>
<p>Muriel Cooper&#x662F;&#x4E00;&#x4F4D;&#x975E;&#x5E38;&#x6709;&#x5F71;&#x54CD;&#x529B;&#x7684;&#x5E73;&#x9762;&#x8BBE;&#x8BA1;&#x5E08;&#xFF0C;&#x5979;&#x5728;&#x65E9;&#x671F;&#x7684;&#x6570;&#x5B57;&#x8BBE;&#x8BA1;&#x548C;&#x7528;&#x6237;&#x754C;&#x9762;&#x8BBE;&#x8BA1;&#x65B9;&#x9762;&#x505A;&#x51FA;&#x4E86;&#x91CD;&#x8981;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x4F5C;&#x4E3A;&#x9EBB;&#x7701;&#x7406;&#x5DE5;&#x5B66;&#x9662;&#x5A92;&#x4F53;&#x5B9E;&#x9A8C;&#x5BA4;(MIT Media Lab)&#x7684;&#x8054;&#x5408;&#x521B;&#x59CB;&#x4EBA;&#x548C;&#x9EBB;&#x7701;&#x7406;&#x5DE5;&#x5B66;&#x9662;&#x51FA;&#x7248;&#x793E;(MIT Press)&#x7684;&#x8BBE;&#x8BA1;&#x603B;&#x76D1;&#xFF0C;&#x5979;&#x7BA1;&#x7406;&#x7740;&#x8D85;&#x8FC7;500&#x672C;&#x4E66;&#x7684;&#x5236;&#x4F5C;&#xFF0C;&#x5979;&#x7684;&#x9ED1;&#x767D;&#x8BBE;&#x8BA1;&#x5E7F;&#x4E3A;&#x4EBA;&#x77E5;&#x3002;&#x4E0B;&#x9762;&#x662F;&#x5979;&#x7684;&#x4E24;&#x4E2A;&#x66F4;&#x8457;&#x540D;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x5B8C;&#x5168;&#x4F9D;&#x8D56;&#x4E8E;&#x4EAE;&#x5EA6;&#x7684;&#x7EAC;&#x5EA6;&#x3002;</p>
<p><img src="../images/mit-press.jpg" alt=""></p>
<blockquote>
<p>MIT Press &#xA9;. &#x56FE;&#x6807;</p>
</blockquote>
<p><img src="../images/bauhaus-book.jpg" alt=""></p>
<blockquote>
<p>MIT Press &#xA9;&#x300A;&#x5305;&#x8C6A;&#x65AF;&#x300B;&#x4E00;&#x4E66;&#x5C01;&#x9762;&#x8BBE;&#x8BA1;</p>
</blockquote>
<p>&#x5728;&#x5904;&#x7406;&#x6587;&#x672C;&#x65F6;&#xFF0C;&#x9009;&#x62E9;&#x5408;&#x9002;&#x7684;&#x5BF9;&#x6BD4;&#x5EA6;&#x5C24;&#x5176;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x53EF;&#x8BFB;&#x6027;&#x662F;&#x7531;&#x6587;&#x672C;&#x548C;&#x80CC;&#x666F;&#x4E4B;&#x95F4;&#x7684;&#x5BF9;&#x6BD4;&#x5EA6;&#x51B3;&#x5B9A;&#x7684;&#x3002;&#x4E07;&#x7EF4;&#x7F51;&#x8054;&#x76DF;(World Wide Web Consortium)&#x5728;&#x5176;<a href="https://www.w3.org/TR/UNDERSTANDING-WCAG20/visual-audio-contrast-contrast.html" target="_blank">Web&#x5185;&#x5BB9;&#x53EF;&#x89E6;&#x8FBE;&#x6027;&#x6307;&#x5357;</a>&#x4E2D;&#x5EFA;&#x8BAE;&#xFF0C;&#x6B63;&#x6587;&#x6587;&#x672C;&#x7684;&#x5BF9;&#x6BD4;&#x5EA6;&#x5E94;&#x81F3;&#x5C11;&#x4E3A;4.5:1(&#x6216;&#x5C0F;&#x4E8E;0.222)&#xFF0C;&#x5E76;&#x4E14;&#x4ED6;&#x4EEC;&#x63D0;&#x4F9B;&#x4E86;&#x4EE5;&#x4E0B;&#x516C;&#x5F0F;&#x6765;&#x8BA1;&#x7B97;&#x4E24;&#x4E2A;&#x4EAE;&#x5EA6;&#x503C;&#x7684;&#x5BF9;&#x6BD4;&#x5EA6;&#x3002;</p>
<pre><code class="lang-javasciprt">var contrastRatio = (l1 + 0.05) / (l2 + 0.05);
</code></pre>
<p>&#x8FD9;&#x4E2A;&#x516C;&#x5F0F;&#x8981;&#x6C42;&#x5728;&#x76F8;&#x5BF9;&#x4EAE;&#x5EA6;&#x4E2D;&#x63D0;&#x4F9B;&#x4E24;&#x4E2A;&#x4EAE;&#x5EA6;&#x503C;&#xFF0C;&#x5373;CIEXYZ&#x989C;&#x8272;&#x7A7A;&#x95F4;&#x4E2D;&#x7684;Y&#x7EF4;&#x3002;&#x4E3A;&#x4E86;&#x8BA1;&#x7B97;HSLuv&#x989C;&#x8272;&#x7684;W3C&#x5BF9;&#x6BD4;&#x5EA6;&#xFF0C;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x9700;&#x8981;&#x5C06;&#x4EAE;&#x5EA6;&#x503C;&#x8F6C;&#x6362;&#x4E3A;CIEXYZ&#x989C;&#x8272;&#x7A7A;&#x95F4;&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;&#x4E0A;&#x9762;&#x7684;&#x516C;&#x5F0F;&#x8BA1;&#x7B97;&#x5BF9;&#x6BD4;&#x5EA6;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x793A;&#x4F8B;&#x6F14;&#x793A;&#x4E86;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x5176;&#x4E2D;<code>contrastRatio()</code>&#x51FD;&#x6570;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x4E24;&#x4E2A;HSLuv&#x4EAE;&#x5EA6;&#x503C;&#x8BA1;&#x7B97;&#x5BF9;&#x6BD4;&#x5EA6;&#x3002;</p>
<pre><code class="lang-javascript"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">lightnessToLuminance</span>(<span class="hljs-params">l</span>) </span>{
  <span class="hljs-keyword">if</span> (l &lt;= <span class="hljs-number">8</span>) {
    <span class="hljs-keyword">return</span> <span class="hljs-number">1.0</span> * l / <span class="hljs-number">903.2962962</span>;
  } <span class="hljs-keyword">else</span> {
    <span class="hljs-keyword">return</span> <span class="hljs-number">1.0</span> * <span class="hljs-built_in">Math</span>.pow((l + <span class="hljs-number">16</span>) / <span class="hljs-number">116</span>, <span class="hljs-number">3</span>);
  }
}

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">contrastRatio</span>(<span class="hljs-params">l1, l2</span>) </span>{
  l1 = lightnessToLuminance(l1);
  l2 = lightnessToLuminance(l2);
  <span class="hljs-keyword">return</span> (l1 + <span class="hljs-number">0.05</span>) / (l2 + <span class="hljs-number">0.05</span>);
}

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">setup</span>(<span class="hljs-params"></span>) </span>{
  <span class="hljs-built_in">console</span>.log(contrastRatio(<span class="hljs-number">40</span>, <span class="hljs-number">70</span>)); <span class="hljs-comment">// BAD! 0.35521707859730733</span>
  <span class="hljs-built_in">console</span>.log(contrastRatio(<span class="hljs-number">40</span>, <span class="hljs-number">90</span>)); <span class="hljs-comment">// GOOD! 0.19988073069469958</span>
}
</code></pre>
<p>&#x4EAE;&#x5EA6;&#x5728;&#x4EFB;&#x4F55;&#x914D;&#x8272;&#x65B9;&#x6848;&#x4E2D;&#x90FD;&#x626E;&#x6F14;&#x7740;&#x91CD;&#x8981;&#x7684;&#x89D2;&#x8272;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x5728;&#x53EF;&#x89E6;&#x8FBE;&#x6027;&#x8FD8;&#x662F;&#x7F8E;&#x89C2;&#x65B9;&#x9762;&#x3002;&#x548C;&#x672C;&#x4E66;&#x524D;&#x9762;&#x7684;&#x7EC3;&#x4E60;&#x4E00;&#x6837;&#xFF0C;&#x5EFA;&#x8BAE;&#x6709;&#x62B1;&#x8D1F;&#x7684;&#x8BBE;&#x8BA1;&#x5E08;&#x53EA;&#x7EC3;&#x4E60;&#x9ED1;&#x767D;&#x8BBE;&#x8BA1;&#xFF0C;&#x4EE5;&#x5B66;&#x4E60;&#x5982;&#x4F55;&#x5728;&#x4ED6;&#x4EEC;&#x7684;&#x8BBE;&#x8BA1;&#x4E2D;&#x5EFA;&#x7ACB;&#x9002;&#x5F53;&#x7684;&#x5BF9;&#x6BD4;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x8BBE;&#x8BA1;&#x770B;&#x8D77;&#x6765;&#x5F88;&#x6742;&#x4E71;&#xFF0C;&#x201C;&#x5B83;&#x5728;&#x9ED1;&#x8272;&#x548C;&#x767D;&#x8272;&#x4E2D;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x5B50;&#x7684;&#x201D;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x53EF;&#x4EE5;&#x63ED;&#x793A;&#x51FA;&#x5728;&#x8BBE;&#x8BA1;&#x4E2D;&#x5F62;&#x72B6;&#x4E4B;&#x95F4;&#x7F3A;&#x4E4F;&#x5BF9;&#x6BD4;&#x3002;</p>
<h3 id="&#x9971;&#x548C;&#x5EA6;">&#x9971;&#x548C;&#x5EA6;</h3>
<p>&#x989C;&#x8272;&#x7684;&#x9971;&#x548C;&#x5EA6;&#x63A7;&#x5236;&#x989C;&#x8272;&#x4ECE;&#x7070;&#x5EA6;&#x5230;&#x5168;&#x8272;&#x7684;&#x7EAF;&#x5EA6;(&#x53C2;&#x89C1;&#x989C;&#x8272;&#x6A21;&#x578B;&#x548C;&#x989C;&#x8272;&#x7A7A;&#x95F4;)&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x7EF4;&#x5EA6;&#x521B;&#x5EFA;&#x4ECE;&#x975E;&#x5E38;&#x67D4;&#x548C;&#x5230;&#x975E;&#x5E38;&#x660E;&#x4EAE;&#x7684;&#x989C;&#x8272;&#x7EC4;&#x5408;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x4E24;&#x4E2A;&#x4F8B;&#x5B50;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x660E;&#x5EA6;&#x548C;&#x8272;&#x8C03;&#x503C;&#xFF0C;&#x53EA;&#x662F;&#x9971;&#x548C;&#x5EA6;&#x4E0D;&#x540C;&#x3002;</p>
<p><img src="../images/69.png" alt=""></p>
<blockquote>
<p>&#x51CF;&#x9971;&#x548C;&#x5EA6;&#x8272;&#x5F69;&#x65B9;&#x6848;</p>
</blockquote>
<pre><code class="lang-javascript">fillHsluv(<span class="hljs-number">40</span>, <span class="hljs-number">30</span>, <span class="hljs-number">65</span>);
rect(<span class="hljs-number">0</span>, <span class="hljs-number">0</span>, width, height);
fillHsluv(<span class="hljs-number">10</span>, <span class="hljs-number">40</span>, <span class="hljs-number">40</span>);
rect(<span class="hljs-number">145</span>, <span class="hljs-number">95</span>, <span class="hljs-number">375</span>, <span class="hljs-number">200</span>);
fillHsluv(<span class="hljs-number">75</span>, <span class="hljs-number">50</span>, <span class="hljs-number">85</span>);
rect(<span class="hljs-number">85</span>, <span class="hljs-number">155</span>, <span class="hljs-number">375</span>, <span class="hljs-number">200</span>);
</code></pre>
<p><img src="../images/70.png" alt=""></p>
<blockquote>
<p>&#x9971;&#x548C;&#x5EA6;&#x65B9;&#x6848;</p>
</blockquote>
<pre><code class="lang-javascript">fillHsluv(<span class="hljs-number">40</span>, <span class="hljs-number">100</span>, <span class="hljs-number">65</span>);
rect(<span class="hljs-number">0</span>, <span class="hljs-number">0</span>, width, height);
fillHsluv(<span class="hljs-number">10</span>, <span class="hljs-number">100</span>, <span class="hljs-number">40</span>);
rect(<span class="hljs-number">145</span>, <span class="hljs-number">95</span>, <span class="hljs-number">375</span>, <span class="hljs-number">200</span>);
fillHsluv(<span class="hljs-number">75</span>, <span class="hljs-number">100</span>, <span class="hljs-number">85</span>);
rect(<span class="hljs-number">85</span>, <span class="hljs-number">155</span>, <span class="hljs-number">375</span>, <span class="hljs-number">200</span>);
</code></pre>
<p>&#x5728;&#x7528;&#x6237;&#x754C;&#x9762;&#x8BBE;&#x8BA1;&#x4E2D;&#xFF0C;&#x9971;&#x548C;&#x5EA6;&#x5E38;&#x88AB;&#x7528;&#x6765;&#x533A;&#x5206;&#x672A;&#x6FC0;&#x6D3B;&#x548C;&#x6FC0;&#x6D3B;&#x754C;&#x9762;&#x7EC4;&#x4EF6;&#x3002;&#x82F9;&#x679C;&#x7684;iOS&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5BF9;&#x4E00;&#x822C;&#x7684;&#x754C;&#x9762;&#x5143;&#x7D20;&#x91C7;&#x7528;&#x53BB;&#x9971;&#x548C;&#x5EA6;&#x7684;&#x914D;&#x8272;&#x65B9;&#x6848;&#xFF0C;&#x4F46;&#x5BF9;&#x4E8E;&#x5173;&#x952E;&#x52A8;&#x4F5C;&#xFF0C;&#x5982;&#x6FC0;&#x6D3B;&#x7684;&#x5207;&#x6362;&#x6309;&#x94AE;&#x548C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x901A;&#x77E5;&#xFF0C;&#x5219;&#x4F7F;&#x7528;&#x5B8C;&#x5168;&#x9971;&#x548C;&#x7684;&#x989C;&#x8272;&#x3002;&#x8FD9;&#x4F7F;&#x5F97;&#x7528;&#x6237;&#x80FD;&#x591F;&#x5FEB;&#x901F;&#x4E86;&#x89E3;&#x754C;&#x9762;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x5E76;&#x6CE8;&#x610F;&#x5230;&#x65B0;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E8B;&#x4EF6;&#x4F55;&#x65F6;&#x53D1;&#x751F;&#xFF0C;&#x5C31;&#x50CF;&#x65E7;&#x4EA4;&#x6362;&#x673A;&#x4E0A;&#x7684;LED&#x706F;&#x4EAE;&#x4E86;&#x4E00;&#x6837;&#x3002;</p>
<p><img src="../images/ios.jpg" alt=""></p>
<blockquote>
<p>iOS 11&#x63A7;&#x5236;&#x4E2D;&#x5FC3;&#x4F7F;&#x7528;&#x5355;&#x8272;&#x8272;&#x5F69;&#x7A7A;&#x95F4;&#xFF0C;&#x4F46;&#x5BF9;&#x4E8E;&#x6FC0;&#x6D3B;&#x7684;&#x6309;&#x94AE;&#x5219;&#x4F7F;&#x7528;&#x5B8C;&#x5168;&#x9971;&#x548C;&#x7684;&#x989C;&#x8272;&#x3002;</p>
</blockquote>
<p>&#x5F53;&#x5904;&#x7406;&#x8272;&#x5F69;&#x9971;&#x548C;&#x5EA6;&#x65F6;&#xFF0C;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x7C7B;&#x6BD4;&#x662F;&#xFF0C;&#x8BB8;&#x591A;&#x56FD;&#x5BB6;&#x5728;&#x5176;&#x57CE;&#x5E02;&#x4E2D;&#x6709;&#x7740;&#x4E0D;&#x540C;&#x7C89;&#x5237;&#x623F;&#x5C4B;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x8FD9;&#x4E9B;&#x989C;&#x6599;&#x7684;&#x9971;&#x548C;&#x5EA6;&#x53EF;&#x4EE5;&#x6709;&#x5F88;&#x5927;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x867D;&#x7136;&#x5E76;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5185;&#x5728;&#x7684;&#x542B;&#x4E49;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x786E;&#x5B9E;&#x8BF4;&#x660E;&#x4E86;&#x65F6;&#x95F4;&#x3001;&#x5730;&#x70B9;&#x548C;&#x4EBA;&#x3002;&#x60F3;&#x8C61;&#x4E00;&#x4E0B;&#xFF0C;&#x65E5;&#x672C;&#x7684;&#x4E00;&#x4E2A;&#x5C0F;&#x6751;&#x5E84;&#xFF0C;&#x5B83;&#x7684;&#x8272;&#x5F69;&#x67D4;&#x548C;&#x800C;&#x4E0D;&#x9971;&#x548C;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x5B83;&#x4E0E;&#x58A8;&#x897F;&#x54E5;&#x8FD9;&#x6837;&#x7684;&#x5730;&#x65B9;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#xFF0C;&#x90A3;&#x91CC;&#x7684;&#x623F;&#x5B50;&#x90FD;&#x6F06;&#x6210;&#x975E;&#x5E38;&#x7EAF;&#x51C0;&#x3001;&#x9971;&#x548C;&#x7684;&#x989C;&#x8272;&#x3002;&#x8FD9;&#x4E9B;&#x989C;&#x8272;&#x53CD;&#x6620;&#x4E86;&#x5B83;&#x4EEC;&#x5468;&#x56F4;&#x7684;&#x6587;&#x5316;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x4EE5;&#x540C;&#x6837;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x8003;&#x8651;&#x4F60;&#x7684;&#x5185;&#x5BB9;:&#x5B83;&#x9700;&#x8981;&#x6D3B;&#x6CFC;&#x7684;&#x989C;&#x8272;&#x8FD8;&#x662F;&#x67D4;&#x548C;&#x7684;&#x8FD8;&#x662F;&#x73B0;&#x4EE3;&#x4E3B;&#x4E49;&#x7684;&#x65B9;&#x6848;?&#x989C;&#x8272;&#x7684;&#x9971;&#x548C;&#x5EA6;&#x662F;&#x5173;&#x952E;&#x3002;</p>
<p><img src="../images/japanese-town.jpg" alt=""></p>
<blockquote>
<p>&#x4E0D;&#x9971;&#x548C;&#x8272;&#x5F69;&#x7684;&#x65E5;&#x672C;&#x57CE;&#x9547; &#x7167;&#x7247;&#x6765;&#x6E90;&#x4E8E;<a href="https://ja.wikipedia.org/wiki/%E5%88%A9%E7%94%A8%E8%80%85:663highland" target="_blank">663h</a></p>
</blockquote>
<p><img src="../images/mexican-town.jpg" alt=""></p>
<blockquote>
<p>&#x58A8;&#x897F;&#x54E5;&#x7684;&#x623F;&#x5B50;&#x6F06;&#x4E0A;&#x4E86;&#x9971;&#x548C;&#x7684;&#x989C;&#x8272;</p>
</blockquote>
<h3 id="&#x8272;&#x8C03;">&#x8272;&#x8C03;</h3>
<p>&#x8272;&#x8C03;&#x7EF4;&#x5EA6;&#x51B3;&#x5B9A;&#x5B9E;&#x9645;&#x8981;&#x663E;&#x793A;&#x7684;&#x989C;&#x8272;&#xFF0C;&#x7531;&#x989C;&#x8272;&#x540D;&#x79F0;&#x8868;&#x793A;(&#x5982;&#x7EA2;&#x8272;&#x3001;&#x7EFF;&#x8272;&#x548C;&#x84DD;&#x8272;&#xFF0C;<a href="https://www.programmingdesignsystems.com/color/color-models-and-color-spaces/index.html#hsl-description" target="_blank">&#x8BF7;&#x53C2;&#x9605;&#x989C;&#x8272;&#x6A21;&#x578B;&#x548C;&#x989C;&#x8272;&#x7A7A;&#x95F4;</a>)&#x3002;&#x5982;&#x524D;&#x4E00;&#x7AE0;&#x6240;&#x8FF0;&#xFF0C;&#x8272;&#x8C03;&#x7EC4;&#x5408;&#x4EA7;&#x751F;&#x8C03;&#x548C;&#x6548;&#x679C;&#x7684;&#x7406;&#x8BBA;&#x5E76;&#x4E0D;&#x4E00;&#x81F4;&#x3002;&#x5C3D;&#x7BA1;&#x8BB8;&#x591A;&#x4EBA;&#x90FD;&#x8BD5;&#x8FC7;&#xFF0C;&#x4F46;&#x8981;&#x5BF9;&#x8FD9;&#x6837;&#x4E00;&#x4EF6;&#x4E8B;&#x6765;&#x4F5C;&#x51FA;&#x6982;&#x62EC;&#x6027;&#x7684;&#x7406;&#x8BBA;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x4ECE;&#x4E16;&#x4E0A;&#x73B0;&#x5B58;&#x8272;&#x8C03;&#x7EC4;&#x5408;&#x4E2D;&#x53EF;&#x4EE5;&#x5F97;&#x51FA;&#x4E00;&#x4E9B;&#x6709;&#x76CA;&#x7684;&#x7ED3;&#x8BBA;&#x3002;</p>
<p>&#x5728;&#x81EA;&#x7136;&#x754C;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x7ECF;&#x5E38;&#x80FD;&#x5728;&#x5149;&#x8C31;&#x7684;&#x7EA2;&#x7EFF;&#x90E8;&#x5206;&#x770B;&#x5230;&#x7EC6;&#x5FAE;&#x7684;&#x8272;&#x76F8;&#x5DEE;&#x5F02;&#x3002;&#x5728;&#x6625;&#x5929;&#xFF0C;&#x6811;&#x6728;&#x548C;&#x690D;&#x7269;&#x5C06;&#x5448;&#x73B0;&#x51E0;&#x4E4E;&#x5355;&#x4E00;&#x7684;&#x660E;&#x4EAE;&#x7EFF;&#x8272;&#xFF0C;&#x4F46;&#x968F;&#x7740;&#x8FDB;&#x5165;&#x79CB;&#x5B63;&#xFF0C;&#x8FD9;&#x4E9B;&#x989C;&#x8272;&#x5C06;&#x8F7B;&#x5FAE;&#x5730;&#x5206;&#x6563;&#x6210;&#x8BB8;&#x591A;&#x76F8;&#x8FD1;&#x7684;&#x989C;&#x8272;&#xFF0C;&#x5982;&#x7EFF;&#x8272;&#x3001;&#x9EC4;&#x8272;&#x548C;&#x7EA2;&#x8272;&#x3002;&#x4F60;&#x4F1A;&#x7ECF;&#x5E38;&#x53D1;&#x73B0;&#x5728;&#x8BBE;&#x8BA1;&#x4EA7;&#x54C1;&#x4E2D;&#x8FD9;&#x6837;&#x7684;&#x8272;&#x8C03;&#x7EC4;&#x5408;&#x80FD;&#x5524;&#x8D77;&#x5B81;&#x9759;&#x6216;&#x548C;&#x5E73;&#x7684;&#x611F;&#x89C9;&#xFF0C;&#x5982;&#x745C;&#x4F3D;&#x5DE5;&#x4F5C;&#x5BA4;&#xFF0C;&#x6709;&#x673A;&#x98DF;&#x54C1;&#x548C;&#x5A5A;&#x793C;&#x8BF7;&#x67EC;&#x3002;&#x53E6;&#x4E00;&#x79CD;&#x7C7B;&#x4F3C;&#x7684;&#x914D;&#x8272;&#x65B9;&#x6848;&#x53EF;&#x4EE5;&#x5728;&#x6765;&#x81EA;&#x5916;&#x592A;&#x7A7A;&#x7684;&#x7167;&#x7247;&#x4E2D;&#x627E;&#x5230;&#xFF0C;&#x5728;&#x90A3;&#x91CC;&#xFF0C;&#x5149;&#x8C31;&#x4E2D;&#x8F83;&#x4EAE;&#x7684;&#x84DD;&#x8272;/&#x7EFF;&#x8272;&#x90E8;&#x5206;&#x8425;&#x9020;&#x4E86;&#x4E00;&#x79CD;&#x51E0;&#x4E4E;&#x662F;&#x5916;&#x661F;&#x7684;&#x6548;&#x679C;&#x3002;&#x8FD9;&#x4E9B;&#x989C;&#x8272;&#x901A;&#x5E38;&#x7528;&#x4E8E;&#x6280;&#x672F;&#x6216;&#x8F6F;&#x4EF6;&#x4EA7;&#x54C1;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E9B;&#x4EA7;&#x54C1;&#x60F3;&#x8981;&#x770B;&#x8D77;&#x6765;&#x5448;&#x6D41;&#x7EBF;&#x578B;&#xFF0C;&#x4E14;&#x6545;&#x610F;&#x8FD9;&#x6837;&#x505A;&#x3002;&#x82F9;&#x679C;(Apple)&#x548C;&#x5FAE;&#x8F6F;(Microsoft)&#x7684;&#x95E8;&#x5E97;&#x770B;&#x8D77;&#x6765;&#x5C31;&#x50CF;&#x5B87;&#x5B99;&#x98DE;&#x8239;&#x91CC;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x8FD9;&#x5E76;&#x975E;&#x5DE7;&#x5408;:&#x5B83;&#x4EEC;&#x7684;&#x8BBE;&#x8BA1;&#x521D;&#x8877;&#x662F;&#x8BA9;&#x987E;&#x5BA2;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x8FDB;&#x5165;&#x4E86;&#x4E00;&#x4E2A;&#x6700;&#x5148;&#x8FDB;&#x7684;&#x79D1;&#x5B66;&#x5B9E;&#x9A8C;&#x5BA4;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x80FD;&#x8BA9;&#x4ED6;&#x4EEC;&#x63A5;&#x53D7;&#x66F4;&#x9AD8;&#x7684;&#x4EF7;&#x683C;&#x3002;&#x4EE5;&#x4E0B;&#x4E24;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x914D;&#x8272;&#x65B9;&#x6848;&#xFF0C;&#x5728;&#x5149;&#x8C31;&#x4E0A;&#x989C;&#x8272;&#x5F7C;&#x6B64;&#x63A5;&#x8FD1;&#xFF0C;&#x4F46;&#x89C6;&#x89C9;&#x6548;&#x679C;&#x5374;&#x622A;&#x7136;&#x4E0D;&#x540C;&#x3002;</p>
<p><img src="../images/nature-colors.jpg" alt="">
<img src="../images/71.png" alt=""></p>
<pre><code class="lang-javascript">fillHsluv(<span class="hljs-number">75</span>, <span class="hljs-number">95</span>, <span class="hljs-number">70</span>);
rect(<span class="hljs-number">0</span>, <span class="hljs-number">0</span>, width, height);
fillHsluv(<span class="hljs-number">35</span>, <span class="hljs-number">90</span>, <span class="hljs-number">40</span>);
rect(<span class="hljs-number">145</span>, <span class="hljs-number">95</span>, <span class="hljs-number">375</span>, <span class="hljs-number">200</span>);
fillHsluv(<span class="hljs-number">55</span>, <span class="hljs-number">100</span>, <span class="hljs-number">80</span>);
rect(<span class="hljs-number">85</span>, <span class="hljs-number">155</span>, <span class="hljs-number">375</span>, <span class="hljs-number">200</span>);
</code></pre>
<p><img src="../images/space-colors.jpg" alt="">
<img src="../images/72.png" alt=""></p>
<pre><code class="lang-javascript">fillHsluv(<span class="hljs-number">270</span>, <span class="hljs-number">65</span>, <span class="hljs-number">15</span>);
rect(<span class="hljs-number">0</span>, <span class="hljs-number">0</span>, width, height);
fillHsluv(<span class="hljs-number">295</span>, <span class="hljs-number">70</span>, <span class="hljs-number">55</span>);
rect(<span class="hljs-number">145</span>, <span class="hljs-number">95</span>, <span class="hljs-number">375</span>, <span class="hljs-number">200</span>);
fillHsluv(<span class="hljs-number">278</span>, <span class="hljs-number">100</span>, <span class="hljs-number">73</span>);
rect(<span class="hljs-number">85</span>, <span class="hljs-number">155</span>, <span class="hljs-number">375</span>, <span class="hljs-number">200</span>);
</code></pre>
<p>&#x5F53;&#x8272;&#x8C03;&#x4E4B;&#x95F4;&#x7684;&#x8DDD;&#x79BB;&#x589E;&#x52A0;&#x65F6;&#xFF0C;&#x4F1A;&#x4EA7;&#x751F;&#x66F4;&#x6DF1;&#x8FDC;&#x7684;&#x5F71;&#x54CD;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x8FD9;&#x79CD;&#x8BF4;&#x6CD5;&#x53EF;&#x80FD;&#x5177;&#x6709;&#x6B3A;&#x9A97;&#x6027;&#x3002;&#x867D;&#x7136;&#x5F7C;&#x6B64;&#x63A5;&#x8FD1;&#x7684;&#x989C;&#x8272;&#x6709;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x76F8;&#x4F3C;&#x6548;&#x679C;&#xFF0C;&#x4F46;&#x8272;&#x73AF;&#x76F8;&#x5BF9;&#x8FB9;&#x4E0A;&#x7684;&#x989C;&#x8272;&#x4E0D;&#x4E00;&#x5B9A;&#x5177;&#x6709;&#x6700;&#x660E;&#x663E;&#x7684;&#x8272;&#x8C03;&#x5BF9;&#x6BD4;&#x5EA6;&#x3002;&#x4E24;&#x79CD;&#x8272;&#x8C03;&#x7684;&#x89C6;&#x89C9;&#x6548;&#x679C;&#x4E0D;&#x80FD;&#x7528;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x516C;&#x5F0F;&#x6765;&#x8BA1;&#x7B97;&#xFF0C;&#x66F4;&#x591A;&#x7684;&#x662F;&#x7531;&#x5B9E;&#x9645;&#x9009;&#x62E9;&#x7684;&#x8272;&#x8C03;&#x3001;&#x5982;&#x4F55;&#x5728;&#x8BBE;&#x8BA1;&#x4E2D;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#x4EE5;&#x53CA;&#x5B83;&#x4EEC;&#x7684;&#x9971;&#x548C;&#x5EA6;&#x548C;&#x4EAE;&#x5EA6;&#x503C;&#x51B3;&#x5B9A;&#x7684;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5728;&#x8BBE;&#x8BA1;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x50CF;&#x8003;&#x8651;&#x5176;&#x4ED6;&#x4EFB;&#x4F55;&#x5173;&#x7CFB;&#x4E00;&#x6837;&#xFF0C;&#x8003;&#x8651;&#x8272;&#x8C03;&#x7684;&#x95F4;&#x8DDD;&#x4E5F;&#x662F;&#x5F88;&#x91CD;&#x8981;&#x7684;:&#x6211;&#x7684;&#x5185;&#x5BB9;&#x662F;&#x5426;&#x9700;&#x8981;&#x5E73;&#x9762;&#x7684;&#x3001;&#x5355;&#x8272;&#x7684;&#x989C;&#x8272;&#xFF0C;&#x6216;&#x8005;&#x591A;&#x79CD;&#x989C;&#x8272;?</p>
<p><img src="../images/73.png" alt=""></p>
<blockquote>
<p>&#x5F31;&#x8272;&#x8C03;&#x5BF9;&#x6BD4;</p>
</blockquote>
<p><img src="../images/74.png" alt=""></p>
<blockquote>
<p>&#x4E2D;&#x7B49;&#x8272;&#x8C03;&#x5BF9;&#x6BD4;</p>
</blockquote>
<p><img src="../images/75.png" alt=""></p>
<blockquote>
<p>&#x5F3A;&#x8272;&#x8C03;&#x5BF9;&#x6BD4;</p>
</blockquote>
<p>&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x8272;&#x76F8;&#x7EF4;&#x5EA6;&#x7684;&#x65F6;&#x4E0D;&#x5F97;&#x4E0D;&#x63D0;&#x53CA;&#x5404;&#x7C7B;&#x7684;&#x8272;&#x76F2;&#xFF0C;&#x8272;&#x76F2;&#x4F7F;&#x8BB8;&#x591A;&#x4EBA;&#x96BE;&#x4EE5;&#x533A;&#x5206;&#x7279;&#x5B9A;&#x7684;&#x8272;&#x8C03;&#x3002;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x8272;&#x76F2;&#x662F;&#x7EA2;&#x7EFF;&#x8272;&#x76F2;&#xFF0C;&#x8FD9;&#x4F7F;&#x5F97;&#x4EBA;&#x4EEC;&#x5F88;&#x96BE;&#x533A;&#x5206;&#x7EA2;&#x8272;&#x548C;&#x7EFF;&#x8272;&#x3002;&#x5982;&#x679C;&#x7EFF;&#x8272;&#x7684;&#x89C6;&#x7F51;&#x819C;&#x9525;&#x4E25;&#x91CD;&#x53D7;&#x635F;&#xFF0C;&#x8FD9;&#x90E8;&#x5206;&#x4EBA;&#x53EA;&#x80FD;&#x770B;&#x5230;&#x84DD;&#x8272;&#x3002;&#x4E00;&#x79CD;&#x8F83;&#x5C11;&#x89C1;&#x7684;&#x8272;&#x76F2;&#x7C7B;&#x578B;&#x662F;&#x84DD;&#x9EC4;&#x8272;&#xFF0C;&#x5176;&#x4E2D;&#x84DD;&#x8272;&#x3001;&#x9EC4;&#x8272;&#x548C;&#x7EFF;&#x8272;&#x662F;&#x65E0;&#x6CD5;&#x533A;&#x5206;&#x7684;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x5728;&#x6700;&#x7F55;&#x89C1;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6709;&#x4E9B;&#x4EBA;&#x53EA;&#x6709;&#x5355;&#x8272;&#x89C6;&#x529B;&#x3002;&#x5168;&#x7403;&#x9AD8;&#x8FBE;8%&#x7684;&#x7537;&#x6027;&#x548C;0.5%&#x7684;&#x5973;&#x6027;&#x60A3;&#x6709;&#x8272;&#x76F2;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#xFF0C;&#x8272;&#x5F69;&#x65B9;&#x6848;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x6559;&#x5B66;&#x4F7F;&#x7528;&#x7684;&#x65B9;&#x6848;&#xFF0C;&#x4E0D;&#x5E94;&#x8BE5;&#x4EC5;&#x4EC5;&#x4F9D;&#x8D56;&#x4E8E;&#x8272;&#x8C03;&#x6765;&#x6784;&#x9020;&#x8272;&#x5F69;&#x5BF9;&#x6BD4;&#x3002;&#x5E94;&#x8BE5;&#x59CB;&#x7EC8;&#x628A;&#x4EAE;&#x5EA6;&#x8003;&#x8651;&#x5728;&#x5185;&#xFF0C;&#x56E0;&#x4E3A;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x89C6;&#x529B;&#x6B63;&#x5E38;&#x7684;&#x4EBA;&#x90FD;&#x5177;&#x6709;&#x901A;&#x8FC7;&#x5BF9;&#x6BD4;&#x6765;&#x533A;&#x5206;&#x989C;&#x8272;&#x7684;&#x80FD;&#x529B;&#x3002;</p>
<p><img src="../images/vision-normal.jpg" alt=""></p>
<blockquote>
<p>&#x6B63;&#x5E38;&#x8272;&#x5F69;&#x89C6;&#x89C9;</p>
</blockquote>
<p><img src="../images/vision-severe.jpg" alt=""></p>
<blockquote>
<p>&#x8F7B;&#x5EA6;&#x7EA2;&#x7EFF;&#x8272;&#x76F2;</p>
</blockquote>
<p><img src="../images/vision-severe.jpg" alt=""></p>
<blockquote>
<p>&#x91CD;&#x5EA6;&#x7EA2;&#x7EFF;&#x8272;&#x76F2;</p>
</blockquote>
<h3 id="&#x8272;&#x5F69;&#x65B9;&#x6848;&#x793A;&#x4F8B;">&#x8272;&#x5F69;&#x65B9;&#x6848;&#x793A;&#x4F8B;</h3>
<p>&#x8272;&#x5F69;&#x7684;&#x8FD9;&#x4E09;&#x4E2A;&#x7EF4;&#x5EA6;&#x884D;&#x751F;&#x65E0;&#x7A77;&#x8272;&#x5F69;&#x7EC4;&#x5408;&#x5B9E;&#x9A8C;&#x3002;&#x867D;&#x7136;&#x4E00;&#x4E9B;&#x8272;&#x5F69;&#x65B9;&#x6848;&#x4EC5;&#x7531;&#x5728;&#x4E00;&#x4E2A;&#x7EF4;&#x5EA6;&#x4E0A;&#x53D8;&#x5316;&#x7684;&#x989C;&#x8272;&#x7EC4;&#x6210;&#xFF08;&#x5982;&#x4E00;&#x4E9B;&#x5355;&#x8272;&#x8BBE;&#x8BA1;&#xFF09;&#xFF0C;&#x4F46;&#x5927;&#x591A;&#x6570;&#x8272;&#x5F69;&#x65B9;&#x6848;&#x5C06;&#x8272;&#x8C03;&#x3001;&#x9971;&#x548C;&#x5EA6;&#x548C;&#x4EAE;&#x5EA6;&#x7684;&#x53D8;&#x5316;&#x7ED3;&#x5408;&#x8D77;&#x6765;&#x4EE5;&#x5B9E;&#x73B0;&#x989C;&#x8272;&#x7684;&#x8C03;&#x8272;&#x677F;&#x3002;&#x603B;&#x90E8;&#x4F4D;&#x4E8E;&#x5E03;&#x9C81;&#x514B;&#x6797;&#x7684;&#x5DE7;&#x514B;&#x529B;&#x751F;&#x4EA7;&#x5546;&#x9A6C;&#x65AF;&#x7279;&#x5144;&#x5F1F;&#xFF08;mast brothers&#xFF09;&#x4EE5;&#x5176;&#x4E30;&#x5BCC;&#x591A;&#x5F69;&#x7684;&#x5305;&#x88C5;&#x8BBE;&#x8BA1;&#x800C;&#x95FB;&#x540D;&#xFF0C;&#x5F69;&#x8272;&#x56FE;&#x6848;&#x88AB;&#x7528;&#x6765;&#x8868;&#x793A;&#x5DE7;&#x514B;&#x529B;&#x7684;&#x98CE;&#x5473;&#x8F6E;&#x5ED3;&#x3002;&#x8FD9;&#x4E9B;&#x6A21;&#x5F0F;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x7814;&#x7A76;&#x6848;&#x4F8B;&#xFF0C;&#x8BF4;&#x660E;&#x53EF;&#x4EE5;&#x64CD;&#x7EB5;&#x989C;&#x8272;&#x7684;&#x4E09;&#x4E2A;&#x7EAC;&#x5EA6;&#x6765;&#x6784;&#x5EFA;&#x4E0D;&#x540C;&#x7684;&#x8868;&#x8FBE;&#x3002;</p>
<p><img src="../images/mast-smoke.jpg" alt=""></p>
<blockquote>
<p>&#x70DF;</p>
</blockquote>
<p><img src="../images/mast-mint.jpg" alt=""></p>
<blockquote>
<p>&#x8584;&#x8377;</p>
</blockquote>
<p><img src="../images/mast-brooklyn.jpg" alt=""></p>
<blockquote>
<p>&#x5E03;&#x9C81;&#x514B;&#x6797;&#x7684;&#x6DF7;&#x5408;</p>
</blockquote>
<p>&#x7B2C;&#x4E00;&#x4E2A;&#x56FE;&#x6848;&#x662F;&#x7528;&#x70DF;&#x718F;&#x8C46;&#x505A;&#x6210;&#x7684;&#x9ED1;&#x5DE7;&#x514B;&#x529B;&#xFF0C;&#x8BBE;&#x8BA1;&#x5E08;&#x9009;&#x7528;&#x4E86;&#x4E00;&#x79CD;&#x5F3A;&#x5BF9;&#x6BD4;&#x5EA6;&#x7684;&#x5355;&#x8272;&#x65B9;&#x6848;&#xFF0C;&#x6CE2;&#x6D6A;&#x7684;&#x5F62;&#x72B6;&#x6697;&#x793A;&#x70DF;&#x96FE;&#x6F02;&#x6D6E;&#x5728;&#x7A7A;&#x6C14;&#x4E2D;&#x3002;&#x6CE8;&#x610F;&#x8FD9;&#x4E9B;&#x989C;&#x8272;&#x672C;&#x8EAB;&#x770B;&#x8D77;&#x6765;&#x5E76;&#x4E0D;&#x201C;&#x81EA;&#x7136;&#x201D;&#xFF0C;&#x800C;&#x662F;&#x7528;&#x6765;&#x4F20;&#x8FBE;&#x4EA7;&#x54C1;&#x7684;&#x5473;&#x9053;&#x3002;&#x7B2C;&#x4E8C;&#x4E2A;&#x56FE;&#x6848;&#x662F;&#x5E26;&#x8584;&#x8377;&#x53F6;&#x7684;&#x9ED1;&#x5DE7;&#x514B;&#x529B;&#xFF0C;&#x5176;&#x7279;&#x70B9;&#x662F;&#x989C;&#x8272;&#x4ECE;&#x6DF1;&#x7EFF;&#x8272;&#x5230;&#x4EAE;&#x9EC4;&#x8272;&#x7684;&#x6E10;&#x53D8;&#xFF0C;&#x5E76;&#x5728;50&#x5E74;&#x4EE3;&#x5F62;&#x6210;&#x56FA;&#x5316;&#x7684;&#x9971;&#x548C;&#x5EA6;&#x3002;&#x6E10;&#x53D8;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x6709;&#x8DA3;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x5448;&#x73B0;&#x8FD9;&#x4E24;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x53E3;&#x5473;&#xFF0C;&#x5C3D;&#x7BA1;&#x5B83;&#x4EEC;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x7279;&#x70B9;&#xFF0C;&#x4F46;&#x5374;&#x80FD;&#x5F88;&#x597D;&#x5730;&#x878D;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x3002;&#x6700;&#x540E;&#x7684;&#x56FE;&#x6848;&#x5728;&#x8F83;&#x6D45;&#x7684;&#x80CC;&#x666F;&#x4E0A;&#x91C7;&#x7528;&#x4E86;&#x56DB;&#x79CD;&#x989C;&#x8272;&#x65B9;&#x6848;&#xFF0C;&#x5176;&#x4E2D;&#x5177;&#x6709;&#x8F83;&#x5927;&#x8272;&#x8C03;&#x5BF9;&#x6BD4;&#x7684;&#x9971;&#x548C;&#x989C;&#x8272;&#x7528;&#x4E8E;&#x4E3A;&#x7C7B;&#x4F3C;&#x4E8E;&#x989C;&#x6599;&#x4E0A;&#x8272;&#x7684;&#x5F62;&#x72B6;&#x3002;&#x4E00;&#x4E2A;&#x6709;&#x8DA3;&#x548C;&#x521B;&#x9020;&#x6027;&#x7684;&#x5E03;&#x9C81;&#x514B;&#x6797;&#x533A;&#x8BBE;&#x8BA1;&#x3002;</p>
<h3 id="&#x7A0B;&#x5E8F;&#x8272;&#x5F69;&#x65B9;&#x6848;">&#x7A0B;&#x5E8F;&#x8272;&#x5F69;&#x65B9;&#x6848;</h3>
<p>&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x4EBA;&#x5DE5;&#x786C;&#x7F16;&#x7801;&#x4E86;&#x989C;&#x8272;&#x503C;&#x6765;&#x6784;&#x5EFA;&#x914D;&#x8272;&#x65B9;&#x6848;&#x3002;&#x6211;&#x4EEC;&#x4E3A;&#x4E86;&#x771F;&#x6B63;&#x5229;&#x7528;&#x4EE3;&#x7801;&#x6765;&#x751F;&#x6210;&#x8FD9;&#x4E9B;&#x8BBE;&#x8BA1;&#xFF0C;&#x5E94;&#x8BE5;&#x7814;&#x7A76;&#x5982;&#x4F55;&#x7A0B;&#x5E8F;&#x5316;&#x5730;&#x751F;&#x6210;&#x8FD9;&#x4E9B;&#x989C;&#x8272;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x4F7F;&#x7528;&#x5FAA;&#x73AF;&#x4EE3;&#x7801;&#x4E2D;&#x6765;&#x521B;&#x5EFA;&#x591A;&#x79CD;&#x989C;&#x8272;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x8981;&#x5173;&#x6CE8;<code>color()</code>&#x51FD;&#x6570;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x5FAA;&#x73AF;&#x6765;&#x52A8;&#x6001;&#x521B;&#x5EFA;color&#x5BF9;&#x8C61;&#x3002;</p>
<p>js&#x4E2D;&#x7684;color()&#x51FD;&#x6570;&#x53EF;&#x7528;&#x4E8E;&#x521B;&#x5EFA;&#x53EF;&#x590D;&#x7528;&#x7684;color&#x5BF9;&#x8C61;&#xFF0C;&#x8BE5;&#x5BF9;&#x8C61;&#x53EF;&#x5728;fill()&#x548C;stroke()&#x51FD;&#x6570;&#x4E2D;&#x91CD;&#x590D;&#x4F7F;&#x7528;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#xFF0C;&#x4E0E;&#x5176;&#x8BA9;&#x76F8;&#x540C;&#x7684;&#x989C;&#x8272;&#x503C;&#x5206;&#x6563;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#xFF0C;&#x4E0D;&#x5982;&#x5728;&#x4EE3;&#x7801;&#x7684;&#x9876;&#x90E8;&#x4E3A;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x5206;&#x914D;&#x4E00;&#x4E2A;&#x989C;&#x8272;&#x5BF9;&#x8C61;&#xFF0C;&#x5E76;&#x5728;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x989C;&#x8272;&#x65F6;&#x5F15;&#x7528;&#x8FD9;&#x4E2A;&#x53D8;&#x91CF;&#x3002;&#x53C2;&#x8003;&#x4EE5;&#x4E0B;&#x4EE3;&#x7801;&#xFF0C;&#x5176;&#x4E2D;&#x591A;&#x6B21;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x7EA2;&#x8272;&#x3002;</p>
<pre><code class="lang-javascript">fill(<span class="hljs-number">225</span>, <span class="hljs-number">35</span>, <span class="hljs-number">35</span>);
rect(<span class="hljs-number">50</span>, <span class="hljs-number">50</span>, <span class="hljs-number">200</span>, <span class="hljs-number">180</span>);

fill(<span class="hljs-number">40</span>, <span class="hljs-number">185</span>, <span class="hljs-number">155</span>);
rect(<span class="hljs-number">200</span>, <span class="hljs-number">100</span>, <span class="hljs-number">200</span>, <span class="hljs-number">180</span>);

Second use <span class="hljs-keyword">of</span> red

fill(<span class="hljs-number">225</span>, <span class="hljs-number">35</span>, <span class="hljs-number">35</span>);
rect(<span class="hljs-number">350</span>, <span class="hljs-number">150</span>, <span class="hljs-number">200</span>, <span class="hljs-number">180</span>);
</code></pre>
<p><img src="../images/76.png" alt=""></p>
<p>&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;color()&#x51FD;&#x6570;&#x6765;&#x91CD;&#x65B0;&#x5B9E;&#x73B0;&#xFF0C;&#x989C;&#x8272;&#x503C;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x53EA;&#x51FA;&#x73B0;&#x4E00;&#x6B21;&#x3002;</p>
<pre><code class="lang-javascript"><span class="hljs-keyword">var</span> red = color(<span class="hljs-number">225</span>, <span class="hljs-number">35</span>, <span class="hljs-number">35</span>);

Use it here

fill(red);
rect(<span class="hljs-number">50</span>, <span class="hljs-number">50</span>, <span class="hljs-number">200</span>, <span class="hljs-number">180</span>);

fill(<span class="hljs-number">40</span>, <span class="hljs-number">185</span>, <span class="hljs-number">155</span>);
rect(<span class="hljs-number">200</span>, <span class="hljs-number">100</span>, <span class="hljs-number">200</span>, <span class="hljs-number">180</span>);

Use it here

fill(red);
rect(<span class="hljs-number">350</span>, <span class="hljs-number">150</span>, <span class="hljs-number">200</span>, <span class="hljs-number">180</span>);
</code></pre>
<p><img src="../images/77.png" alt=""></p>
<p>&#x8981;&#x4F7F;&#x7528;color()&#x51FD;&#x6570;&#x548C;HSLuv&#x503C;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5C0F;&#x51FD;&#x6570;&#xFF0C;&#x5728;&#x521B;&#x5EFA;color&#x5BF9;&#x8C61;&#x4E4B;&#x524D;&#x6267;&#x884C;HSLuv&#x5230;RGB&#x7684;&#x8F6C;&#x6362;&#x3002;&#x9664;&#x4E86;&#x4F7F;&#x7528;color()&#x51FD;&#x6570;&#x5916;&#xFF0C;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x4E0E;&#x4E0A;&#x4E00;&#x7AE0;&#x4E2D;&#x7684;fillHSluv()&#x548C;strokeHsluv()&#x51FD;&#x6570;&#x76F8;&#x540C;&#x3002;&#x8BF7;&#x8BB0;&#x4F4F;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x5305;&#x542B;HSLuv JavaScript&#x6587;&#x4EF6;&#x624D;&#x80FD;&#x5B9E;&#x73B0;&#x8FD9;&#x4E00;&#x70B9;&#x3002;</p>
<pre><code class="lang-javascript"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">colorHsluv</span>(<span class="hljs-params">h, s, l</span>) </span>{
  <span class="hljs-keyword">var</span> rgb = hsluv.hsluvToRgb([h, s, l]);
  <span class="hljs-keyword">return</span> color(rgb[<span class="hljs-number">0</span>] * <span class="hljs-number">255</span>, rgb[<span class="hljs-number">1</span>] * <span class="hljs-number">255</span>, rgb[<span class="hljs-number">2</span>] * <span class="hljs-number">255</span>);
}

<span class="hljs-keyword">var</span> red = colorHsluv(<span class="hljs-number">225</span>, <span class="hljs-number">35</span>, <span class="hljs-number">35</span>);
fill(red);
</code></pre>
<p>&#x73B0;&#x5728;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x60F3;&#x5728;&#x8BBE;&#x8BA1;&#x4E2D;&#x4F7F;&#x7528;&#x591A;&#x79CD;&#x989C;&#x8272;&#x5462;?&#x5728;&#x4E0A;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x4E2D;&#x6DFB;&#x52A0;&#x66F4;&#x591A;&#x7684;&#x53D8;&#x91CF;&#x662F;&#x6709;&#x610F;&#x4E49;&#x7684;&#x3002;&#x867D;&#x7136;&#x8FD9;&#x5BF9;&#x4E8E;&#x5C11;&#x6570;&#x51E0;&#x79CD;&#x989C;&#x8272;&#x6765;&#x8BF4;&#x662F;&#x5B8C;&#x5168;&#x53EF;&#x4EE5;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x5927;&#x91CF;&#x7684;&#x989C;&#x8272;&#x6765;&#x8BF4;&#x5C31;&#x6CA1;&#x6709;&#x610F;&#x4E49;&#x4E86;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x573A;&#x666F;&#x4E2D;&#xFF0C;&#x66F4;&#x660E;&#x667A;&#x7684;&#x505A;&#x6CD5;&#x662F;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#xFF0C;&#x5141;&#x8BB8;&#x5728;&#x4E0D;&#x5F15;&#x5165;&#x65B0;&#x53D8;&#x91CF;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x6DFB;&#x52A0;&#x548C;&#x5220;&#x9664;&#x989C;&#x8272;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x5C06;&#x4E09;&#x4E2A;&#x989C;&#x8272;&#x5B58;&#x50A8;&#x5728;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#x4E2D;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#x6765;&#x7ED8;&#x5236;&#x4E00;&#x4E2A;&#x914D;&#x8272;&#x65B9;&#x6848;&#x3002;</p>
<pre><code class="lang-javascript"><span class="hljs-keyword">var</span> colors = [
  colorHsluv(<span class="hljs-number">40</span>, <span class="hljs-number">100</span>, <span class="hljs-number">65</span>),
  colorHsluv(<span class="hljs-number">10</span>, <span class="hljs-number">100</span>, <span class="hljs-number">40</span>),
  colorHsluv(<span class="hljs-number">75</span>, <span class="hljs-number">100</span>, <span class="hljs-number">85</span>)
];

fill(colors[<span class="hljs-number">0</span>]);
rect(<span class="hljs-number">0</span>, <span class="hljs-number">0</span>, width, height);
fill(colors[<span class="hljs-number">1</span>]);
rect(<span class="hljs-number">145</span>, <span class="hljs-number">95</span>, <span class="hljs-number">375</span>, <span class="hljs-number">200</span>);
fill(colors[<span class="hljs-number">2</span>]);
rect(<span class="hljs-number">85</span>, <span class="hljs-number">155</span>, <span class="hljs-number">375</span>, <span class="hljs-number">200</span>);
</code></pre>
<p><img src="../images/78.png" alt=""></p>
<p>&#x6700;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5FAA;&#x73AF;&#x6765;&#x52A8;&#x6001;&#x521B;&#x5EFA;color&#x5BF9;&#x8C61;&#x3002;&#x4E3A;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x7A7A;&#x6570;&#x7EC4;&#xFF0C;&#x5E76;&#x5728;&#x6BCF;&#x6B21;&#x5FAA;&#x73AF;&#x8FED;&#x4EE3;&#x65F6;&#x5C06;&#x4E00;&#x4E2A;&#x65B0;&#x7684;color&#x5BF9;&#x8C61;&#x63A8;&#x5165;&#x6570;&#x7EC4;&#x3002;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4F7F;&#x7528;<code>random()</code>&#x51FD;&#x6570;&#x6765;&#x786E;&#x4FDD;&#x6BCF;&#x6B21;&#x5FAA;&#x73AF;&#x8FD0;&#x884C;&#x65F6;&#x7684;&#x989C;&#x8272;&#x662F;&#x4E0D;&#x540C;&#x7684;&#x3002;</p>
<pre><code class="lang-javascript"><span class="hljs-keyword">var</span> colors = [];

<span class="hljs-keyword">for</span>(<span class="hljs-keyword">var</span> i = <span class="hljs-number">0</span>; i &lt; <span class="hljs-number">3</span>; i++) {
Push <span class="hljs-keyword">new</span> color <span class="hljs-keyword">with</span> random hue, saturation, and lightness into array every time

  colors.push(
    colorHsluv(
      random(<span class="hljs-number">360</span>),
      random(<span class="hljs-number">100</span>),
      random(<span class="hljs-number">100</span>)
    )
  )
}

fill(colors[<span class="hljs-number">0</span>]);
rect(<span class="hljs-number">0</span>, <span class="hljs-number">0</span>, width, height);
fill(colors[<span class="hljs-number">1</span>]);
rect(<span class="hljs-number">145</span>, <span class="hljs-number">95</span>, <span class="hljs-number">375</span>, <span class="hljs-number">200</span>);
fill(colors[<span class="hljs-number">2</span>]);
rect(<span class="hljs-number">85</span>, <span class="hljs-number">155</span>, <span class="hljs-number">375</span>, <span class="hljs-number">200</span>);
</code></pre>
<p><img src="../images/79.png" alt=""></p>
<p>&#x6709;&#x4E86;&#x8FD9;&#x4E9B;&#x6982;&#x5FF5;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x6309;&#x7A0B;&#x5E8F;&#x751F;&#x6210;&#x914D;&#x8272;&#x65B9;&#x6848;&#x4E86;&#x3002;&#x4E00;&#x79CD;&#x7B56;&#x7565;(&#x53EF;&#x80FD;&#x4E5F;&#x662F;&#x6700;&#x7B80;&#x5355;&#x7684;&#x7B56;&#x7565;)&#xFF0C;&#x5C31;&#x662F;&#x6301;&#x7EED;&#x4F7F;&#x7528;<code>random()</code>&#xFF0C;&#x901A;&#x8FC7;&#x66F4;&#x6539;<code>random()</code>&#x51FD;&#x6570;&#x7684;&#x4F20;&#x53C2;&#x6765;&#x521B;&#x5EFA;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x914D;&#x8272;&#x65B9;&#x6848;&#x3002;</p>
<p><img src="../images/80.png" alt=""></p>
<pre><code class="lang-javascript"><span class="hljs-keyword">var</span> colors = [];
<span class="hljs-keyword">for</span>(<span class="hljs-keyword">var</span> i = <span class="hljs-number">0</span>; i &lt; <span class="hljs-number">3</span>; i++) {
  colors.push(
    colorHsluv(<span class="hljs-number">240</span>, <span class="hljs-number">20</span>, random(<span class="hljs-number">100</span>))
  )
}

fill(colors[<span class="hljs-number">0</span>]);
rect(<span class="hljs-number">0</span>, <span class="hljs-number">0</span>, width, height);
fill(colors[<span class="hljs-number">1</span>]);
rect(<span class="hljs-number">145</span>, <span class="hljs-number">95</span>, <span class="hljs-number">375</span>, <span class="hljs-number">200</span>);
fill(colors[<span class="hljs-number">2</span>]);
rect(<span class="hljs-number">85</span>, <span class="hljs-number">155</span>, <span class="hljs-number">375</span>, <span class="hljs-number">200</span>);
</code></pre>
<p><img src="../images/80-1.png" alt=""></p>
<pre><code class="lang-javascript"><span class="hljs-keyword">var</span> colors = [];
<span class="hljs-keyword">for</span>(<span class="hljs-keyword">var</span> i = <span class="hljs-number">0</span>; i &lt; <span class="hljs-number">3</span>; i++) {
  colors.push(
    colorHsluv(random(<span class="hljs-number">360</span>), <span class="hljs-number">90</span>, <span class="hljs-number">50</span>)
  )
}

fill(colors[<span class="hljs-number">0</span>]);
rect(<span class="hljs-number">0</span>, <span class="hljs-number">0</span>, width, height);
fill(colors[<span class="hljs-number">1</span>]);
rect(<span class="hljs-number">145</span>, <span class="hljs-number">95</span>, <span class="hljs-number">375</span>, <span class="hljs-number">200</span>);
fill(colors[<span class="hljs-number">2</span>]);
rect(<span class="hljs-number">85</span>, <span class="hljs-number">155</span>, <span class="hljs-number">375</span>, <span class="hljs-number">200</span>);
</code></pre>
<p>&#x7136;&#x800C;&#xFF0C;<code>random()</code>&#x51FD;&#x6570;&#x5F88;&#x53EF;&#x80FD;&#x4F1A;&#x4EA7;&#x751F;&#x76F8;&#x8FD1;&#x7684;&#x6570;&#x5B57;&#xFF0C;&#x4ECE;&#x800C;&#x5F97;&#x5230;&#x975E;&#x5E38;&#x76F8;&#x4F3C;&#x7684;&#x989C;&#x8272;&#x3002;&#x4E00;&#x4E2A;&#x66F4;&#x5F3A;&#x5927;&#x7684;&#x7B56;&#x7565;&#x662F;&#x4F7F;&#x7528;&#x5FAA;&#x73AF;&#x7684;&#x9012;&#x589E;i&#x53D8;&#x91CF;&#x6765;&#x8BA1;&#x7B97;&#x4F20;&#x9012;&#x7ED9;<code>color()</code>&#x51FD;&#x6570;&#x7684;&#x503C;&#x3002;&#x8FD9;&#x79CD;&#x6280;&#x672F;&#x4E0E;<a href="https://www.programmingdesignsystems.com/shape/procedural-shapes/index.html#for-loop" target="_blank">&#x8FC7;&#x7A0B;&#x5F62;&#x72B6;</a>&#x4E00;&#x7AE0;&#x4E2D;&#x6F14;&#x793A;&#x7684;&#x6280;&#x672F;&#x76F8;&#x540C;&#xFF0C;&#x4F46;&#x8FD9;&#x6B21;&#x6211;&#x4EEC;&#x5C06;&#x5B83;&#x7528;&#x4E8E;&#x989C;&#x8272;&#x503C;&#xFF0C;&#x800C;&#x4E0D;&#x662F;x&#x548C;y&#x4F4D;&#x7F6E;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x793A;&#x4F8B;&#x4F7F;&#x7528;i&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x4EAE;&#x5EA6;&#x503C;&#x4E3A;20&#x3001;50&#x548C;80&#x7684;&#x5355;&#x8272;&#x914D;&#x8272;&#x65B9;&#x6848;&#xFF0C;&#x540C;&#x65F6;&#x4FDD;&#x6301;&#x8272;&#x8C03;&#x548C;&#x9971;&#x548C;&#x5EA6;&#x4E0D;&#x53D8;&#x3002;</p>
<pre><code class="lang-javascript"><span class="hljs-keyword">var</span> colors = [];
<span class="hljs-keyword">for</span>(<span class="hljs-keyword">var</span> i = <span class="hljs-number">0</span>; i &lt; <span class="hljs-number">3</span>; i++) {
  colors.push(
    colorHsluv(<span class="hljs-number">240</span>, <span class="hljs-number">100</span>, <span class="hljs-number">20</span> + (i * <span class="hljs-number">30</span>))
  )
}

fill(colors[<span class="hljs-number">0</span>]);
rect(<span class="hljs-number">0</span>, <span class="hljs-number">0</span>, width, height);
fill(colors[<span class="hljs-number">1</span>]);
rect(<span class="hljs-number">145</span>, <span class="hljs-number">95</span>, <span class="hljs-number">375</span>, <span class="hljs-number">200</span>);
fill(colors[<span class="hljs-number">2</span>]);
</code></pre>
<p><img src="../images/82.png" alt=""></p>
<p>&#x4E0B;&#x9762;&#xFF0C;&#x5728;&#x6240;&#x6709;&#x7EF4;&#x5EA6;&#x4E2D;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x6280;&#x672F;&#x3002;&#x7559;&#x610F;&#x8272;&#x8C03;&#x503C;&#x662F;&#x5982;&#x4F55;&#x9012;&#x589E;&#x7684;&#xFF0C;&#x800C;&#x9971;&#x548C;&#x5EA6;&#x548C;&#x4EAE;&#x5EA6;&#x503C;&#x662F;&#x5982;&#x4F55;&#x9012;&#x51CF;&#x7684;&#x3002;&#x6700;&#x540E;&#x7684;&#x7ED3;&#x679C;&#x662F;&#x4E00;&#x4E2A;&#x914D;&#x8272;&#x65B9;&#x6848;&#xFF0C;&#x5176;&#x4E2D;&#x7684;&#x80CC;&#x666F;&#x662F;&#x5149;&#x548C;&#x9971;&#x548C;&#xFF0C;&#x4F46;&#x524D;&#x9762;&#x7684;&#x989C;&#x8272;&#x662F;&#x8F83;&#x6697;&#x548C;&#x8F83;&#x5C11;&#x9971;&#x548C;&#x3002;</p>
<pre><code class="lang-javascript"><span class="hljs-keyword">var</span> colors = [];
<span class="hljs-keyword">for</span>(<span class="hljs-keyword">var</span> i = <span class="hljs-number">0</span>; i &lt; <span class="hljs-number">3</span>; i++) {
  colors.push(
    colorHsluv(
      <span class="hljs-number">100</span> + (i * <span class="hljs-number">80</span>),
      <span class="hljs-number">100</span> - (i * <span class="hljs-number">20</span>),
      <span class="hljs-number">90</span> - (i * <span class="hljs-number">30</span>)
    )
  )
}

fill(colors[<span class="hljs-number">0</span>]);
rect(<span class="hljs-number">0</span>, <span class="hljs-number">0</span>, width, height);
fill(colors[<span class="hljs-number">1</span>]);
rect(<span class="hljs-number">145</span>, <span class="hljs-number">95</span>, <span class="hljs-number">375</span>, <span class="hljs-number">200</span>);
fill(colors[<span class="hljs-number">2</span>]);
rect(<span class="hljs-number">85</span>, <span class="hljs-number">155</span>, <span class="hljs-number">375</span>, <span class="hljs-number">200</span>);
</code></pre>
<p><img src="../images/83.png" alt=""></p>
<p>&#x901A;&#x8FC7;&#x6DFB;&#x52A0;&#x4E00;&#x4E9B;&#x53D8;&#x91CF;&#x6765;&#x5B58;&#x50A8;&#x521D;&#x59CB;&#x989C;&#x8272;&#x503C;&#x4EE5;&#x53CA;&#x5B83;&#x4EEC;&#x5728;&#x5FAA;&#x73AF;&#x4E2D;&#x53D8;&#x66F4;&#x7684;&#x503C;&#xFF0C;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x4EE4;&#x4EBA;&#x60CA;&#x559C;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x6BCF;&#x6B21;&#x8FD0;&#x884C;&#x4EE3;&#x7801;&#x65F6;&#x4F7F;&#x7528;random()&#x51FD;&#x6570;&#x9009;&#x62E9;&#x4E0D;&#x540C;&#x7684;&#x503C;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x786C;&#x7F16;&#x7801;&#x8FD9;&#x4E9B;&#x53D8;&#x91CF;&#x3002;&#x4E0B;&#x9762;&#x8FD0;&#x884C;&#x4E09;&#x6B21;&#x76F8;&#x540C;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x4ECE;&#x76F8;&#x540C;&#x7684;&#x7B97;&#x6CD5;&#x4EA7;&#x751F;&#x4E09;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x914D;&#x8272;&#x65B9;&#x6848;&#x3002;&#x901A;&#x8FC7;&#x66F4;&#x6539;&#x4F20;&#x9012;&#x7ED9;<code>random()</code>&#x51FD;&#x6570;&#x7684;&#x503C;&#xFF0C;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x4EA7;&#x751F;&#x8BB8;&#x591A;&#x4E0D;&#x540C;&#x7684;&#x8F93;&#x51FA;&#x3002;</p>
<p><img src="../images/88.png" alt="">
<img src="../images/89.png" alt="">
<img src="../images/90.png" alt=""></p>
<pre><code class="lang-javascript"><span class="hljs-keyword">var</span> startHue = random(<span class="hljs-number">0</span>, <span class="hljs-number">360</span>);
<span class="hljs-keyword">var</span> startSat = random(<span class="hljs-number">40</span>, <span class="hljs-number">100</span>);
<span class="hljs-keyword">var</span> startLig = random(<span class="hljs-number">0</span>, <span class="hljs-number">60</span>);

How much should each color change?

<span class="hljs-keyword">var</span> changeHue = random(<span class="hljs-number">10</span>, <span class="hljs-number">120</span>);
<span class="hljs-keyword">var</span> changeSat = random(<span class="hljs-number">15</span>, <span class="hljs-number">40</span>);
<span class="hljs-keyword">var</span> changeLig = random(<span class="hljs-number">15</span>, <span class="hljs-number">40</span>)

<span class="hljs-keyword">var</span> colors = [];
<span class="hljs-keyword">for</span>(<span class="hljs-keyword">var</span> i = <span class="hljs-number">0</span>; i &lt; <span class="hljs-number">3</span>; i++) {
  colors.push(
    colorHsluv(
Use these values <span class="hljs-keyword">in</span> the same algorithm <span class="hljs-keyword">as</span> before

      startHue + (i * changeHue),
      startSat + (i * changeSat),
      startLig + (i * changeLig)
    )
  )
}

fill(colors[<span class="hljs-number">0</span>]);
rect(<span class="hljs-number">0</span>, <span class="hljs-number">0</span>, width, height);
fill(colors[<span class="hljs-number">1</span>]);
rect(<span class="hljs-number">145</span>, <span class="hljs-number">95</span>, <span class="hljs-number">375</span>, <span class="hljs-number">200</span>);
fill(colors[<span class="hljs-number">2</span>]);
rect(<span class="hljs-number">85</span>, <span class="hljs-number">155</span>, <span class="hljs-number">375</span>, <span class="hljs-number">200</span>);
</code></pre>
<p>&#x5728;&#x7ED3;&#x675F;&#x672C;&#x7AE0;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x4E0D;&#x8BA8;&#x8BBA;&#x7A0B;&#x5E8F;&#x989C;&#x8272;&#x751F;&#x6210;&#x7684;&#x53E6;&#x4E00;&#x79CD;&#x6709;&#x7528;&#x6280;&#x672F;<code>lerp()</code>&#x51FD;&#x6570;&#x2014;&#x2014;&#x5B83;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x8BA1;&#x7B97;&#x4E24;&#x79CD;&#x989C;&#x8272;&#x7684;&#x8F6C;&#x6362;&#x3002;<code>lerp()</code>&#x51FD;&#x6570;&#x4E0E;&#x989C;&#x8272;&#x65E0;&#x5173;,&#x56E0;&#x4E3A;&#x5B83;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x8BA1;&#x7B97;&#x4E24;&#x4E2A;&#x6570;&#x5B57;&#x4E4B;&#x95F4;&#x7684;&#x4EFB;&#x610F;&#x6570;&#x5B57;&#x3002;&#x51FD;&#x6570;&#x671F;&#x671B;&#x2014;&#x2014;&#x9664;&#x4E86;&#x4E24;&#x4E2A;&#x8303;&#x56F4;&#x7684;&#x6570;&#x5B57;&#x2014;&#x2014;&#x4E00;&#x4E2A;&#x63D2;&#x503C;&#x91CF;&#x6765;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x6570;&#x3002;&#x63D2;&#x503C;&#x91CF;0&#x5C06;&#x8FD4;&#x56DE;&#x7B2C;&#x4E00;&#x4E2A;&#x6570;&#x5B57;,0.5&#x5C06;&#x8FD4;&#x56DE;&#x4E24;&#x4E2A;&#x6570;&#x5B57;&#x4E2D;&#x95F4;&#x7684;&#x6570;&#x5B57;,1&#x5C06;&#x8FD4;&#x56DE;&#x7B2C;&#x4E8C;&#x4E2A;&#x6570;&#x5B57;&#x3002;</p>
<pre><code class="lang-javascript">lerp(<span class="hljs-number">0</span>, <span class="hljs-number">100</span>, <span class="hljs-number">0.2</span>) <span class="hljs-comment">// =&gt; 20</span>
lerp(<span class="hljs-number">0</span>, <span class="hljs-number">50</span>, <span class="hljs-number">0.5</span>) <span class="hljs-comment">// =&gt; 25</span>
lerp(<span class="hljs-number">0</span>, <span class="hljs-number">360</span>, <span class="hljs-number">0.8</span>) <span class="hljs-comment">// =&gt; 288</span>
</code></pre>
<p>&#x7531;&#x4E8E;&#x989C;&#x8272;&#x7531;&#x4E09;&#x4E2A;&#x6570;&#x503C;&#x7EC4;&#x6210;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x4E09;&#x6B21;&#x6765;&#x8BA1;&#x7B97;&#x4E24;&#x79CD;&#x989C;&#x8272;&#x4E4B;&#x95F4;&#x7684;&#x4EFB;&#x4F55;&#x989C;&#x8272;&#x3002;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;P5.js&#x6709;&#x4E00;&#x4E2A;<code>colorLerp()</code>&#x51FD;&#x6570;&#xFF0C;&#x5B83;&#x4EC5;&#x7528;&#x4E00;&#x884C;&#x4EE3;&#x7801;&#x6765;&#x8BA1;&#x7B97;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5B83;&#x53EA;&#x80FD;&#x5728;&#x5185;&#x7F6E;&#x7684;&#x989C;&#x8272;&#x6A21;&#x5F0F;&#x4E0B;&#x5DE5;&#x4F5C;&#xFF0C;&#x800C;&#x4E0D;&#x80FD;&#x5728;HSLuv&#x5E93;&#x4E2D;&#x5DE5;&#x4F5C;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x989C;&#x8272;&#x4ECB;&#x4E8E;&#x6DF1;&#x9971;&#x548C;&#x7684;&#x7EFF;&#x8272;&#x548C;&#x8F83;&#x6DE1;&#x7684;&#x53BB;&#x9971;&#x548C;&#x7684;&#x84DD;&#x8272;&#x4E4B;&#x95F4;&#x3002;</p>
<pre><code class="lang-javascript"><span class="hljs-keyword">var</span> h = lerp(<span class="hljs-number">120</span>, <span class="hljs-number">240</span>, <span class="hljs-number">0.5</span>);
Find saturation between <span class="hljs-number">95</span> and <span class="hljs-number">40</span>

<span class="hljs-keyword">var</span> s = lerp(<span class="hljs-number">96</span>, <span class="hljs-number">40</span>, <span class="hljs-number">0.5</span>);
Find lightness between <span class="hljs-number">31</span> and <span class="hljs-number">74</span>

<span class="hljs-keyword">var</span> l = lerp(<span class="hljs-number">31</span>, <span class="hljs-number">74</span>, <span class="hljs-number">0.5</span>);
<span class="hljs-keyword">var</span> midwayColor = colorHsluv(h, s, l);
</code></pre>
<p>&#x5F53;&#x4E0E;&#x5FAA;&#x73AF;&#x7ED3;&#x5408;&#x4F7F;&#x7528;&#x65F6;&#xFF0C;&#x8FD9;&#x79CD;&#x6280;&#x672F;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x5F3A;&#x5927;&#xFF0C;&#x5176;&#x4E2D;&#x63D2;&#x503C;&#x91CF;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;i&#x9664;&#x4EE5;&#x5176;&#x6700;&#x5927;&#x53EF;&#x80FD;&#x503C;&#x6765;&#x8BA1;&#x7B97;&#x3002;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x8BA1;&#x7B97;&#x662F;&#x7528;&#x9012;&#x589E;&#x7684;i&#x503C;&#x53CD;&#x590D;&#x6267;&#x884C;&#x7684;&#xFF0C;&#x5B83;&#x5C06;&#x4EA7;&#x751F;0&#x5230;1&#x4E4B;&#x95F4;&#x7684;&#x63D2;&#x503C;&#x91CF;&#xFF0C;&#x5176;&#x6B65;&#x9AA4;&#x6570;&#x7B49;&#x4E8E;&#x5FAA;&#x73AF;&#x8FD0;&#x884C;&#x7684;&#x6B21;&#x6570;&#x3002;&#x5F53;&#x7ED8;&#x5236;&#x4E24;&#x79CD;&#x989C;&#x8272;&#x4E4B;&#x95F4;&#x7684;&#x6E10;&#x53D8;&#x65F6;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x975E;&#x5E38;&#x6709;&#x7528;&#xFF0C;&#x5982;&#x4E0B;&#x9762;&#x7684;&#x793A;&#x4F8B;&#xFF0C;&#x5176;&#x4E2D;&#x91CD;&#x65B0;&#x521B;&#x5EFA;&#x4E86;&#x6765;&#x81EA;&#x8C37;&#x6B4C;&#x7684;<a href="https://material.io/guidelines/style/color.html" target="_blank">Material Design</a>&#x6587;&#x6863;&#x7684;&#x989C;&#x8272;&#x6837;&#x672C;&#x3002;</p>
<p><img src="../images/material-design-swatch.jpg" alt="">
<img src="../images/87.png" alt=""></p>
<blockquote>
<p>&#x6765;&#x81EA;Material Design&#xA9;&#x7684;&#x989C;&#x8272;&#x6837;&#x672C; &#x5728;&#x5FAA;&#x73AF;&#x4E2D;&#x4F7F;&#x7528;lerp()&#x51FD;&#x6570;&#x91CD;&#x65B0;&#x521B;&#x5EFA;&#x7684;&#x3002;</p>
</blockquote>
<pre><code class="lang-javascript"><span class="hljs-keyword">var</span> boxh = height / <span class="hljs-number">10</span>;
<span class="hljs-keyword">for</span>(<span class="hljs-keyword">var</span> i = <span class="hljs-number">0</span>; i &lt; <span class="hljs-number">10</span>; i++) {
  <span class="hljs-keyword">var</span> h = lerp(<span class="hljs-number">64</span>, <span class="hljs-number">22</span>, i / <span class="hljs-number">9</span>);
  <span class="hljs-keyword">var</span> s = lerp(<span class="hljs-number">86</span>, <span class="hljs-number">90</span>, i / <span class="hljs-number">9</span>);
  <span class="hljs-keyword">var</span> l = lerp(<span class="hljs-number">96</span>, <span class="hljs-number">56</span>, i / <span class="hljs-number">9</span>);
  fillHsluv(h, s, l);
  rect(<span class="hljs-number">0</span>, i * boxh, width, boxh);
}
</code></pre>
<p>&#x672C;&#x7AE0;&#x4ECB;&#x7ECD;&#x4E86;&#x5E2E;&#x52A9;&#x8BBE;&#x8BA1;&#x5E08;&#x901A;&#x8FC7;HSL&#x989C;&#x8272;&#x6A21;&#x578B;&#x7684;&#x8272;&#x8C03;&#x3001;&#x9971;&#x548C;&#x5EA6;&#x548C;&#x4EAE;&#x5EA6;&#x7EF4;&#x5EA6;&#x6765;&#x63A2;&#x7D22;&#x989C;&#x8272;&#x5149;&#x8C31;&#x7684;&#x6280;&#x672F;&#x3002;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x6280;&#x672F;,&#x8BBE;&#x8BA1;&#x5E08;&#x53EF;&#x4EE5;&#x4E0D;&#x518D;&#x4F7F;&#x7528;&#x989C;&#x8272;&#x9009;&#x62E9;&#x5668;&#x7684;2D&#x7EAF;&#x8272;,&#x5E76;&#x901A;&#x8FC7;&#x4E13;&#x6CE8;&#x4E8E;&#x4E09;&#x7EF4;&#x7A7A;&#x95F4;&#x4E2D;&#x989C;&#x8272;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x6765;&#x63A5;&#x8FD1;&#x989C;&#x8272;&#x7EC4;&#x5408;&#x3002;&#x8FD9;&#x4E9B;&#x6280;&#x672F;&#x662F;&#x5426;&#x88AB;&#x7528;&#x6765;&#x5FEB;&#x901F;&#x6D4B;&#x8BD5;&#x4E0D;&#x540C;&#x7684;&#x989C;&#x8272;&#x7EC4;&#x5408;,&#x6216;&#x8005;&#x76F4;&#x63A5;&#x6784;&#x5EFA;&#x5230;&#x6570;&#x5B57;&#x8BBE;&#x8BA1;&#x4EA7;&#x54C1;,&#x5BF9;&#x4E8E;&#x60F3;&#x8981;&#x5C06;&#x8BBE;&#x8BA1;&#x89C6;&#x4E3A;&#x7CFB;&#x7EDF;&#x827A;&#x672F;&#x7684;&#x8BBE;&#x8BA1;&#x5E08;&#x6765;&#x8BF4;&#xFF0C;&#x5B83;&#x4EEC;&#x90FD;&#x662F;&#x53E6;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x5DE5;&#x5177;&#x3002;</p>
<h3 id="&#x7EC3;&#x4E60;">&#x7EC3;&#x4E60;</h3>
<p>&#x4E3A;&#x4F60;&#x6700;&#x559C;&#x6B22;&#x7684;&#x4E66;&#x8BBE;&#x8BA1;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x4E66;&#x76AE;&#x3002;&#x8BBE;&#x8BA1;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;&#x57FA;&#x672C;&#x6216;&#x81EA;&#x5B9A;&#x4E49;&#x7684;&#x5F62;&#x72B6;&#xFF0C;&#x4F46;&#x6CA1;&#x6709;&#x6392;&#x7248;&#x3002;&#x4E00;&#x65E6;&#x4F60;&#x7684;&#x8BBE;&#x8BA1;&#x4F20;&#x8FBE;&#x4E86;&#x6545;&#x4E8B;&#x60C5;&#x8282;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x4E1C;&#x897F;&#xFF0C;&#x8003;&#x8651;&#x9700;&#x8981;&#x54EA;&#x79CD;&#x989C;&#x8272;&#x65B9;&#x6848;&#x6765;&#x652F;&#x6491;&#x4F60;&#x7684;&#x8BBE;&#x8BA1;&#x3002;&#x8BF7;&#x8BB0;&#x4F4F;&#xFF0C;&#x79D1;&#x5E7B;&#x60CA;&#x609A;&#x7247;&#x53EF;&#x80FD;&#x6BD4;&#x6D6A;&#x6F2B;&#x5C0F;&#x8BF4;&#x9700;&#x8981;&#x66F4;&#x591A;&#x4E0D;&#x540C;&#x7684;&#x989C;&#x8272;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x4F7F;&#x7528;&#x672C;&#x7AE0;&#x4ECB;&#x7ECD;&#x7684;&#x6280;&#x672F;&#x4E3A;&#x8BBE;&#x8BA1;&#x91CC;&#x7684;&#x5F62;&#x72B6;&#x4E0A;&#x8272;&#x3002;&#x4E0E;&#x5176;&#x5BF9;&#x989C;&#x8272;&#x8FDB;&#x884C;&#x786C;&#x7F16;&#x7801;&#xFF0C;&#x4E0D;&#x5982;&#x5C1D;&#x8BD5;&#x505A;&#x51FA;&#x6BCF;&#x6B21;&#x8FD0;&#x884C;&#x65F6;&#x989C;&#x8272;&#x65B9;&#x6848;&#x90FD;&#x4E0D;&#x76F8;&#x540C;&#x7684;&#x8BBE;&#x8BA1;&#x3002;&#x6311;&#x6218;&#x505A;&#x51FA;&#x4E00;&#x4E2A;&#x5177;&#x6709;&#x4E00;&#x81F4;&#x89C6;&#x89C9;&#x98CE;&#x683C;&#x7684;&#x52A8;&#x6001;&#x914D;&#x8272;&#x65B9;&#x6848;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="2.3.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 2.3 感知颜色空间的一致性">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"2.4 配色方案","level":"1.4.4","depth":2,"next":{"title":"3.布局","level":"1.5","depth":1,"ref":"","articles":[{"title":"3.1 几何图形简史","level":"1.5.1","depth":2,"path":"chapters/3.1.md","ref":"chapters/3.1.md","articles":[]},{"title":"未完持续更新...","level":"1.5.2","depth":2,"ref":"","articles":[]}]},"previous":{"title":"2.3 感知颜色空间的一致性","level":"1.4.3","depth":2,"path":"chapters/2.3.md","ref":"chapters/2.3.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"chapters/2.4.md","mtime":"2019-09-28T05:49:50.099Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-09-30T10:31:33.641Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

