
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>2.4 配色方案 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="2.3.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    设计系统编程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    0.设计系统
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="0.html">
            
                <a href="0.html">
            
                    
                    0.1.什么是设计系统
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    1.形状
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="1.1.html">
            
                <a href="1.1.html">
            
                    
                    1.1 图形基础
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="1.2.html">
            
                <a href="1.2.html">
            
                    
                    1.2 基本形状
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="1.3.html">
            
                <a href="1.3.html">
            
                    
                    1.3 定制形状
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="1.4.html">
            
                <a href="1.4.html">
            
                    
                    1.4 程序形状
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    2.颜色
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="2.1.html">
            
                <a href="2.1.html">
            
                    
                    2.1 颜色理论简史
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="2.2.html">
            
                <a href="2.2.html">
            
                    
                    2.2 颜色模型及颜色空间
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="2.3.html">
            
                <a href="2.3.html">
            
                    
                    2.3 感知颜色空间的一致性
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4.4" data-path="2.4.html">
            
                <a href="2.4.html">
            
                    
                    2.4 配色方案
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" >
            
                <span>
            
                    
                    3.布局
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="3.1.html">
            
                <a href="3.1.html">
            
                    
                    3.1 几何图形简史
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" >
            
                <span>
            
                    
                    未完持续更新...
            
                </span>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >2.4 配色方案</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x914D;&#x8272;&#x65B9;&#x6848;">&#x914D;&#x8272;&#x65B9;&#x6848;</h2>
<p>&#x8272;&#x5F69;&#x7684;&#x6709;&#x6548;&#x8FD0;&#x7528;&#x5BF9;&#x4E8E;&#x4EFB;&#x4F55;&#x8BBE;&#x8BA1;&#x9879;&#x76EE;&#x7684;&#x6210;&#x529F;&#x90FD;&#x662F;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x7684;&#x3002;&#x60F3;&#x8C61;&#x4E00;&#x4E0B;&#xFF0C;&#x4E00;&#x4E2A;&#x9EC4;&#x8272;&#x7684;&#x53EF;&#x53E3;&#x53EF;&#x4E50;&#x6807;&#x5FD7;&#x6216;&#x7528;&#x9971;&#x548C;&#x7C89;&#x8272;&#x7ED8;&#x5236;&#x7684;&#x8499;&#x5A1C;&#x4E3D;&#x838E;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x610F;&#x8BC6;&#x5230;&#x989C;&#x8272;&#x7684;&#x9009;&#x62E9;&#x5BF9;&#x4EFB;&#x4F55;&#x8BBE;&#x8BA1;&#x90FD;&#x6709;&#x5DE8;&#x5927;&#x7684;&#x5F71;&#x54CD;&#x3002;&#x8FD9;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x989C;&#x8272;&#x603B;&#x662F;&#x6709;&#x4E00;&#x4E2A;&#x660E;&#x786E;&#x7684;&#x7B26;&#x53F7;&#x5B66;&#x76EE;&#x7684;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#x505C;&#x8F66;&#x6807;&#x5FD7;&#x88AB;&#x6D82;&#x6210;&#x7EA2;&#x8272;&#x53EF;&#x80FD;&#x662F;&#x663E;&#x800C;&#x6613;&#x89C1;&#x7684;(&#x8B66;&#x544A;&#xFF0C;&#x5371;&#x9669;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5FFD;&#x89C6;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x5C31;&#x4F1A;&#x6709;&#x8840;&#x8FF9;)&#xFF0C;&#x4F46;&#x5927;&#x591A;&#x6570;&#x914D;&#x8272;&#x65B9;&#x6848;&#x90FD;&#x5F88;&#x96BE;&#x5982;&#x6B64;&#x76F4;&#x63A5;&#x5730;&#x89E3;&#x91CA;&#x3002;&#x8FD9;&#x7ED9;&#x6211;&#x4EEC;&#x7559;&#x4E0B;&#x4E86;&#x4E00;&#x79CD;&#x827A;&#x672F;&#x5F62;&#x5F0F;&#xFF0C;&#x5C31;&#x50CF;&#x5E73;&#x9762;&#x8BBE;&#x8BA1;&#x4E00;&#x822C;&#xFF0C;&#x65E2;&#x6709;&#x5BA2;&#x89C2;&#x7684;&#xFF0C;&#x4E5F;&#x6709;&#x4E3B;&#x89C2;&#x7684;&#x3002;&#x5BA2;&#x89C2;&#x5730;&#x8BF4;&#xFF0C;&#x5728;&#x767D;&#x8272;&#x80CC;&#x666F;&#x4E0A;&#x4F7F;&#x7528;&#x9EC4;&#x8272;&#x6587;&#x672C;&#x662F;&#x4E00;&#x4E2A;&#x574F;&#x4E3B;&#x610F;&#xFF0C;&#x56E0;&#x4E3A;&#x7F3A;&#x4E4F;&#x5BF9;&#x6BD4;&#x4F1A;&#x4F7F;&#x6587;&#x672C;&#x96BE;&#x4EE5;&#x9605;&#x8BFB;&#x3002;&#x540C;&#x6837;&#xFF0C;&#x5F53;&#x5168;&#x7403;&#x7EA6;8%&#x7684;&#x7537;&#x6027;&#x60A3;&#x6709;&#x7EA2;&#x7EFF;&#x8272;&#x76F2;&#x65F6;&#xFF0C;&#x4E0D;&#x5E94;&#x5C06;&#x7EA2;&#x8272;&#x548C;&#x7EFF;&#x8272;&#x4F5C;&#x4E3A;&#x6570;&#x636E;&#x53EF;&#x89C6;&#x5316;&#x7684;&#x4E3B;&#x8981;&#x989C;&#x8272;&#x3002;&#x5728;&#x5904;&#x7406;&#x989C;&#x8272;&#x65F6;&#xFF0C;&#x4E86;&#x89E3;&#x8FD9;&#x4E9B;&#x89C4;&#x5219;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x4F7F;&#x8BBE;&#x8BA1;&#x4EBA;&#x5458;&#x80FD;&#x591F;&#x521B;&#x9020;&#x5927;&#x591A;&#x6570;&#x7528;&#x6237;&#x90FD;&#x6613;&#x4E8E;&#x5BDF;&#x89C9;&#x7684;&#x56FE;&#x5F62;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x8981;&#x638C;&#x63E1;&#x8272;&#x5F69;&#x7EC4;&#x5408;&#x7684;&#x827A;&#x672F;&#xFF0C;&#x8BBE;&#x8BA1;&#x5E08;&#x8FD8;&#x5FC5;&#x987B;&#x77E5;&#x9053;&#x8272;&#x5F69;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x6587;&#x5316;&#x548C;&#x8BED;&#x5883;&#x4E2D;&#x7684;&#x8FD0;&#x7528;&#xFF0C;&#x89C2;&#x5BDF;&#x5F53;&#x524D;&#x827A;&#x672F;&#x7684;&#x8D8B;&#x52BF;&#xFF0C;&#x5E76;&#x5728;&#x6B64;&#x57FA;&#x7840;&#x4E0A;&#x5F62;&#x6210;&#x81EA;&#x5DF1;&#x7684;&#x98CE;&#x683C;&#x3002;&#x6B63;&#x56E0;&#x4E3A;&#x5982;&#x6B64;&#xFF0C;&#x8BB8;&#x591A;&#x4F5C;&#x8005;&#x4E00;&#x76F4;&#x5728;&#x52AA;&#x529B;&#x521B;&#x9020;&#x4E00;&#x79CD;&#x6559;&#x8BBE;&#x8BA1;&#x5E08;&#x5982;&#x4F55;&#x601D;&#x8003;&#x8272;&#x5F69;&#x7EC4;&#x5408;&#x7684;&#x597D;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x4E00;&#x79CD;&#x6D41;&#x884C;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x6839;&#x636E;&#x6BCF;&#x4E2A;&#x65B9;&#x6848;&#x4E2D;&#x989C;&#x8272;&#x7684;&#x8272;&#x8C03;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x6765;&#x521B;&#x5EFA;&#x989C;&#x8272;&#x65B9;&#x6848;&#x7684;&#x7C7B;&#x522B;&#x3002;&#x8FD9;&#x4E9B;&#x7C7B;&#x522B;&#x88AB;&#x547D;&#x540D;&#x4E3A;&#x4E92;&#x8865;&#x8272;&#xFF08;&#x4E24;&#x79CD;&#x989C;&#x8272;&#x5177;&#x6709;&#x76F8;&#x53CD;&#x7684;&#x8272;&#x8C03;&#xFF09;&#x3001;&#x4E09;&#x8272;&#xFF08;&#x4E09;&#x79CD;&#x989C;&#x8272;&#x5747;&#x5300;&#x5206;&#x5E03;&#x5728;&#x8272;&#x8C31;&#x4EEA;&#x4E0A;&#xFF09;&#x548C;&#x56DB;&#x8272;&#xFF08;&#x56DB;&#x79CD;&#x989C;&#x8272;&#x5747;&#x5300;&#x5206;&#x5E03;&#x5728;&#x8272;&#x8C31;&#x4EEA;&#x4E0A;&#xFF09;&#x3002;&#x4F5C;&#x8005;&#x8FD8;&#x5305;&#x62EC;&#x4E00;&#x4E2A;&#x66F4;&#x6DF7;&#x5408;&#x7684;&#x7C7B;&#x522B;&#x96C6;&#xFF0C;&#x7528;&#x4E8E;&#x4E0D;&#x9002;&#x5408;&#x4EFB;&#x4F55;&#x524D;&#x4E00;&#x4E2A;&#x7C7B;&#x522B;&#x7684;&#x914D;&#x8272;&#x65B9;&#x6848;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x4E4B;&#x6240;&#x4EE5;&#x53D7;&#x6B22;&#x8FCE;&#xFF0C;&#x4E00;&#x4E2A;&#x539F;&#x56E0;&#x53EF;&#x80FD;&#x662F;&#x6559;&#x5E08;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5728;&#x5F69;&#x8272;&#x5706;&#x5708;&#x4E0A;&#x653E;&#x7F6E;&#x5F62;&#x72B6;&#x6765;&#x53EF;&#x89C6;&#x5316;&#x7C7B;&#x522B;&#xFF0C;&#x5B66;&#x751F;&#x53EF;&#x4EE5;&#x6539;&#x53D8;&#x8FD9;&#x4E9B;&#x5F62;&#x72B6;&#x7684;&#x5C3A;&#x5BF8;&#x6765;&#x521B;&#x5EFA;&#x4E0D;&#x540C;&#x7684;&#x989C;&#x8272;&#x65B9;&#x6848;&#x3002;&#x8FD9;&#x9879;&#x6280;&#x672F;&#x5728;&#x8BB8;&#x591A;&#x5173;&#x4E8E;&#x5E73;&#x9762;&#x8BBE;&#x8BA1;&#x7684;&#x4E66;&#x4E2D;&#x90FD;&#x6709;&#x63CF;&#x8FF0;&#xFF0C;&#x4F60;&#x5728;&#x8BBE;&#x8BA1;&#x8BC4;&#x8BBA;&#x4E2D;&#x7ECF;&#x5E38;&#x4F1A;&#x9047;&#x5230;&#x8FD9;&#x4E9B;&#x672F;&#x8BED;&#x3002;</p>
<p><img src="../images/62.png" alt=""></p>
<blockquote>
<p>&#x4E00;&#x79CD;&#x7531;&#x4E09;&#x79CD;&#x5747;&#x5300;&#x95F4;&#x9694;&#x7684;&#x8272;&#x8C03;&#x6784;&#x6210;&#x7684;&#x4E09;&#x8FDB;&#x8272;&#x7CFB;</p>
</blockquote>
<p><img src="../images/63.png" alt=""></p>
<blockquote>
<p>&#x4E00;&#x79CD;&#x7531;&#x56DB;&#x79CD;&#x5747;&#x5300;&#x95F4;&#x9694;&#x7684;&#x8272;&#x8C03;&#x6784;&#x6210;&#x7684;&#x56DB;&#x8FDB;&#x8272;&#x7CFB;</p>
</blockquote>
<p>&#x5C3D;&#x7BA1;&#x8FD9;&#x79CD;&#x7CFB;&#x7EDF;&#x5316;&#x7684;&#x65B9;&#x6CD5;&#x4F3C;&#x4E4E;&#x975E;&#x5E38;&#x9002;&#x5408;&#x8FD9;&#x672C;&#x4E66;&#xFF0C;&#x4F46;&#x6211;&#x8BA4;&#x4E3A;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x5B58;&#x5728;&#x5F88;&#x5927;&#x7684;&#x95EE;&#x9898;&#x3002;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x5355;&#x4E00;&#x7C7B;&#x522B;&#x5185;&#x7684;&#x989C;&#x8272;&#x65B9;&#x6848;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x8FDE;&#x8D2F;&#x7684;&#x89C6;&#x89C9;&#x6548;&#x679C;&#x3002;&#x5982;&#x679C;&#x7A0D;&#x5FAE;&#x8C03;&#x6574;&#x8272;&#x8C03;&#x4E4B;&#x95F4;&#x7684;&#x95F4;&#x8DDD;&#xFF0C;&#x4E09;&#x8272;&#x548C;&#x56DB;&#x8272;&#x7684;&#x914D;&#x8272;&#x65B9;&#x6848;&#x53EF;&#x80FD;&#x770B;&#x8D77;&#x6765;&#x975E;&#x5E38;&#x76F8;&#x4F3C;&#xFF0C;&#x751A;&#x81F3;&#x5B8C;&#x5168;&#x76F8;&#x540C;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x5728;sRGB&#x989C;&#x8272;&#x7A7A;&#x95F4;&#x4E2D;&#xFF0C;&#x7EAF;&#x4E09;&#x5143;&#x7EC4;&#x989C;&#x8272;&#x65B9;&#x6848;&#x7684;&#x89C6;&#x89C9;&#x6548;&#x679C;&#x4E0E;CIELUV&#x4E2D;&#x7684;&#x76F8;&#x540C;&#x989C;&#x8272;&#x65B9;&#x6848;&#x975E;&#x5E38;&#x4E0D;&#x540C;&#x3002;&#x6700;&#x7CDF;&#x7CD5;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x503E;&#x5411;&#x4E8E;&#x5FFD;&#x7565;&#x9971;&#x548C;&#x5EA6;&#x548C;&#x660E;&#x5EA6;&#x7EF4;&#x5EA6;&#xFF0C;&#x8FD9;&#x4E9B;&#x7EF4;&#x5EA6;&#x7559;&#x7ED9;&#x8BBE;&#x8BA1;&#x5E08;&#x81EA;&#x5DF1;&#x53BB;&#x89E3;&#x51B3;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x4E09;&#x79CD;&#x989C;&#x8272;&#x65B9;&#x6848;&#x90FD;&#x6709;&#x76F8;&#x540C;&#x7684;&#x8272;&#x8C03;&#x503C;&#xFF0C;&#x4F46;&#x662F;&#x901A;&#x8FC7;&#x6539;&#x53D8;&#x5B83;&#x4EEC;&#x7684;&#x9971;&#x548C;&#x5EA6;&#x548C;&#x660E;&#x5EA6;&#x503C;&#x6765;&#x4EA7;&#x751F;&#x622A;&#x7136;&#x4E0D;&#x540C;&#x7684;&#x89C6;&#x89C9;&#x6548;&#x679C;&#x3002;&#x4E00;&#x4E2A;&#x5FFD;&#x7565;&#x4E09;&#x5206;&#x4E4B;&#x4E8C;&#x989C;&#x8272;&#x7EF4;&#x5EA6;&#x7684;&#x8272;&#x5F69;&#x7406;&#x8BBA;&#x5C06;&#x65E0;&#x6CD5;&#x5E2E;&#x52A9;&#x8BBE;&#x8BA1;&#x5E08;&#x505A;&#x51FA;&#x66F4;&#x597D;&#x7684;&#x51B3;&#x7B56;&#x3002;</p>
<p><img src="../images/64.png" alt=""></p>
<p><img src="../images/65.png" alt=""></p>
<p><img src="../images/66.png" alt=""></p>
<blockquote>
<p>&#x8FD9;&#x4E09;&#x79CD;&#x989C;&#x8272;&#x65B9;&#x6848;&#x5177;&#x6709;&#x76F8;&#x540C;&#x7684;&#x8272;&#x8C03;&#x503C;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x989C;&#x8272;&#x5706;&#x4E0A;&#x7ED8;&#x5236;&#x65F6;&#x770B;&#x8D77;&#x6765;&#x76F8;&#x540C;&#x3002;&#x201C;&#x4E09;&#x5143;&#x201D;&#x4E00;&#x8BCD;&#x65E0;&#x52A9;&#x4E8E;&#x63CF;&#x8FF0;&#x5B83;&#x4EEC;&#x72EC;&#x7279;&#x7684;&#x89C6;&#x89C9;&#x6548;&#x679C;&#x3002;</p>
</blockquote>
<p>&#x76F8;&#x53CD;&#xFF0C;&#x672C;&#x7AE0;&#x5C06;&#x56F4;&#x7ED5;HSL&#x989C;&#x8272;&#x6A21;&#x578B;&#x7684;&#x4E09;&#x4E2A;&#x7EF4;&#x5EA6;&#x6784;&#x5EFA;&#x7684;&#x989C;&#x8272;&#x7406;&#x8BBA;&#x3002;&#x901A;&#x8FC7;&#x5173;&#x6CE8;&#x989C;&#x8272;&#x7684;&#x8272;&#x8C03;&#x3001;&#x9971;&#x548C;&#x5EA6;&#x548C;&#x4EAE;&#x5EA6;&#x2014;&#x2014;&#x4EE5;&#x53CA;&#x8FD9;&#x4E9B;&#x7EF4;&#x5EA6;&#x5982;&#x4F55;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#x2014;&#x2014;&#x8BBE;&#x8BA1;&#x5E08;&#x53EF;&#x4EE5;&#x4E86;&#x89E3;&#x4EE3;&#x7801;&#x4E2D;&#x7684;&#x53D8;&#x5316;&#x5982;&#x4F55;&#x5728;&#x89C6;&#x89C9;&#x4E0A;&#x53CD;&#x6620;&#x51FA;&#x6765;&#xFF0C;&#x5E76;&#x6839;&#x636E;&#x8FD9;&#x4E9B;&#x77E5;&#x8BC6;&#x7EC4;&#x5408;&#x6709;&#x8DA3;&#x7684;&#x989C;&#x8272;&#x3002;&#x5728;&#x4E0B;&#x9762;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4EE5;&#x76F8;&#x53CD;&#x7684;&#x987A;&#x5E8F;&#x904D;&#x5386;&#x8FD9;&#x4E9B;&#x7EF4;&#x5EA6;&#xFF0C;&#x4F7F;&#x7528;<a href="https://www.programmingdesignsystems.com/color/perceptually-uniform-color-spaces/index.html#hsluv" target="_blank">HSLuv&#x5E93;</a>&#x6765;&#x786E;&#x4FDD;&#x4EE3;&#x7801;&#x4E2D;&#x7684;&#x66F4;&#x6539;&#x53CD;&#x6620;&#x4E86;&#x989C;&#x8272;&#x7684;&#x5B9E;&#x9645;&#x611F;&#x77E5;&#x66F4;&#x6539;&#x3002;</p>
<h3 id="&#x4EAE;&#x5EA6;">&#x4EAE;&#x5EA6;</h3>
<p>&#x989C;&#x8272;&#x7684;&#x4EAE;&#x5EA6;&#x51B3;&#x5B9A;&#x4E86;&#x989C;&#x8272;&#x4E2D;&#x6DF7;&#x5408;&#x4E86;&#x591A;&#x5C11;&#x9ED1;&#x8272;(&#x53C2;&#x89C1;<a href="https://www.programmingdesignsystems.com/color/color-models-and-color-spaces/index.html#hsl-description" target="_blank">&#x989C;&#x8272;&#x6A21;&#x578B;&#x548C;&#x989C;&#x8272;&#x7A7A;&#x95F4;</a>)&#x3002;&#x660E;&#x6697;&#x5BF9;&#x6BD4;&#x662F;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x5BF9;&#x6BD4;&#xFF0C;&#x5373;&#x4F7F;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x63A7;&#x5236;HSL&#x7684;&#x4EFB;&#x4F55;&#x7EF4;&#x5EA6;&#x6765;&#x521B;&#x5EFA;&#x989C;&#x8272;&#x4E4B;&#x95F4;&#x7684;&#x5BF9;&#x6BD4;&#xFF0C;&#x201C;&#x5BF9;&#x6BD4;&#x201D;&#x8FD9;&#x4E2A;&#x672F;&#x8BED;&#x5927;&#x591A;&#x6570;&#x65F6;&#x5019;&#x6307;&#x7684;&#x662F;&#x4EAE;&#x5EA6;&#x7684;&#x53D8;&#x5316;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x6F14;&#x793A;&#x4E86;&#x4F4E;&#x5BF9;&#x6BD4;&#x5EA6;&#x548C;&#x9AD8;&#x5BF9;&#x6BD4;&#x5EA6;&#x914D;&#x8272;&#x65B9;&#x6848;&#x7684;&#x6548;&#x679C;&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x662F;&#x67D4;&#x548C;&#x548C;&#x8F7B;&#xFF0C;&#x8FD9;&#x662F;&#x7531;&#x4E8E;&#x4EAE;&#x5EA6;&#x503C;&#x9AD8;&#xFF0C;&#x6BCF;&#x79CD;&#x989C;&#x8272;&#x4E4B;&#x95F4;&#x7684;&#x4EAE;&#x5EA6;&#x5DEE;&#x5F02;&#x5F88;&#x5C0F;&#x3002;&#x7B2C;&#x4E8C;&#x4E2A;&#x4F8B;&#x5B50;&#x663E;&#x5F97;&#x66F4;&#x5927;&#x80C6;&#xFF0C;&#x5E76;&#x4E14;&#x7531;&#x4E8E;&#x76F8;&#x90BB;&#x989C;&#x8272;&#x4EAE;&#x5EA6;&#x7684;&#x5DE8;&#x5927;&#x5DEE;&#x5F02;&#x800C;&#x4EA7;&#x751F;&#x4E86;&#x663E;&#x8457;&#x7684;&#x6B63;&#x9762;/&#x8D1F;&#x9762;&#x5F71;&#x54CD;&#x3002;</p>
<p><img src="../images/67.png" alt=""></p>
<blockquote>
<p>&#x4F4E;&#x5BF9;&#x6BD4;&#x5EA6;&#x7684;&#x914D;&#x8272;&#x65B9;&#x6848;</p>
</blockquote>
<pre><code class="lang-javascript">fillHsluv(<span class="hljs-number">0</span>, <span class="hljs-number">0</span>, <span class="hljs-number">90</span>);
rect(<span class="hljs-number">0</span>, <span class="hljs-number">0</span>, width, height);
fillHsluv(<span class="hljs-number">0</span>, <span class="hljs-number">0</span>, <span class="hljs-number">85</span>);
rect(<span class="hljs-number">145</span>, <span class="hljs-number">95</span>, <span class="hljs-number">375</span>, <span class="hljs-number">200</span>);
fillHsluv(<span class="hljs-number">0</span>, <span class="hljs-number">0</span>, <span class="hljs-number">95</span>);
rect(<span class="hljs-number">85</span>, <span class="hljs-number">155</span>, <span class="hljs-number">375</span>, <span class="hljs-number">200</span>);
</code></pre>
<p><img src="../images/68.png" alt=""></p>
<blockquote>
<p>&#x9AD8;&#x5BF9;&#x6BD4;&#x5EA6;&#x7684;&#x914D;&#x8272;&#x65B9;&#x6848;</p>
</blockquote>
<pre><code class="lang-javascript">fillHsluv(<span class="hljs-number">0</span>, <span class="hljs-number">0</span>, <span class="hljs-number">0</span>);
rect(<span class="hljs-number">0</span>, <span class="hljs-number">0</span>, width, height);
fillHsluv(<span class="hljs-number">0</span>, <span class="hljs-number">0</span>, <span class="hljs-number">50</span>);
rect(<span class="hljs-number">145</span>, <span class="hljs-number">95</span>, <span class="hljs-number">375</span>, <span class="hljs-number">200</span>);
fillHsluv(<span class="hljs-number">0</span>, <span class="hljs-number">0</span>, <span class="hljs-number">100</span>);
rect(<span class="hljs-number">85</span>, <span class="hljs-number">155</span>, <span class="hljs-number">375</span>, <span class="hljs-number">200</span>);
</code></pre>
<p>Muriel Cooper&#x662F;&#x4E00;&#x4F4D;&#x975E;&#x5E38;&#x6709;&#x5F71;&#x54CD;&#x529B;&#x7684;&#x5E73;&#x9762;&#x8BBE;&#x8BA1;&#x5E08;&#xFF0C;&#x5979;&#x5728;&#x65E9;&#x671F;&#x7684;&#x6570;&#x5B57;&#x8BBE;&#x8BA1;&#x548C;&#x7528;&#x6237;&#x754C;&#x9762;&#x8BBE;&#x8BA1;&#x65B9;&#x9762;&#x505A;&#x51FA;&#x4E86;&#x91CD;&#x8981;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x4F5C;&#x4E3A;&#x9EBB;&#x7701;&#x7406;&#x5DE5;&#x5B66;&#x9662;&#x5A92;&#x4F53;&#x5B9E;&#x9A8C;&#x5BA4;(MIT Media Lab)&#x7684;&#x8054;&#x5408;&#x521B;&#x59CB;&#x4EBA;&#x548C;&#x9EBB;&#x7701;&#x7406;&#x5DE5;&#x5B66;&#x9662;&#x51FA;&#x7248;&#x793E;(MIT Press)&#x7684;&#x8BBE;&#x8BA1;&#x603B;&#x76D1;&#xFF0C;&#x5979;&#x7BA1;&#x7406;&#x7740;&#x8D85;&#x8FC7;500&#x672C;&#x4E66;&#x7684;&#x5236;&#x4F5C;&#xFF0C;&#x5979;&#x7684;&#x9ED1;&#x767D;&#x8BBE;&#x8BA1;&#x5E7F;&#x4E3A;&#x4EBA;&#x77E5;&#x3002;&#x4E0B;&#x9762;&#x662F;&#x5979;&#x7684;&#x4E24;&#x4E2A;&#x66F4;&#x8457;&#x540D;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x5B8C;&#x5168;&#x4F9D;&#x8D56;&#x4E8E;&#x4EAE;&#x5EA6;&#x7684;&#x7EAC;&#x5EA6;&#x3002;</p>
<p><img src="../images/mit-press.jpg" alt=""></p>
<blockquote>
<p>MIT Press &#xA9;. &#x56FE;&#x6807;</p>
</blockquote>
<p><img src="../images/bauhaus-book.jpg" alt=""></p>
<blockquote>
<p>MIT Press &#xA9;&#x300A;&#x5305;&#x8C6A;&#x65AF;&#x300B;&#x4E00;&#x4E66;&#x5C01;&#x9762;&#x8BBE;&#x8BA1;</p>
</blockquote>
<p>&#x5728;&#x5904;&#x7406;&#x6587;&#x672C;&#x65F6;&#xFF0C;&#x9009;&#x62E9;&#x5408;&#x9002;&#x7684;&#x5BF9;&#x6BD4;&#x5EA6;&#x5C24;&#x5176;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x53EF;&#x8BFB;&#x6027;&#x662F;&#x7531;&#x6587;&#x672C;&#x548C;&#x80CC;&#x666F;&#x4E4B;&#x95F4;&#x7684;&#x5BF9;&#x6BD4;&#x5EA6;&#x51B3;&#x5B9A;&#x7684;&#x3002;&#x4E07;&#x7EF4;&#x7F51;&#x8054;&#x76DF;(World Wide Web Consortium)&#x5728;&#x5176;<a href="https://www.w3.org/TR/UNDERSTANDING-WCAG20/visual-audio-contrast-contrast.html" target="_blank">Web&#x5185;&#x5BB9;&#x53EF;&#x89E6;&#x8FBE;&#x6027;&#x6307;&#x5357;</a>&#x4E2D;&#x5EFA;&#x8BAE;&#xFF0C;&#x6B63;&#x6587;&#x6587;&#x672C;&#x7684;&#x5BF9;&#x6BD4;&#x5EA6;&#x5E94;&#x81F3;&#x5C11;&#x4E3A;4.5:1(&#x6216;&#x5C0F;&#x4E8E;0.222)&#xFF0C;&#x5E76;&#x4E14;&#x4ED6;&#x4EEC;&#x63D0;&#x4F9B;&#x4E86;&#x4EE5;&#x4E0B;&#x516C;&#x5F0F;&#x6765;&#x8BA1;&#x7B97;&#x4E24;&#x4E2A;&#x4EAE;&#x5EA6;&#x503C;&#x7684;&#x5BF9;&#x6BD4;&#x5EA6;&#x3002;</p>
<pre><code class="lang-javasciprt">var contrastRatio = (l1 + 0.05) / (l2 + 0.05);
</code></pre>
<p>&#x8FD9;&#x4E2A;&#x516C;&#x5F0F;&#x8981;&#x6C42;&#x5728;&#x76F8;&#x5BF9;&#x4EAE;&#x5EA6;&#x4E2D;&#x63D0;&#x4F9B;&#x4E24;&#x4E2A;&#x4EAE;&#x5EA6;&#x503C;&#xFF0C;&#x5373;CIEXYZ&#x989C;&#x8272;&#x7A7A;&#x95F4;&#x4E2D;&#x7684;Y&#x7EF4;&#x3002;&#x4E3A;&#x4E86;&#x8BA1;&#x7B97;HSLuv&#x989C;&#x8272;&#x7684;W3C&#x5BF9;&#x6BD4;&#x5EA6;&#xFF0C;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x9700;&#x8981;&#x5C06;&#x4EAE;&#x5EA6;&#x503C;&#x8F6C;&#x6362;&#x4E3A;CIEXYZ&#x989C;&#x8272;&#x7A7A;&#x95F4;&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;&#x4E0A;&#x9762;&#x7684;&#x516C;&#x5F0F;&#x8BA1;&#x7B97;&#x5BF9;&#x6BD4;&#x5EA6;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x793A;&#x4F8B;&#x6F14;&#x793A;&#x4E86;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x5176;&#x4E2D;<code>contrastRatio()</code>&#x51FD;&#x6570;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x4E24;&#x4E2A;HSLuv&#x4EAE;&#x5EA6;&#x503C;&#x8BA1;&#x7B97;&#x5BF9;&#x6BD4;&#x5EA6;&#x3002;</p>
<pre><code class="lang-javascript"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">lightnessToLuminance</span>(<span class="hljs-params">l</span>) </span>{
  <span class="hljs-keyword">if</span> (l &lt;= <span class="hljs-number">8</span>) {
    <span class="hljs-keyword">return</span> <span class="hljs-number">1.0</span> * l / <span class="hljs-number">903.2962962</span>;
  } <span class="hljs-keyword">else</span> {
    <span class="hljs-keyword">return</span> <span class="hljs-number">1.0</span> * <span class="hljs-built_in">Math</span>.pow((l + <span class="hljs-number">16</span>) / <span class="hljs-number">116</span>, <span class="hljs-number">3</span>);
  }
}

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">contrastRatio</span>(<span class="hljs-params">l1, l2</span>) </span>{
  l1 = lightnessToLuminance(l1);
  l2 = lightnessToLuminance(l2);
  <span class="hljs-keyword">return</span> (l1 + <span class="hljs-number">0.05</span>) / (l2 + <span class="hljs-number">0.05</span>);
}

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">setup</span>(<span class="hljs-params"></span>) </span>{
  <span class="hljs-built_in">console</span>.log(contrastRatio(<span class="hljs-number">40</span>, <span class="hljs-number">70</span>)); <span class="hljs-comment">// BAD! 0.35521707859730733</span>
  <span class="hljs-built_in">console</span>.log(contrastRatio(<span class="hljs-number">40</span>, <span class="hljs-number">90</span>)); <span class="hljs-comment">// GOOD! 0.19988073069469958</span>
}
</code></pre>
<p>&#x4EAE;&#x5EA6;&#x5728;&#x4EFB;&#x4F55;&#x914D;&#x8272;&#x65B9;&#x6848;&#x4E2D;&#x90FD;&#x626E;&#x6F14;&#x7740;&#x91CD;&#x8981;&#x7684;&#x89D2;&#x8272;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x5728;&#x53EF;&#x89E6;&#x8FBE;&#x6027;&#x8FD8;&#x662F;&#x7F8E;&#x89C2;&#x65B9;&#x9762;&#x3002;&#x548C;&#x672C;&#x4E66;&#x524D;&#x9762;&#x7684;&#x7EC3;&#x4E60;&#x4E00;&#x6837;&#xFF0C;&#x5EFA;&#x8BAE;&#x6709;&#x62B1;&#x8D1F;&#x7684;&#x8BBE;&#x8BA1;&#x5E08;&#x53EA;&#x7EC3;&#x4E60;&#x9ED1;&#x767D;&#x8BBE;&#x8BA1;&#xFF0C;&#x4EE5;&#x5B66;&#x4E60;&#x5982;&#x4F55;&#x5728;&#x4ED6;&#x4EEC;&#x7684;&#x8BBE;&#x8BA1;&#x4E2D;&#x5EFA;&#x7ACB;&#x9002;&#x5F53;&#x7684;&#x5BF9;&#x6BD4;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x8BBE;&#x8BA1;&#x770B;&#x8D77;&#x6765;&#x5F88;&#x6742;&#x4E71;&#xFF0C;&#x201C;&#x5B83;&#x5728;&#x9ED1;&#x8272;&#x548C;&#x767D;&#x8272;&#x4E2D;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x5B50;&#x7684;&#x201D;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x53EF;&#x4EE5;&#x63ED;&#x793A;&#x51FA;&#x5728;&#x8BBE;&#x8BA1;&#x4E2D;&#x5F62;&#x72B6;&#x4E4B;&#x95F4;&#x7F3A;&#x4E4F;&#x5BF9;&#x6BD4;&#x3002;</p>
<h3 id="&#x9971;&#x548C;&#x5EA6;">&#x9971;&#x548C;&#x5EA6;</h3>
<p>&#x989C;&#x8272;&#x7684;&#x9971;&#x548C;&#x5EA6;&#x63A7;&#x5236;&#x989C;&#x8272;&#x4ECE;&#x7070;&#x5EA6;&#x5230;&#x5168;&#x8272;&#x7684;&#x7EAF;&#x5EA6;(&#x53C2;&#x89C1;&#x989C;&#x8272;&#x6A21;&#x578B;&#x548C;&#x989C;&#x8272;&#x7A7A;&#x95F4;)&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x7EF4;&#x5EA6;&#x521B;&#x5EFA;&#x4ECE;&#x975E;&#x5E38;&#x67D4;&#x548C;&#x5230;&#x975E;&#x5E38;&#x660E;&#x4EAE;&#x7684;&#x989C;&#x8272;&#x7EC4;&#x5408;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x4E24;&#x4E2A;&#x4F8B;&#x5B50;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x660E;&#x5EA6;&#x548C;&#x8272;&#x8C03;&#x503C;&#xFF0C;&#x53EA;&#x662F;&#x9971;&#x548C;&#x5EA6;&#x4E0D;&#x540C;&#x3002;</p>
<p><img src="../images/69.png" alt=""></p>
<blockquote>
<p>&#x51CF;&#x9971;&#x548C;&#x5EA6;&#x8272;&#x5F69;&#x65B9;&#x6848;</p>
</blockquote>
<pre><code class="lang-javascript">fillHsluv(<span class="hljs-number">40</span>, <span class="hljs-number">30</span>, <span class="hljs-number">65</span>);
rect(<span class="hljs-number">0</span>, <span class="hljs-number">0</span>, width, height);
fillHsluv(<span class="hljs-number">10</span>, <span class="hljs-number">40</span>, <span class="hljs-number">40</span>);
rect(<span class="hljs-number">145</span>, <span class="hljs-number">95</span>, <span class="hljs-number">375</span>, <span class="hljs-number">200</span>);
fillHsluv(<span class="hljs-number">75</span>, <span class="hljs-number">50</span>, <span class="hljs-number">85</span>);
rect(<span class="hljs-number">85</span>, <span class="hljs-number">155</span>, <span class="hljs-number">375</span>, <span class="hljs-number">200</span>);
</code></pre>
<p><img src="../images/70.png" alt=""></p>
<blockquote>
<p>&#x9971;&#x548C;&#x5EA6;&#x65B9;&#x6848;</p>
</blockquote>
<pre><code class="lang-javascript">fillHsluv(<span class="hljs-number">40</span>, <span class="hljs-number">100</span>, <span class="hljs-number">65</span>);
rect(<span class="hljs-number">0</span>, <span class="hljs-number">0</span>, width, height);
fillHsluv(<span class="hljs-number">10</span>, <span class="hljs-number">100</span>, <span class="hljs-number">40</span>);
rect(<span class="hljs-number">145</span>, <span class="hljs-number">95</span>, <span class="hljs-number">375</span>, <span class="hljs-number">200</span>);
fillHsluv(<span class="hljs-number">75</span>, <span class="hljs-number">100</span>, <span class="hljs-number">85</span>);
rect(<span class="hljs-number">85</span>, <span class="hljs-number">155</span>, <span class="hljs-number">375</span>, <span class="hljs-number">200</span>);
</code></pre>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="2.3.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 2.3 感知颜色空间的一致性">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"2.4 配色方案","level":"1.4.4","depth":2,"next":{"title":"3.布局","level":"1.5","depth":1,"ref":"","articles":[{"title":"3.1 几何图形简史","level":"1.5.1","depth":2,"path":"chapters/3.1.md","ref":"chapters/3.1.md","articles":[]},{"title":"未完持续更新...","level":"1.5.2","depth":2,"ref":"","articles":[]}]},"previous":{"title":"2.3 感知颜色空间的一致性","level":"1.4.3","depth":2,"path":"chapters/2.3.md","ref":"chapters/2.3.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"chapters/2.4.md","mtime":"2019-09-26T03:08:28.390Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-09-27T12:54:50.956Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

