
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>3.1 几何图形简史 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    系统设计编程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    0.系统设计
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="0.html">
            
                <a href="0.html">
            
                    
                    0.1.什么是系统设计
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    1.形状
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="1.1.html">
            
                <a href="1.1.html">
            
                    
                    1.1 图形基础
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="1.2.html">
            
                <a href="1.2.html">
            
                    
                    1.2 基本形状
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="1.3.html">
            
                <a href="1.3.html">
            
                    
                    1.3 定制形状
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="1.4.html">
            
                <a href="1.4.html">
            
                    
                    1.4 程序形状
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    2.颜色
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="2.1.html">
            
                <a href="2.1.html">
            
                    
                    2.1 颜色理论简史
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="2.2.html">
            
                <a href="2.2.html">
            
                    
                    2.2 颜色模型及颜色空间
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="2.3.html">
            
                <a href="2.3.html">
            
                    
                    2.3 感知颜色空间的一致性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4" data-path="2.4.html">
            
                <a href="2.4.html">
            
                    
                    2.4 配色方案
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" >
            
                <span>
            
                    
                    3.布局
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.5.1" data-path="3.1.html">
            
                <a href="3.1.html">
            
                    
                    3.1 几何图形简史
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" >
            
                <span>
            
                    
                    未完持续更新...
            
                </span>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >3.1 几何图形简史</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x7F16;&#x7A0B;&#x8BBE;&#x8BA1;&#x7CFB;&#x7EDF;&#x4E4B;&#x5E03;&#x5C40;">&#x7F16;&#x7A0B;&#x8BBE;&#x8BA1;&#x7CFB;&#x7EDF;&#x4E4B;&#x5E03;&#x5C40;</h2>
<h3 id="&#x51E0;&#x4F55;&#x56FE;&#x5F62;&#x7B80;&#x53F2;">&#x51E0;&#x4F55;&#x56FE;&#x5F62;&#x7B80;&#x53F2;</h3>
<blockquote>
<p>&#x201C;&#x4EFB;&#x4F55;&#x613F;&#x610F;&#x91C7;&#x53D6;&#x5FC5;&#x8981;&#x63AA;&#x65BD;&#x7684;&#x4EBA;&#x90FD;&#x4F1A;&#x53D1;&#x73B0;&#xFF0C;&#x5728;&#x7F51;&#x683C;&#x7CFB;&#x7EDF;&#x7684;&#x5E2E;&#x52A9;&#x4E0B;&#xFF0C;&#x4ED6;&#x66F4;&#x9002;&#x5408;&#x4E8E;&#x627E;&#x5230;&#x4E00;&#x79CD;&#x89E3;&#x51B3;&#x4ED6;&#x7684;&#x8BBE;&#x8BA1;&#x95EE;&#x9898;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x8FD9;&#x662F;&#x529F;&#x80FD;&#x6027;&#x7684;&#xFF0C;&#x5408;&#x4E4E;&#x903B;&#x8F91;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x5728;&#x7F8E;&#x5B66;&#x4E0A;&#x4E5F;&#x66F4;&#x4EE4;&#x4EBA;&#x6109;&#x5FEB;&#x201D;
&#x7EA6;&#x745F;&#x592B;&#xB7;&#x7A46;&#x52D2;-&#x5E03;&#x7F57;&#x514B;&#x66FC;&#x300A;M&#xFC;ller-Brockmann, Josef (1981) Grid Systems in Graphic Design, p. 9. Arthur Niggli&#x300B;&#x3002;</p>
</blockquote>
<p>&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x8FD9;&#x4E00;&#x90E8;&#x5206;&#x96C6;&#x4E2D;&#x5728;&#x51E0;&#x4F55;&#x56FE;&#x5F62;&#x7684;&#x539F;&#x7406;&#x548C;&#x4ED6;&#x4EEC;&#x53EF;&#x4EE5;&#x5982;&#x4F55;&#x5E2E;&#x52A9;&#x8BBE;&#x8BA1;&#x5E08;&#x521B;&#x9020;&#x6709;&#x7EC4;&#x7EC7;&#x7684;&#x548C;&#x7F8E;&#x4E3D;&#x7684;&#x5E03;&#x5C40;&#x3002;&#x672F;&#x8BED;&#x51E0;&#x4F55;&#x7EC4;&#x5408;&#x5305;&#x62EC;&#x4E00;&#x7CFB;&#x5217;&#x7528;&#x4E8E;&#x6307;&#x5BFC;&#x8BBE;&#x8BA1;&#x4E2D;&#x5143;&#x7D20;&#x5B9A;&#x4F4D;&#x7684;&#x6280;&#x672F;&#x3002;&#x8FD9;&#x53EF;&#x4EE5;&#x50CF;&#x4E00;&#x4E2A;&#x6BD4;&#x7387;&#x4E00;&#x6837;&#x7B80;&#x5355;-&#x6BD4;&#x5982;&#x5C06;&#x9875;&#x9762;&#x5206;&#x5272;&#x6210;&#x4E09;&#x4E2A;&#x5927;&#x5C0F;&#x76F8;&#x7B49;&#x7684;&#x77E9;&#x5F62;&#x7684;&#x4E09;&#x5206;&#x4E4B;&#x4E00;&#x89C4;&#x5219;(&#x2153;)-&#x6216;&#x8005;&#x50CF;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x7F51;&#x683C;&#x7CFB;&#x7EDF;&#x4E00;&#x6837;&#x590D;&#x6742;&#xFF0C;&#x5305;&#x62EC;&#x63A7;&#x5236;&#x6587;&#x672C;&#x548C;&#x5176;&#x4ED6;&#x5F62;&#x72B6;&#x5BF9;&#x9F50;&#x7684;&#x591A;&#x5217;&#x548C;&#x591A;&#x884C;&#x3002;</p>
<p><img src="https://www.programmingdesignsystems.com/assets/layout/a-short-history-of-geometric-composition/thirds.svg" alt=""></p>
<blockquote>
<p>&#x753B;&#x5E03;&#x88AB;&#x5206;&#x6210;3&#x7B49;&#x5206;</p>
</blockquote>
<p><img src="https://www.programmingdesignsystems.com/assets/layout/a-short-history-of-geometric-composition/grid.svg" alt=""></p>
<blockquote>
<p>&#x753B;&#x5E03;&#x88AB;&#x5206;&#x6210;&#x7F51;&#x683C;</p>
</blockquote>
<p>&#x5728;&#x6DF1;&#x5165;&#x7814;&#x7A76;&#x5982;&#x4F55;&#x5728;&#x4F7F;&#x7528;&#x4EE3;&#x7801;&#x8FDB;&#x884C;&#x8BBE;&#x8BA1;&#x65F6;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x6982;&#x5FF5;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x9996;&#x5148;&#x4F7F;&#x7528;&#x672C;&#x7AE0;&#x7684;&#x5176;&#x4F59;&#x90E8;&#x5206;&#x4ECE;&#x827A;&#x672F;&#x53F2;&#x4E0A;&#x7814;&#x7A76;&#x51E0;&#x4F55;&#x56FE;&#x5F62;&#x7684;&#x793A;&#x4F8B;&#x3002;&#x8FD9;&#x6BB5;&#x5386;&#x53F2;&#x5C06;&#x7279;&#x522B;&#x5173;&#x6CE8;&#x65B0;&#x6280;&#x672F;-&#x9996;&#x5148;&#x662F;&#x5370;&#x5237;&#x673A;&#xFF0C;&#x7136;&#x540E;&#x662F;&#x8BA1;&#x7B97;&#x673A;-&#x5728;&#x53D1;&#x5C55;&#x8FD9;&#x4E9B;&#x601D;&#x60F3;&#x65B9;&#x9762;&#x53D1;&#x6325;&#x4E86;&#x91CD;&#x8981;&#x4F5C;&#x7528;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x6709;&#x5FC5;&#x8981;&#x5BF9;&#x8FD9;&#x4E00;&#x4E3B;&#x9898;-&#x7279;&#x522B;&#x662F;&#x9EC4;&#x91D1;&#x6BD4;&#x7387;&#x7684;&#x6982;&#x5FF5;-&#x505A;&#x4E00;&#x4E2A;&#x7B80;&#x77ED;&#x7684;&#x6279;&#x5224;&#x6027;&#x8BF4;&#x660E;&#x3002;&#x6700;&#x80FD;&#x7406;&#x89E3;&#x9EC4;&#x91D1;&#x6BD4;&#x7387;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x60F3;&#x8C61;&#x4E24;&#x6761;&#x7EBF;&#xFF0C;&#x4E00;&#x6761;&#x957F;&#x4E00;&#x6761;&#x77ED;&#x3002;&#x5F53;&#x957F;&#x7EBF;&#x548C;&#x77ED;&#x7EBF;&#x7684;&#x6BD4;&#x503C;&#x7B49;&#x4E8E;&#x4E24;&#x6761;&#x7EBF;&#x548C;&#x957F;&#x7EBF;&#x7684;&#x6BD4;&#x503C;&#x65F6;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x9EC4;&#x91D1;&#x6BD4;&#x7387;&#x3002;&#x8FD9;&#x4E2A;&#x6570;&#x5B57;&#x6B63;&#x597D;&#x662F;1.61803398875&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x5404;&#x79CD;&#x65B9;&#x5F0F;&#x4F7F;&#x7528;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5BBD;&#x5EA6;&#x6BD4;&#x9AD8;&#x5EA6;&#x5927;1.61803398875&#x500D;&#x7684;&#x77E9;&#x5F62;&#xFF0C;&#x5219;&#x79F0;&#x4E3A;&#x9EC4;&#x91D1;&#x77E9;&#x5F62;&#x3002;&#x5982;&#x679C;&#x60A8;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x9EC4;&#x91D1;&#x6BD4;&#x7387;&#x5C06;&#x8FD9;&#x4E2A;&#x77E9;&#x5F62;&#x5206;&#x5272;&#x6210;&#x8F83;&#x5C0F;&#x7684;&#x77E9;&#x5F62;&#xFF0C;&#x5E76;&#x901A;&#x8FC7;&#x8FD9;&#x4E9B;&#x8F83;&#x5C0F;&#x7684;&#x77E9;&#x5F62;&#x7684;&#x89D2;&#x7ED8;&#x5236;&#x4E00;&#x6761;&#x66F2;&#x7EBF;&#xFF0C;&#x60A8;&#x5C06;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x91D1;&#x8272;&#x87BA;&#x65CB;&#x3002;&#x9EC4;&#x91D1;&#x87BA;&#x65CB;&#x662F;&#x6700;&#x6D41;&#x884C;&#x7684;&#x9EC4;&#x91D1;&#x6BD4;&#x7387;&#x53EF;&#x89C6;&#x5316;&#xFF0C;&#x4F46;&#x4E0D;&#x8981;&#x88AB;&#x8FD9;&#x79CD;&#x590D;&#x6742;&#x6027;&#x611A;&#x5F04;&#xFF1A;&#x9EC4;&#x91D1;&#x6BD4;&#x7387;&#x4ECD;&#x7136;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#x3002;</p>
<p><img src="https://www.programmingdesignsystems.com/assets/layout/a-short-history-of-geometric-composition/goldenratio.svg" alt=""></p>
<blockquote>
<p>&#x9EC4;&#x91D1;&#x6BD4;&#x7387;&#x5F62;&#x8C61;&#x5316;&#x4E3A;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x7EBF;&#x6BB5;&#x548C;&#x4E00;&#x4E2A;&#x91D1;&#x8272;&#x87BA;&#x65CB;&#x3002;</p>
</blockquote>
<p>&#x6211;&#x4EEC;&#x4E2D;&#x7684;&#x8BB8;&#x591A;&#x4EBA;&#x90FD;&#x8BB0;&#x5F97;&#x5728;&#x5C0F;&#x5B66;&#x6216;&#x65E9;&#x671F;&#x827A;&#x672F;&#x6559;&#x80B2;&#x4E2D;&#x542C;&#x8BF4;&#x8FC7;&#x9EC4;&#x91D1;&#x6BD4;&#x4F8B;&#xFF0C;&#x800C;&#x8FD9;&#x79CD;&#x9009;&#x62E9;&#x5F88;&#x53EF;&#x80FD;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF1A;&#x9EC4;&#x91D1;&#x6BD4;&#x4F8B;&#xFF0C;&#x6216;&#x79F0;&#x795E;&#x5723;&#x6BD4;&#x4F8B;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x666E;&#x904D;&#x8BA4;&#x540C;&#x7684;&#x6570;&#x5B57;&#xFF0C;&#x5F53;&#x7528;&#x6765;&#x5728;&#x753B;&#x5E03;&#x4E2D;&#x653E;&#x7F6E;&#x8BBE;&#x8BA1;&#x5143;&#x7D20;&#x65F6;&#xFF0C;&#x8FD9;&#x4E2A;&#x6570;&#x5B57;&#x5728;&#x7F8E;&#x5B66;&#x4E0A;&#x662F;&#x4EE4;&#x4EBA;&#x6109;&#x60A6;&#x7684;&#x3002;&#x56E0;&#x4E3A;&#x5B83;&#x5728;&#x4EBA;&#x773C;&#x770B;&#x6765;&#x7279;&#x522B;&#x7F8E;&#x4E3D;&#xFF0C;&#x5B83;&#x5728;&#x6574;&#x4E2A;&#x5386;&#x53F2;&#x4E0A;&#x88AB;&#x827A;&#x672F;&#x5BB6;&#x7528;&#x6765;&#x521B;&#x4F5C;&#x6770;&#x4F5C;&#x3002;&#x9EC4;&#x91D1;&#x6BD4;&#x4F8B;&#x7684;&#x6982;&#x5FF5;&#x88AB;&#x7528;&#x6765;&#x63CF;&#x8FF0;&#x4ECE;&#x53E4;&#x5E0C;&#x814A;&#x5E15;&#x53F0;&#x519C;&#x795E;&#x5E99;&#x7684;&#x5EFA;&#x7B51;&#x5230;&#x83B1;&#x6602;&#x7EB3;&#x591A;&#x8FBE;&#x82AC;&#x5947;(Leonardo Da Vinci)&#x7684;&#x7ED8;&#x753B;&#xFF0C;&#x800C;&#x5BF9;&#x201C;&#x827A;&#x672F;&#x4E2D;&#x7684;&#x9EC4;&#x91D1;&#x6BD4;&#x4F8B;&#x201D;&#x7684;&#x63A2;&#x7D22;&#x5C06;&#x63ED;&#x793A;&#x51FA;&#x6570;&#x767E;&#x7BC7;&#x58F0;&#x79F0;&#x5728;&#x51E0;&#x4E4E;&#x4EFB;&#x4F55;&#x53EF;&#x80FD;&#x7684;&#x827A;&#x672F;&#x54C1;&#x4E2D;&#x53D1;&#x73B0;&#x4E86;&#x9EC4;&#x91D1;&#x6BD4;&#x4F8B;&#x7684;&#x8BBA;&#x6587;&#x3002;</p>
<p>&#x552F;&#x4E00;&#x7684;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x5176;&#x4E2D;&#x5927;&#x90E8;&#x5206;&#x90FD;&#x662F;&#x7EAF;&#x865A;&#x6784;&#x7684;&#x3002;&#x867D;&#x7136;&#x6709;&#x827A;&#x672F;&#x5BB6;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#x9EC4;&#x91D1;&#x6BD4;&#x7387;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x4F46;&#x8FD9;&#x4E9B;&#x7ED3;&#x8BBA;&#x4E2D;&#x6709;&#x8BB8;&#x591A;&#x662F;&#x540E;&#x5408;&#x7406;&#x5316;&#x7684;&#x6848;&#x4F8B;&#xFF0C;&#x4F5C;&#x8005;&#x5F00;&#x59CB;&#x5BFB;&#x627E;&#x9EC4;&#x91D1;&#x6BD4;&#x7387;&#xFF0C;&#x5E76;&#x8FD9;&#x6837;&#x505A;&#x3002;&#x8FD9;&#x4E0E;&#x9634;&#x8C0B;&#x8BBA;&#x8005;&#x5728;&#x7F8E;&#x5143;&#x949E;&#x7968;&#x4E0A;&#x53D1;&#x73B0;&#x9690;&#x85CF;&#x7684;&#x7B26;&#x53F7;&#x6216;&#x767B;&#x6708;&#x7167;&#x7247;&#x4E0A;&#x7684;&#x5047;&#x9634;&#x5F71;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x4E0D;&#x540C;&#x3002;&#x4E54;&#x6CBB;&#xB7;&#x9A6C;&#x79D1;&#x592B;&#x65AF;&#x57FA;(GeorgeMarkowsky)&#x5728;1992&#x5E74;&#x53D1;&#x8868;&#x7684;&#x4E00;&#x7BC7;&#x9898;&#x4E3A;&#x201C;&#x5BF9;&#x9EC4;&#x91D1;&#x6BD4;&#x7387;&#x7684;&#x8BEF;&#x89E3;&#x201D;&#x7684;&#x8BBA;&#x6587;</p>
<blockquote>
<p>&#x201C;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;[&#x9EC4;&#x91D1;&#x6BD4;&#x7387;]&#x7684;&#x6570;&#x5B66;&#x6027;&#x8D28;&#x662F;&#x6B63;&#x786E;&#x7684;&#xFF0C;&#x4F46;&#x5728;&#x827A;&#x672F;&#x3001;&#x5EFA;&#x7B51;&#x3001;&#x6587;&#x5B66;&#x548C;&#x7F8E;&#x5B66;&#x4E2D;&#x6240;&#x63D0;&#x51FA;&#x7684;&#x5173;&#x4E8E;&#x9EC4;&#x91D1;&#x6BD4;&#x7387;&#x7684;&#x8BB8;&#x591A;&#x5185;&#x5BB9;&#x90FD;&#x662F;&#x9519;&#x8BEF;&#x7684;&#x6216;&#x4E25;&#x91CD;&#x8BEF;&#x5BFC;&#x4EBA;&#x7684;&#x3002;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x4E9B;&#x5173;&#x4E8E;&#x9EC4;&#x91D1;&#x6BD4;&#x7387;&#x7684;&#x8BF4;&#x6CD5;&#x5DF2;&#x7ECF;&#x8FBE;&#x5230;&#x4E86;&#x5E38;&#x8BC6;&#x7684;&#x5730;&#x4F4D;&#xFF0C;&#x5E76;&#x5F97;&#x5230;&#x4E86;&#x5E7F;&#x6CDB;&#x7684;&#x91CD;&#x590D;&#x3002;&#x201C;
&#x4E54;&#x6CBB;&#xB7;&#x9A6C;&#x79D1;&#x592B;&#x65AF;&#x57FA;&#x300A;arkowsky, George (1992) Misconceptions about the Golden Ratio, p. 2. The College Mathematics Journal, Vol. 23&#x300B;</p>
</blockquote>
<p>&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x5E15;&#x53F0;&#x519C;&#x795E;&#x5E99;&#x5EFA;&#x4E8E;&#x53E4;&#x5E0C;&#x814A;&#xFF0C;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x6587;&#x5B57;&#x6765;&#x6E90;&#x8868;&#x660E;&#x96C5;&#x5178;&#x4EBA;&#x77E5;&#x9053;&#x9EC4;&#x91D1;&#x6BD4;&#x4F8B;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x4E3A;&#x4E86;&#x5728;&#x5EFA;&#x7B51;&#x7269;&#x7684;&#x7ED3;&#x6784;&#x4E0A;&#x653E;&#x4E0A;&#x4E00;&#x4E2A;&#x91D1;&#x8272;&#x7684;&#x957F;&#x65B9;&#x5F62;&#xFF0C;&#x4EBA;&#x4EEC;&#x4E0D;&#x5F97;&#x4E0D;&#x5FFD;&#x7565;&#x5EFA;&#x7B51;&#x7269;&#x7684;&#x5927;&#x90E8;&#x5206;&#x5730;&#x57FA;&#x3002;&#x5217;&#x5965;&#x7EB3;&#x591A;&#xB7;&#x8FBE;&#xB7;&#x82AC;&#x5947;(LeonardoDaVinci)&#x786E;&#x5B9E;&#x9610;&#x91CA;&#x4E86;&#x4E00;&#x672C;&#x540D;&#x4E3A;&#x201C;&#x5FB7;&#xB7;&#x8FEA;&#x7EF4;&#x5A1C;&#xB7;&#x666E;&#x7F57;&#x6CE2;&#x8482;&#x5965;&#x201D;(De Divina Proportione)&#x7684;&#x4E66;&#xFF0C;&#x4E66;&#x4E2D;&#x63D0;&#x5230;&#x4E86;&#x5C3D;&#x7BA1;&#x8BB8;&#x591A;&#x5B66;&#x8005;&#x5728;&#x8FBE;&#x82AC;&#x5947;&#x7684;&#x4F5C;&#x54C1;&#x4E2D;&#x53D1;&#x73B0;&#x4E86;&#x9EC4;&#x91D1;&#x6BD4;&#x4F8B;&#xFF0C;&#x4F46;&#x8FD9;&#x4E9B;&#x53D1;&#x73B0;&#x4F3C;&#x4E4E;&#x65E2;&#x4E3B;&#x89C2;&#x53C8;&#x751F;&#x52A8;&#x3002;&#x5728;&#x8BA8;&#x8BBA;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#x65F6;&#xFF0C;&#x533A;&#x5206;&#x4E8B;&#x5B9E;&#x548C;&#x865A;&#x6784;&#x662F;&#x5F88;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x5BF9;&#x4E8E;&#x51E0;&#x4F55;&#x6784;&#x56FE;&#x8FD9;&#x4E00;&#x4E3B;&#x9898;&#x5C24;&#x5176;&#x5982;&#x6B64;&#x3002;&#x4E0E;&#x5176;&#x5F00;&#x59CB;&#x5BF9;&#x5982;&#x6B64;&#x795E;&#x5723;&#x7684;&#x6BD4;&#x4F8B;&#x8FDB;&#x884C;&#x5F92;&#x52B3;&#x65E0;&#x529F;&#x7684;&#x63A2;&#x7D22;&#xFF0C;&#x4E3A;&#x4E16;&#x754C;&#x7684;&#x5F7B;&#x5E95;&#x7B80;&#x5316;&#x670D;&#x52A1;&#xFF0C;&#x76F8;&#x53CD;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x628A;&#x91CD;&#x70B9;&#x653E;&#x5728;&#x66F4;&#x5177;&#x4F53;&#x7684;&#x5386;&#x53F2;&#x4E0A;&#xFF0C;&#x8BF4;&#x660E;&#x6280;&#x672F;&#x662F;&#x5982;&#x4F55;&#x957F;&#x671F;&#x6FC0;&#x52B1;&#x8BBE;&#x8BA1;&#x5E08;&#x4F7F;&#x7528;&#x51E0;&#x4F55;&#x7EA6;&#x675F;&#x6765;&#x51CF;&#x8F7B;&#x4ED6;&#x4EEC;&#x5DE5;&#x4F5C;&#x7684;&#x8D1F;&#x62C5;&#x7684;&#x3002;&#x968F;&#x7740;&#x8FD9;&#x4E9B;&#x6280;&#x672F;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x5B83;&#x4EEC;&#x6210;&#x4E3A;&#x8BBE;&#x8BA1;&#x65B9;&#x6CD5;&#x7684;&#x4F7F;&#x7528;&#xFF0C;&#x5373;&#x4F7F;&#x8BBE;&#x8BA1;&#x5E08;&#x4E0D;&#x53D7;&#x673A;&#x5668;&#x7684;&#x9650;&#x5236;&#xFF0C;&#x5B83;&#x4EEC;&#x4ECA;&#x5929;&#x88AB;&#x56FE;&#x5F62;&#x8BBE;&#x8BA1;&#x5E08;&#x5E7F;&#x6CDB;&#x91C7;&#x7528;&#xFF0C;&#x4EE5;&#x4F5C;&#x51FA;&#x4E00;&#x81F4;&#x548C;&#x6709;&#x7EC4;&#x7EC7;&#x7684;&#x5E03;&#x5C40;&#x3002;</p>
<p><img src="https://www.programmingdesignsystems.com/assets/layout/a-short-history-of-geometric-composition/papyrus47.jpg" alt=""></p>
<blockquote>
<p>&#x7EB8;&#x838E;&#x8349;47&#xFF0C;&#x662F;&#x201C;&#x542F;&#x793A;&#x5F55;&#x201D;&#x73B0;&#x5B58;&#x6700;&#x53E4;&#x8001;&#x7684;&#x7248;&#x672C;&#x3002;</p>
</blockquote>
<p>&#x6211;&#x4EEC;&#x5C06;&#x4EE5;&#x4E00;&#x4E2A;&#x5148;&#x4E8E;&#x8FD9;&#x4E9B;&#x60F3;&#x6CD5;&#x7684;&#x4F8B;&#x5B50;&#x5F00;&#x59CB;&#x8FD9;&#x4E2A;&#x6545;&#x4E8B;&#xFF1A;&#x65E9;&#x671F;&#x624B;&#x5199;&#x7684;&#x4E66;&#xFF0C;&#x4E5F;&#x79F0;&#x4E3A;&#x6CD5;&#x5178;&#x3002;&#x4E0E;&#x5377;&#x8F74;&#x7EB8;&#x76F8;&#x6BD4;&#xFF0C;&#x6CD5;&#x5178;&#x662F;&#x4E00;&#x9879;&#x91CD;&#x5927;&#x7684;&#x6539;&#x8FDB;&#xFF0C;&#x5B83;&#x4EE5;&#x7C7B;&#x4F3C;&#x4E8E;&#x73B0;&#x4EE3;&#x4E66;&#x7C4D;&#x7684;&#x5F62;&#x5F0F;&#x5806;&#x53E0;&#x4E86;&#x4E00;&#x9875;&#x3002;&#x201C;&#x6CD5;&#x5178;&#x201D;&#x7684;&#x6D41;&#x884C;&#x4E0E;&#x57FA;&#x7763;&#x6559;&#x7684;&#x5174;&#x8D77;&#x76F8;&#x543B;&#x5408;-&#x6216;&#x8005;&#x8BF4;&#x662F;&#x57FA;&#x7763;&#x6559;&#x5174;&#x8D77;&#x7684;&#x539F;&#x56E0;-&#x800C;&#x6700;&#x65E9;&#x7684;&#x57FA;&#x7763;&#x6559;&#x624B;&#x7A3F;&#x90FD;&#x662F;&#x4ECE;&#x4E8C;&#x4E16;&#x7EAA;&#x5F00;&#x59CB;&#x7684;&#x3002;&#x8FD9;&#x4E9B;&#x6587;&#x672C;&#x7F3A;&#x5C11;&#x4E86;&#x6211;&#x4EEC;&#x4ECA;&#x5929;&#x6240;&#x77E5;&#x9053;&#x7684;&#x5927;&#x591A;&#x6570;&#x8868;&#x8FBE;&#x6280;&#x5DE7;&#xFF1A;&#x6587;&#x672C;&#x6CA1;&#x6709;&#x6807;&#x9898;&#xFF0C;&#x6CA1;&#x6709;&#x5B57;&#x6BCD;&#x5927;&#x5C0F;&#x5199;&#xFF0C;&#x7F3A;&#x5C11;&#x6807;&#x70B9;&#x7B26;&#x53F7;&#x4F7F;&#x5B83;&#x4EEC;&#x53D8;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x5F88;&#x957F;&#x7684;&#x6BB5;&#x843D;&#x3002;&#x8FD9;&#x4E9B;&#x6587;&#x672C;&#x4EC5;&#x4EC5;&#x662F;&#x4EA4;&#x6D41;&#x53E3;&#x8BED;&#x7684;&#x5A92;&#x4ECB;&#xFF0C;&#x5F88;&#x5C11;&#x6709;&#x4EBA;&#x5C06;&#x8FD9;&#x4E9B;&#x601D;&#x60F3;&#x4F5C;&#x4E3A;&#x4E00;&#x79CD;&#x5A92;&#x4ECB;&#x6295;&#x5165;&#x5230;&#x4E66;&#x4E2D;&#x3002;&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x5B83;&#x4EEC;&#x662F;&#x7528;&#x624B;&#x5199;&#x7684;&#xFF0C;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x6307;&#x5357;&#x6765;&#x5E2E;&#x52A9;&#x6284;&#x5199;&#x5458;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6BCF;&#x4E00;&#x9875;&#x7684;&#x884C;&#x6570;&#x5DEE;&#x522B;&#x5F88;&#x5927;&#xFF0C;&#x884C;&#x901A;&#x5E38;&#x662F;&#x659C;&#x7387;&#x7684;&#xFF0C;&#x6B63;&#x786E;&#x7684;&#x8FB9;&#x8DDD;&#x6839;&#x636E;&#x6284;&#x5199;&#x5458;&#x5982;&#x4F55;&#x51B3;&#x5B9A;&#x6253;&#x7834;&#x5355;&#x8BCD;5&#x800C;&#x53D8;&#x5316;&#x3002;</p>
<p>&#x628A;&#x8FD9;&#x4E0E;&#x540E;&#x6765;&#x88AB;&#x7167;&#x4EAE;&#x7684;&#x624B;&#x7A3F;-&#x5728;&#x4FEE;&#x9053;&#x9662;&#x91CC;&#x624B;&#x5DE5;&#x5199;&#x7684;&#x4E66;-&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#xFF0C;&#x8FD9;&#x4E9B;&#x624B;&#x7A3F;&#x5728;&#x4E2D;&#x4E16;&#x7EAA;&#x975E;&#x5E38;&#x76DB;&#x884C;&#x3002;&#x8FD9;&#x4E9B;&#x6587;&#x672C;&#x5728;&#x5E03;&#x5C40;&#x4E0A;&#x8981;&#x614E;&#x91CD;&#x5F97;&#x591A;&#x3002;&#x4ED6;&#x4EEC;&#x4F7F;&#x7528;&#x54E5;&#x7279;&#x5F0F;&#x5B57;&#x4F53;&#xFF0C;&#x4E00;&#x79CD;&#x4E66;&#x5199;&#x901F;&#x5EA6;&#x975E;&#x5E38;&#x6162;&#x7684;&#x5B57;&#x4F53;&#xFF0C;&#x624B;&#x7A3F;&#x9875;&#x901A;&#x5E38;&#x7528;&#x5F69;&#x8272;&#x7684;&#x5FAE;&#x578B;&#x63D2;&#x56FE;&#x7ED8;&#x5236;&#x3002;&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x4E9B;&#x624B;&#x7A3F;&#x4E0D;&#x662F;&#x4ECE;&#x7A7A;&#x767D;&#x9875;&#x521B;&#x5EFA;&#x7684;&#x3002;&#x6284;&#x5199;&#x5458;&#x4F1A;&#x8BA1;&#x5212;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x800C;&#x8FD9;&#x4E00;&#x8BA1;&#x5212;&#x7684;&#x6838;&#x5FC3;&#x662F;&#x521B;&#x9020;&#x51E0;&#x4F55;&#x52A9;&#x624B;&#x7EBF;&#x6765;&#x6307;&#x5BFC;&#x6284;&#x5199;&#x5458;&#x5199;&#x4F5C;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x5C06;&#x5728;&#x9875;&#x9762;&#x4E0A;&#x7ED8;&#x5236;&#x4E00;&#x4E2A;&#x77E9;&#x5F62;&#x4EE5;&#x6307;&#x793A;&#x9875;&#x8FB9;&#x8DDD;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x8FD9;&#x4E2A;&#x77E9;&#x5F62;&#x88AB;&#x5206;&#x5272;&#x6210;&#x4E00;&#x4E2A;&#x5E73;&#x884C;&#x7EBF;&#x7684;&#x7F51;&#x683C;&#x6765;&#x5F15;&#x5BFC;&#x6587;&#x672C;&#xFF0C;&#x800C;&#x4E00;&#x4E9B;&#x90E8;&#x5206;&#x88AB;&#x7559;&#x51FA;&#x4F5C;&#x4E3A;&#x63D2;&#x56FE;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x6284;&#x5199;&#x5458;&#x4F1A;&#x6309;&#x7167;&#x7F51;&#x683C;&#x4ED4;&#x7EC6;&#x5730;&#x5199;&#x548C;&#x8BF4;&#x660E;&#x8FD9;&#x672C;&#x4E66;&#x3002;&#x8FD9;&#x5728;&#x672C;&#x8D28;&#x4E0A;&#x548C;&#x8BBE;&#x8BA1;&#x5E08;&#x4EEC;&#x4ECA;&#x5929;&#x5982;&#x4F55;&#x628A;&#x753B;&#x5E03;&#x5206;&#x6210;&#x66F4;&#x5C0F;&#x7684;&#x90E8;&#x5206;&#x6765;&#x7EC4;&#x7EC7;&#x4ED6;&#x4EEC;&#x7684;&#x5E03;&#x5C40;&#x5E76;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x4E0D;&#x540C;&#x3002;</p>
<p><img src="https://www.programmingdesignsystems.com/assets/layout/a-short-history-of-geometric-composition/illuminated.jpg" alt=""></p>
<blockquote>
<p>&#x4E00;&#x5F20;&#x9A6C;&#x5C14;&#x6885;&#x65AF;&#x4F2F;&#x91CC;&#x5723;&#x7ECF;&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x5176;&#x4E2D;&#x7684;&#x5E95;&#x5C42;&#x7F51;&#x683C;&#x660E;&#x663E;&#x7A81;&#x51FA;&#x5728;&#x54E5;&#x7279;&#x5F0F;&#x811A;&#x672C;&#x548C;&#x63D2;&#x56FE;&#x65C1;&#x8FB9;&#x3002;</p>
</blockquote>
<p>&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#x4ECE;&#x624B;&#x5DE5;&#x6280;&#x672F;&#x5230;&#x673A;&#x68B0;&#x7CFB;&#x7EDF;&#x65F6;&#xFF0C;&#x9996;&#x5148;&#x5728;&#x4E2D;&#x56FD;&#x6BD4;&#x57CE;(&#x516C;&#x5143;1045&#x5E74;)&#x548C;&#x540E;&#x6765;&#x7EA6;&#x7FF0;&#x65AF;&#x53E4;&#x6ED5;&#x8D1D;&#x683C;&#x5728;&#x5FB7;&#x56FD;(&#x516C;&#x5143;1450&#x5E74;)&#x53D1;&#x660E;&#x4E86;&#x79FB;&#x52A8;&#x5F0F;&#x3002;&#x8FD9;&#x79CD;&#x65B0;&#x7684;&#x5370;&#x5237;&#x6280;&#x672F;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x5C0F;&#x7684;&#x7C98;&#x571F;&#x3001;&#x6728;&#x5934;&#x6216;&#x91D1;&#x5C5E;&#x5B57;&#x6BCD;&#x5757;&#xFF0C;&#x8FD9;&#x4E9B;&#x5C0F;&#x5757;&#x53EF;&#x4EE5;&#x88AB;&#x7F1D;&#x5728;&#x6846;&#x67B6;&#x4E0A;&#xFF0C;&#x6CB9;&#x58A8;&#x5E76;&#x7528;&#x4E8E;&#x6279;&#x91CF;&#x751F;&#x4EA7;&#x76F8;&#x540C;&#x7684;&#x5370;&#x5237;&#x54C1;&#x3002;&#x4EBA;&#x4EEC;&#x53EF;&#x4EE5;&#x60F3;&#x8C61;&#x5F53;&#x65F6;&#x7684;&#x6279;&#x8BC4;&#x5BB6;&#x4EEC;&#x542C;&#x8D77;&#x6765;&#x4E00;&#x5B9A;&#x5F88;&#x50CF;&#x6211;&#x4EEC;&#x4ECA;&#x5929;&#x542C;&#x5230;&#x7684;&#x5173;&#x4E8E;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x4E1C;&#x897F;&#xFF1A;&#x8FD9;&#x4E9B;&#x65B0;&#x673A;&#x5668;&#x9650;&#x5236;&#x4E86;&#x827A;&#x672F;&#x5BB6;&#xFF0C;&#x4F7F;&#x8BBE;&#x8BA1;&#x4EA7;&#x54C1;&#x53D8;&#x5F97;&#x7EDF;&#x4E00;&#x3002;&#x5728;&#x53E4;&#x817E;&#x5821;&#x65E9;&#x671F;&#x5370;&#x5237;&#x5723;&#x7ECF;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x4EBA;&#x4EEC;&#x53EF;&#x4EE5;&#x8BF4;&#x76F8;&#x53CD;&#x7684;&#x8BF4;&#x6CD5;&#x662F;&#x6B63;&#x786E;&#x7684;&#x3002;&#x5370;&#x5237;&#x673A;&#x786E;&#x5B9E;&#x8FEB;&#x4F7F;&#x53E4;&#x817E;&#x5821;&#x5728;&#x77E9;&#x5F62;&#x7F51;&#x683C;&#x4E2D;&#x601D;&#x8003;&#x4E66;&#x7C4D;&#x8BBE;&#x8BA1;&#x7684;&#x5404;&#x4E2A;&#x65B9;&#x9762;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x8FD9;&#x4E9B;&#x7EA6;&#x675F;&#x4E0B;&#x6240;&#x8868;&#x73B0;&#x51FA;&#x6765;&#x7684;&#x521B;&#x9020;&#x529B;&#x662F;&#x975E;&#x5E38;&#x663E;&#x8457;&#x7684;&#x3002;&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x6574;&#x6D01;&#x7684;&#x4E24;&#x5217;&#x5E03;&#x5C40;&#xFF0C;&#x6BCF;&#x4E2A;&#x5B57;&#x6BCD;&#x4EE5;&#x591A;&#x4E2A;&#x5BBD;&#x5EA6;&#x4EA7;&#x751F;&#xFF0C;&#x56E0;&#x6B64;&#x6587;&#x672C;&#x884C;&#x53EF;&#x4EE5;&#x5728;&#x4E24;&#x7AEF;&#x5BF9;&#x9F50;&#x3002;&#x5B57;&#x4F53;&#x672C;&#x8EAB;&#x662F;&#x51E0;&#x4E2A;&#x6708;&#x7CBE;&#x5FC3;&#x5236;&#x4F5C;&#x7684;&#x6587;&#x5B57;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x8FD9;&#x4E9B;&#x5B57;&#x6BCD;&#x65E2;&#x662F;&#x5BF9;&#x6628;&#x5929;&#x54E5;&#x7279;&#x5F0F;&#x5267;&#x672C;&#x7684;&#x5F15;&#x7528;&#xFF0C;&#x4E5F;&#x662F;&#x5BF9;&#x660E;&#x5929;&#x673A;&#x68B0;&#x8FC7;&#x7A0B;&#x7684;&#x5F15;&#x7528;&#x3002;&#x5370;&#x5237;&#x673A;&#x786E;&#x5B9E;&#x9650;&#x5236;&#x4E86;&#x8BBE;&#x8BA1;&#xFF0C;&#x4F46;&#x662F;&#x6253;&#x5370;&#x673A;&#x5728;&#x8FD9;&#x4E9B;&#x51E0;&#x4F55;&#x7F51;&#x683C;&#x4E2D;&#x53D1;&#x73B0;&#x4E86;&#x4E00;&#x4E2A;&#x5145;&#x6EE1;&#x521B;&#x9020;&#x529B;&#x7684;&#x4E16;&#x754C;&#x3002;&#x7528;&#x65AF;&#x8482;&#x82AC;&#xB7;&#x5F17;&#x83B1;&#x7684;&#x8BDD;&#x6765;&#x8BF4;&#xFF0C;&#x53E4;&#x817E;&#x5821;&#x7684;&#x201C;&#x5723;&#x7ECF;&#x201D;&#x6BD4;[&#x4ED6;&#x4EEC;]&#x9700;&#x8981;&#x7684;&#x7F8E;&#x591A;&#x4E86;&#x201C;&#x3002;</p>
<p><img src="https://www.programmingdesignsystems.com/assets/layout/a-short-history-of-geometric-composition/movabletype.jpg" alt=""></p>
<blockquote>
<p>&#x5728;&#x94C5;&#x4E2D;&#x94F8;&#x9020;&#x7684;&#x79FB;&#x52A8;&#x5F0F;&#x5B57;&#x6BCD;&#x5757;&#x3002;&#x666E;&#x5C14;&#x66FC;&#x62CD;&#x6444;&#x7684;&#x7167;&#x7247;&#x3002;</p>
</blockquote>
<p><img src="https://www.programmingdesignsystems.com/assets/layout/a-short-history-of-geometric-composition/gutenberg.jpg" alt=""></p>
<blockquote>
<p>&#x53E4;&#x817E;&#x5821;&#x5723;&#x7ECF;&#x6700;&#x540E;49&#x518C;&#x4E2D;&#x7684;&#x4E00;&#x672C;&#x3002;</p>
</blockquote>
<p>20&#x4E16;&#x7EAA;&#x521D;&#xFF0C;&#x5DE5;&#x4E1A;&#x9769;&#x547D;&#x5E26;&#x6765;&#x7684;&#x65B0;&#x6280;&#x672F;&#x5411;&#x827A;&#x672F;&#x5BB6;&#x548C;&#x8BBE;&#x8BA1;&#x5E08;&#x63D0;&#x4F9B;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x65B0;&#x6280;&#x672F;&#xFF0C;&#x8FD9;&#x4E00;&#x65F6;&#x671F;&#x7684;&#x8BB8;&#x591A;&#x827A;&#x672F;&#x548C;&#x653F;&#x6CBB;&#x8FD0;&#x52A8;&#x90FD;&#x878D;&#x5165;&#x4E86;&#x8FD9;&#x4E9B;&#x673A;&#x68B0;&#x8FC7;&#x7A0B;&#x3002;&#x5927;&#x591A;&#x6570;&#x6B27;&#x6D32;&#x827A;&#x672F;&#x8FD0;&#x52A8;(&#x610F;&#x5927;&#x5229;&#x7684;&#x672A;&#x6765;&#x4E3B;&#x4E49;&#x3001;&#x6CD5;&#x56FD;&#x7684;&#x8FBE;&#x8FBE;&#x4E3B;&#x4E49;&#x3001;&#x5FB7;&#x56FD;&#x7684;&#x5305;&#x8C6A;&#x65AF;)&#x4EE5;&#x53CA;&#x4FC4;&#x7F57;&#x65AF;&#x548C;&#x4E2D;&#x56FD;&#x7684;&#x9A6C;&#x514B;&#x601D;&#x4E3B;&#x4E49;&#x8FD0;&#x52A8;&#x7684;&#x6838;&#x5FC3;&#x662F;&#x5229;&#x7528;&#x5370;&#x5237;&#x673A;&#x6765;&#x53CD;&#x6297;&#x827A;&#x672F;&#x7684;&#x6982;&#x5FF5;&#x3002;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x662F;&#x610F;&#x5927;&#x5229;&#x672A;&#x6765;&#x5B66;&#x5BB6;&#xFF0C;&#x4ED6;&#x4EEC;&#x53D7;&#x5230;&#x90FD;&#x5E02;&#x4E3B;&#x4E49;&#x548C;&#x673A;&#x5668;&#x7684;&#x542F;&#x53D1;&#xFF0C;&#x8BD5;&#x9A8C;&#x4E86;&#x5370;&#x5237;&#x673A;&#x7684;&#x65E2;&#x5B9A;&#x6805;&#x683C;&#x3002;&#x5982;&#x679C;&#x53E4;&#x817E;&#x5821;&#x4E00;&#x751F;&#x7684;&#x5DE5;&#x4F5C;&#x662F;&#x5C06;&#x8BBE;&#x8BA1;&#x878D;&#x5165;&#x4E00;&#x4E2A;&#x77E9;&#x5F62;&#x7F51;&#x683C;&#xFF0C;&#x672A;&#x6765;&#x5B66;&#x5BB6;&#x8BA4;&#x4E3A;&#x8FD9;&#x662F;&#x4ED6;&#x4EEC;&#x7684;&#x4F7F;&#x547D;&#xFF0C;&#x6253;&#x7834;&#x8FD9;&#x4E2A;&#x7F51;&#x683C;&#x3002;</p>
<blockquote>
<p>&#x201C;&#x6211;&#x7684;&#x9769;&#x547D;&#x662F;&#x9488;&#x5BF9;&#x6240;&#x8C13;&#x7684;&#x548C;&#x8C10;&#x7684;&#x9875;&#x9762;&#xFF0C;&#x8FD9;&#x662F;&#x76F8;&#x53CD;&#x7684;&#x6D41;&#x52A8;&#x548C;&#x56DE;&#x6D41;&#xFF0C;&#x8DE8;&#x8D8A;&#x548C;&#x7206;&#x53D1;&#x7684;&#x98CE;&#x683C;&#x8D2F;&#x7A7F;&#x6574;&#x4E2A;&#x9875;&#x9762;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x540C;&#x4E00;&#x9875;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4F7F;&#x7528;&#x4E09;&#x3001;&#x56DB;&#x79CD;&#x989C;&#x8272;&#x7684;&#x58A8;&#x6C34;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x5FC5;&#x8981;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x4F1A;&#x4F7F;&#x7528;&#x4E8C;&#x5341;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x5B57;&#x4F53;&#x3002;&#x201D;
Apollonio,Umbro(2009) Futurist Manifestos, p. 104. Tate Publishing</p>
</blockquote>
<p><img src="https://www.programmingdesignsystems.com/assets/layout/a-short-history-of-geometric-composition/futurism.jpg" alt=""></p>
<blockquote>
<p>&#x4ECE;1915&#x5E74;&#x5F00;&#x59CB;&#x3002;</p>
</blockquote>
<p>&#x8FD9;&#x4E2A;&#x8BBE;&#x8BA1;&#x7531;Ardengo Soffice i&#x5C55;&#x793A;&#x4E86;&#x4E00;&#x4E2A;&#x6545;&#x610F;&#x6253;&#x7834;&#x4E0E;&#x77E9;&#x5F62;&#x5B57;&#x6BCD;&#x5757;&#x6392;&#x5217;&#x5728;&#x6DF7;&#x4E71;&#x7684;&#x7F51;&#x683C;&#x3002;&#x8FD9;&#x4E9B;&#x5B9E;&#x9A8C;&#x5728;&#x73B0;&#x4EE3;&#x770B;&#x6765;&#x53EF;&#x80FD;&#x5E76;&#x4E0D;&#x662F;&#x5F88;&#x6709;&#x5F00;&#x521B;&#x6027;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x5BF9;&#x63A5;&#x4E0B;&#x6765;&#x51E0;&#x5341;&#x5E74;&#x7684;&#x56FE;&#x5F62;&#x98CE;&#x683C;&#x4EA7;&#x751F;&#x4E86;&#x5DE8;&#x5927;&#x7684;&#x5F71;&#x54CD;&#x3002;</p>
<p>&#x968F;&#x7740;&#x5E73;&#x9762;&#x8BBE;&#x8BA1;&#x4ECE;20&#x4E16;&#x7EAA;20&#x5E74;&#x4EE3;&#x7684;&#x7248;&#x753B;&#x5BB6;&#x4EFB;&#x52A1;&#x53D1;&#x5C55;&#x5230;20&#x4E16;&#x7EAA;50&#x5E74;&#x4EE3;&#x7684;&#x84EC;&#x52C3;&#x53D1;&#x5C55;&#xFF0C;&#x8FD9;&#x4E9B;&#x51E0;&#x4F55;&#x6784;&#x56FE;&#x6280;&#x672F;&#x4E5F;&#x968F;&#x4E4B;&#x6210;&#x719F;&#x3002;1928&#x5E74;&#xFF0C;&#x7B80;&#xB7;&#x7279;&#x897F;&#x970D;&#x5C14;&#x5FB7;(Jan Tschichold)&#x53D1;&#x5E03;&#x4E86;&#x201C;&#x65B0;&#x65F6;&#x4EE3;&#x201D;(Die Neue)&#x6392;&#x7248;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4EFD;&#x4E25;&#x683C;&#x7684;&#x73B0;&#x4EE3;&#x4E3B;&#x4E49;&#x5BA3;&#x8A00;&#xFF0C;&#x4E3B;&#x5F20;&#x4F7F;&#x7528;&#x65E0;&#x886C;&#x7EBF;&#x5B57;&#x4F53;&#x548C;&#x7EDF;&#x4E00;&#x3001;&#x5DE6;&#x5BF9;&#x9F50;&#x7684;&#x7F51;&#x683C;&#x5E03;&#x5C40;&#x3002;&#x867D;&#x7136;Tschichold&#x6CA1;&#x6709;&#x4F7F;&#x7528;&#x7F51;&#x683C;&#x8FD9;&#x4E2A;&#x8BCD;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x5C06;&#x5B83;&#x7684;&#x4F7F;&#x7528;&#x6B63;&#x89C4;&#x5316;&#xFF0C;&#x4F46;&#x73B0;&#x4EE3;&#x7F51;&#x683C;&#x7CFB;&#x7EDF;&#x7684;&#x5927;&#x591A;&#x6570;&#x6280;&#x672F;&#x90FD;&#x662F;&#x5B58;&#x5728;&#x7684;&#xFF1A;&#x5C06;&#x753B;&#x5E03;&#x5206;&#x5272;&#x6210;&#x66F4;&#x5C0F;&#x3001;&#x66F4;&#x5747;&#x5300;&#x7684;&#x77E9;&#x5F62;&#x6765;&#x5F15;&#x5BFC;&#x9875;&#x9762;&#x4E0A;&#x7684;&#x6587;&#x672C;&#x3002;</p>
<p><img src="https://www.programmingdesignsystems.com/assets/layout/a-short-history-of-geometric-composition/tschichold.jpg" alt=""></p>
<blockquote>
<p>&#x4ECE;JanTschichold&#x7684;&#x6B7B;&#x65B0;&#x6392;&#x7248;&#x7684;&#x9875;&#x9762;&#x5212;&#x5206;&#x7684;&#x4F8B;&#x5B50;&#x3002;</p>
</blockquote>
<p>&#x8FD9;&#x4E9B;&#x60F3;&#x6CD5;&#x8FC5;&#x901F;&#x4F20;&#x904D;&#x6574;&#x4E2A;&#x6B27;&#x6D32;&#xFF0C;&#x5E76;&#x5728;&#x7B2C;&#x4E8C;&#x6B21;&#x4E16;&#x754C;&#x5927;&#x6218;&#x9020;&#x6210;&#x7684;&#x6B27;&#x6D32;&#x79FB;&#x6C11;&#x7684;&#x63A8;&#x52A8;&#x4E0B;&#x8FDB;&#x5165;&#x7F8E;&#x56FD;&#x3002;&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x7F51;&#x683C;&#x7CFB;&#x7EDF;&#x5728;&#x4E8C;&#x5341;&#x4E16;&#x7EAA;&#x4E94;&#x516D;&#x5341;&#x5E74;&#x4EE3;&#x7684;&#x5E7F;&#x544A;&#x9EC4;&#x91D1;&#x65F6;&#x4EE3;&#x7684;&#x4EA7;&#x54C1;&#x4E2D;&#x88AB;&#x50CF;&#x4FDD;&#x7F57;&#x5170;&#x5FB7;&#x548C;&#x7D22;&#x5C14;&#x5DF4;&#x65AF;&#x8FD9;&#x6837;&#x7684;&#x8BBE;&#x8BA1;&#x5E08;&#x6240;&#x91C7;&#x7528;&#xFF0C;&#x4ED6;&#x4EEC;&#x5021;&#x5BFC;&#x5728;&#x7F51;&#x683C;&#x7684;&#x8303;&#x56F4;&#x5185;&#x4F7F;&#x7528;&#x5BCC;&#x6709;&#x8868;&#x73B0;&#x529B;&#x7684;&#x5F62;&#x72B6;&#x548C;&#x5B57;&#x4F53;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x4ECA;&#x5929;&#x770B;&#x5230;&#x8FD9;&#x4E9B;&#x8BBE;&#x8BA1;&#x4EA7;&#x54C1;&#x65F6;&#xFF0C;&#x5B83;&#x4EEC;&#x662F;&#x8FD9;&#x79CD;&#x4E8C;&#x5143;&#x6027;&#x7684;&#x4E00;&#x4E2A;&#x4EE4;&#x4EBA;&#x96BE;&#x4EE5;&#x7F6E;&#x4FE1;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;&#x4E00;&#x79CD;&#x53D7;&#x51E0;&#x4F55;&#x539F;&#x7406;&#x7EA6;&#x675F;&#x7684;&#x827A;&#x672F;&#x6E38;&#x620F;&#x6027;&#x3002;</p>
<p><img src="https://www.programmingdesignsystems.com/assets/layout/a-short-history-of-geometric-composition/colorforms.jpg" alt=""></p>
<blockquote>
<p>&#x8272;&#x5F69;&#x5F62;&#x5F0F;&#x7684;&#x6807;&#x5FD7;&#x4FDD;&#x7F57;&#x5170;&#x5FB7;&#xFF0C;1959&#x5E74;&#x3002;</p>
</blockquote>
<p><img src="https://www.programmingdesignsystems.com/assets/layout/a-short-history-of-geometric-composition/vertigo.jpg" alt=""></p>
<blockquote>
<p>&#x7D22;&#x5C14;&#xB7;&#x5DF4;&#x65AF;&#x7684;&#x7729;&#x6655;&#x6D77;&#x62A5;&#xFF0C;1959&#x5E74;&#x3002;</p>
</blockquote>
<p>Tschichold&#x7684;&#x73B0;&#x4EE3;&#x4E3B;&#x4E49;&#x601D;&#x60F3;&#x5728;&#x6218;&#x540E;&#x6700;&#x8457;&#x540D;&#x7684;&#x5E7F;&#x544A;&#x8BBE;&#x8BA1;&#x4E4B;&#x4E00;-&#x201C;&#x601D;&#x8003;&#x5C0F;&#x5927;&#x4F17;&#x201D;(ThinkSmallVolkswagen)&#x5E7F;&#x544A;&#x8BBE;&#x8BA1;&#x4E2D;&#x660E;&#x663E;&#x53EF;&#x89C1;&#x3002;&#x5927;&#x4F17;&#x7532;&#x58F3;&#x866B;&#x6700;&#x521D;&#x662F;&#x7531;&#x8D39;&#x8FEA;&#x5357;&#x5FB7;&#x4FDD;&#x65F6;&#x6377;&#x4E3A;&#x963F;&#x9053;&#x592B;&#x5E0C;&#x7279;&#x52D2;&#x7684;&#x7B2C;&#x4E09;&#x5E1D;&#x56FD;&#x4EBA;&#x6C11;&#x8BBE;&#x8BA1;&#x7684;&#xFF0C;&#x628A;&#x8FD9;&#x8F86;&#x8F66;&#x5356;&#x7ED9;&#x7F8E;&#x56FD;&#x6D88;&#x8D39;&#x8005;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x4EF6;&#x5C0F;&#x4E8B;&#x3002;&#x5DE7;&#x5999;&#x7684;&#x6587;&#x672C;&#x590D;&#x5236;&#x548C;&#x975E;&#x5E38;&#x73B0;&#x4EE3;&#x7684;&#x5916;&#x89C2;&#xFF0C;&#x8BA4;&#x4E3A;&#x5C0F;&#x6218;&#x5F79;&#x5E2E;&#x52A9;&#x4F7F;&#x7532;&#x58F3;&#x866B;&#x5728;&#x7F8E;&#x56FD;&#x5E02;&#x573A;&#x4E0A;&#x53D6;&#x5F97;&#x4E86;&#x5DE8;&#x5927;&#x7684;&#x6210;&#x529F;&#x3002;</p>
<p><img src="https://www.programmingdesignsystems.com/assets/layout/a-short-history-of-geometric-composition/thinksmall2.jpg" alt=""></p>
<blockquote>
<p>&#x5C0F;&#x89C4;&#x6A21;&#x7684;&#x5E7F;&#x544A;&#x5BA3;&#x4F20;&#x6D3B;&#x52A8;&#x3002;</p>
</blockquote>
<p>20&#x4E16;&#x7EAA;60&#x5E74;&#x4EE3;&#x51FA;&#x73B0;&#x4E86;&#x4E00;&#x79CD;&#x53EB;&#x505A;&#x745E;&#x58EB;&#x98CE;&#x683C;&#x7684;&#x65B0;&#x7684;&#x8BBE;&#x8BA1;&#x7F8E;&#x5B66;&#xFF0C;&#x5728;&#x90A3;&#x91CC;&#xFF0C;&#x8BBE;&#x8BA1;&#x5E08;&#x4EEC;&#x5F00;&#x59CB;&#x4E3B;&#x5F20;&#x4E00;&#x79CD;&#x66F4;&#x7CFB;&#x7EDF;&#x3001;&#x66F4;&#x6570;&#x5B66;&#x7684;&#x8BBE;&#x8BA1;&#x65B9;&#x6CD5;&#x3002;&#x745E;&#x58EB;&#x8BBE;&#x8BA1;&#x5E08;&#x5199;&#x7684;&#x4E24;&#x672C;&#x4E66;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x8FD9;&#x4E00;&#x8FD0;&#x52A8;&#x7684;&#x6838;&#x5FC3;&#xFF1A;&#x5E73;&#x9762;&#x8BBE;&#x8BA1;&#x4E2D;&#x7684;&#x7F51;&#x683C;&#x7CFB;&#x7EDF;(JosephM&#xFC;ller-Brocmann 8)&#x548C;&#x5361;&#x5C14;&#xB7;&#x683C;&#x65AF;&#x7279;&#x7EB3;(KarlGerstner)&#x7684;&#x8BBE;&#x8BA1;&#x7A0B;&#x5E8F;&#x3002;&#x5E03;&#x7F57;&#x514B;&#x66FC;&#x4E3B;&#x5F20;&#x7EDD;&#x5BF9;&#x7684;&#x6781;&#x7B80;&#x8BBE;&#x8BA1;&#x98CE;&#x683C;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x7F51;&#x683C;&#x7CFB;&#x7EDF;&#x5C06;&#x8BBE;&#x8BA1;&#x5143;&#x7D20;&#x7EC4;&#x7EC7;&#x6210;&#x4E00;&#x4E2A;&#x4E25;&#x683C;&#x7684;&#x89C6;&#x89C9;&#x5C42;&#x6B21;&#x7ED3;&#x6784;&#x3002;</p>
<p><img src="https://www.programmingdesignsystems.com/assets/layout/a-short-history-of-geometric-composition/brockmann-span.jpg" alt=""></p>
<blockquote>
<p>&#x56FE;&#x6765;&#x81EA;&#x7EA6;&#x745F;&#x592B;&#x7A46;&#x52D2;-&#x5E03;&#x7F57;&#x514B;&#x66FC;&#x7684;&#x7F51;&#x683C;&#x7CFB;&#x7EDF;&#x5728;&#x5E73;&#x9762;&#x8BBE;&#x8BA1;&#xFF0C;&#x8BF4;&#x660E;&#x5982;&#x4F55;&#x5BF9;&#x9F50;&#x7C7B;&#x578B;&#x4E0E;&#x7F51;&#x683C;&#x3002;</p>
</blockquote>
<p>&#x4E86;&#x89E3;&#x5E03;&#x7F57;&#x514B;&#x66FC;&#x5173;&#x4E8E;&#x7F51;&#x683C;&#x7CFB;&#x7EDF;&#x7684;&#x6982;&#x5FF5;&#x5982;&#x4F55;&#x4E0E;&#x4ED6;&#x7684;&#x524D;&#x4EFB;&#x533A;&#x5206;&#x5F00;&#x6765;&#x662F;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x3002;&#x5E03;&#x7F57;&#x514B;&#x66FC;&#x8BA4;&#x4E3A;&#xFF0C;&#x7F51;&#x683C;&#x7CFB;&#x7EDF;&#x5E94;&#x8BE5;&#x662F;&#x7EDD;&#x5BF9;&#x7EDF;&#x4E00;&#x7684;&#xFF0C;&#x5B83;&#x662F;&#x901A;&#x8FC7;&#x5C06;&#x753B;&#x5E03;&#x5206;&#x6210;&#x5927;&#x5C0F;&#x76F8;&#x7B49;&#x7684;&#x5217;&#x548C;&#x884C;&#x6765;&#x521B;&#x5EFA;&#x7684;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x8BBE;&#x8BA1;&#x4EBA;&#x5458;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x57FA;&#x672C;&#x7684;&#x6784;&#x5EFA;&#x5757;-&#x79F0;&#x4E3A;&#x6A21;&#x5757;-&#x6CBF;&#x5217;&#x5782;&#x76F4;&#x5730;&#x6D41;&#x52A8;&#x6587;&#x672C;&#x6216;&#x56FE;&#x50CF;&#xFF0C;&#x6CBF;&#x884C;&#x6C34;&#x5E73;&#x6D41;&#x52A8;&#xFF0C;&#x6216;&#x8005;&#x4E24;&#x8005;&#x90FD;&#x6D41;&#x3002;&#x5728;&#x5E03;&#x7F57;&#x514B;&#x66FC;&#x770B;&#x6765;&#xFF0C;&#x8BBE;&#x8BA1;&#x5E08;&#x6CA1;&#x6709;&#x673A;&#x4F1A;&#x624B;&#x52A8;&#x8C03;&#x6574;&#x4E00;&#x4E9B;&#x5143;&#x7D20;&#x7684;&#x5927;&#x5C0F;&#x3002;&#x7F8E;&#x4E3D;&#x6765;&#x81EA;&#x4E8E;&#x6BD4;&#x4F8B;&#x7F51;&#x683C;&#x7684;&#x4E25;&#x683C;&#x6027;&#x3002;</p>
<p>&#x53EF;&#x4EE5;&#x516C;&#x5E73;&#x5730;&#x8BF4;&#xFF0C;&#x745E;&#x58EB;&#x98CE;&#x683C;&#x4EE3;&#x8868;&#x4E86;&#x4E00;&#x4E2A;&#x6781;&#x7AEF;&#x7684;&#x89C2;&#x70B9;&#xFF0C;&#x5982;&#x4F55;&#x5728;&#x89C6;&#x89C9;&#x8BBE;&#x8BA1;&#x4E2D;&#x4F7F;&#x7528;&#x51E0;&#x4F55;&#x6784;&#x56FE;&#x3002;&#x5BF9;&#x4E8E;&#x8FD9;&#x79CD;&#x7EAF;&#x7CB9;&#x529F;&#x80FD;&#x827A;&#x672F;&#x7684;&#x7C89;&#x4E1D;&#x6765;&#x8BF4;&#xFF0C;&#x5E03;&#x7F57;&#x514B;&#x66FC;&#x7684;&#x4F5C;&#x54C1;&#x7531;&#x4E8E;&#x5176;&#x4E25;&#x8C28;&#x548C;&#x7F3A;&#x4E4F;&#x88C5;&#x9970;&#x7269;&#x800C;&#x4FDD;&#x6301;&#x7740;&#x6781;&#x5927;&#x7684;&#x6E05;&#x6670;&#x6027;&#x3002;&#x5BF9;&#x8BC4;&#x8BBA;&#x5BB6;&#x6765;&#x8BF4;&#xFF0C;&#x540C;&#x6837;&#x7684;&#x8BBE;&#x8BA1;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x51B7;&#x9177;&#x65E0;&#x60C5;&#x7684;&#xFF0C;&#x7F3A;&#x4E4F;&#x7F8E;&#x56FD;&#x540C;&#x4E8B;&#x5728;&#x5DE5;&#x4F5C;&#x4E2D;&#x770B;&#x5230;&#x7684;&#x521B;&#x9020;&#x6027;&#x548C;&#x8DA3;&#x5473;&#x6027;&#x3002;</p>
<p><img src="https://www.programmingdesignsystems.com/assets/layout/a-short-history-of-geometric-composition/brockmann2.jpg" alt=""></p>
<blockquote>
<p>&#x6D77;&#x62A5;&#x662F;&#x7EA6;&#x745F;&#x592B;&#xB7;&#x7A46;&#x52D2;&#xB7;&#x5E03;&#x7F57;&#x514B;&#x66FC;&#x7684;&#x3002;</p>
</blockquote>
<p>&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF0C;&#x7F51;&#x683C;&#x7CFB;&#x7EDF;&#x7684;&#x6982;&#x5FF5;&#x6709;&#x4E24;&#x4E2A;&#x76EE;&#x7684;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x5B83;&#x662F;&#x8BBE;&#x8BA1;&#x4EA7;&#x54C1;&#x7684;&#x6280;&#x672F;&#x5236;&#x9020;&#x8FC7;&#x7A0B;&#x7684;&#x526F;&#x4EA7;&#x54C1;&#x3002;&#x5370;&#x5237;&#x673A;&#x662F;&#x901A;&#x8FC7;&#x5728;&#x5370;&#x7248;&#x4E0A;&#x7EC4;&#x88C5;&#x5C0F;&#x7684;&#x77E9;&#x5F62;&#x5B57;&#x6BCD;&#x5757;&#x6765;&#x5DE5;&#x4F5C;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x8BBE;&#x8BA1;&#x5E08;&#x5FC5;&#x987B;&#x4ECE;&#x7F51;&#x683C;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x8003;&#x8651;&#x8BBE;&#x8BA1;&#x8FC7;&#x7A0B;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7F51;&#x683C;&#x662F;&#x8BBE;&#x8BA1;&#x8005;&#x5FC5;&#x987B;&#x89E3;&#x51B3;&#x7684;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x9650;&#x5236;&#x3002;&#x5176;&#x6B21;&#xFF0C;&#x7F51;&#x683C;&#x7CFB;&#x7EDF;&#x4E5F;&#x662F;&#x8BBE;&#x8BA1;&#x5E08;&#x7528;&#x6765;&#x5B9E;&#x73B0;&#x6709;&#x7EC4;&#x7EC7;&#x5E03;&#x5C40;&#x7684;&#x8BBE;&#x8BA1;&#x65B9;&#x6CD5;&#xFF0C;&#x5373;&#x4F7F;&#x5728;&#x6CA1;&#x6709;&#x8FD9;&#x79CD;&#x6280;&#x672F;&#x9650;&#x5236;&#x7684;&#x5730;&#x65B9;&#x4E5F;&#x662F;&#x5982;&#x6B64;&#x3002;&#x5F53;&#x7F51;&#x683C;&#x7CFB;&#x7EDF;&#x5728;2000&#x5E74;&#x4EE3;&#x4E2D;&#x671F;&#x5728;&#x7F51;&#x9875;&#x8BBE;&#x8BA1;&#x4E2D;&#x6D41;&#x884C;&#x65F6;&#xFF0C;&#x8FD9;&#x4E9B;&#x56E0;&#x7D20;&#x7684;&#x7ED3;&#x5408;&#x5BFC;&#x81F4;&#x4E86;&#x7F51;&#x683C;&#x7CFB;&#x7EDF;&#x7684;&#x51FA;&#x73B0;&#x3002;&#x4E00;&#x65B9;&#x9762;&#xFF0C;HTML(&#x7F51;&#x7AD9;&#x7684;&#x6587;&#x6863;&#x683C;&#x5F0F;)&#x4F7F;&#x7528;&#x77E9;&#x5F62;&#x5143;&#x7D20;&#x64CD;&#x4F5C;&#xFF0C;&#x8FD9;&#x4E9B;&#x5143;&#x7D20;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x5448;&#x73B0;&#x65F6;&#x4F1A;&#x5C06;&#x540E;&#x7EED;&#x5143;&#x7D20;&#x5411;&#x4E0B;&#x63A8;&#x5230;&#x9875;&#x9762;&#x4E0A;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5217;&#x7F51;&#x683C;&#x662F;&#x4E00;&#x4E2A;&#x81EA;&#x7136;&#x5BB9;&#x5668;&#xFF0C;&#x56E0;&#x4E3A;&#x5185;&#x5BB9;&#x53EF;&#x4EE5;&#x5782;&#x76F4;&#x6D41;&#x52A8;&#x800C;&#x4E0D;&#x4F1A;&#x7834;&#x574F;&#x8BBE;&#x8BA1;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x4E0D;&#x53D7;&#x673A;&#x68B0;&#x7CFB;&#x7EDF;&#x7684;&#x9650;&#x5236;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x4ECA;&#x5929;&#x7684;&#x7F51;&#x7EDC;&#x4E0A;&#x7EE7;&#x7EED;&#x4F7F;&#x7528;&#x7F51;&#x683C;&#x7CFB;&#x7EDF;&#x662F;&#x4E00;&#x79CD;&#x72EC;&#x7ACB;&#x4E8E;&#x5A92;&#x4ECB;&#x7EA6;&#x675F;&#x7684;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#x3002;&#x7B80;&#x77ED;&#x5730;&#x56DE;&#x987E;&#x4E00;&#x4E0B;&#x4F5C;&#x4E3A;&#x4E92;&#x8054;&#x7F51;&#x4E0A;&#x6700;&#x53D7;&#x6B22;&#x8FCE;&#x7684;&#x7F51;&#x7AD9;&#x4E4B;&#x4E00;&#x7684;nytimes.com&#xFF0C;&#x5B83;&#x5728;&#x7B2C;&#x4E00;&#x4E2A;&#x5341;&#x5E74;&#x91CC;&#x662F;&#x5982;&#x4F55;&#x8FDB;&#x5316;&#x7684;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x6709;&#x52A9;&#x4E8E;&#x8BF4;&#x660E;&#x8FD9;&#x4E00;&#x70B9;&#x3002;</p>
<p>&#x201C;&#x7EBD;&#x7EA6;&#x65F6;&#x62A5;&#x201D;&#x4E8E;&#x4ECA;&#x5E74;1&#x6708;&#x5F00;&#x901A;&#x4E86;&#x6BCF;&#x65E5;&#x65B0;&#x95FB;&#x7F51;&#x7AD9;&#xFF0C;&#x5C31;&#x5728;&#x4E92;&#x8054;&#x7F51;&#x4ECE;&#x4E00;&#x4E2A;&#x7531;&#x5B66;&#x672F;&#x673A;&#x6784;&#x7EC4;&#x6210;&#x7684;&#x79C1;&#x4EBA;&#x7F51;&#x7EDC;&#x8FC7;&#x6E21;&#x5230;&#x516C;&#x5171;&#x5546;&#x4E1A;&#x5A92;&#x4F53;&#x7684;&#x51E0;&#x5E74;&#x540E;&#x3002;&#x5C3D;&#x7BA1;&#x6211;&#x4EEC;&#x4ECA;&#x5929;&#x4F7F;&#x7528;&#x7684;&#x8BB8;&#x591A;&#x7F51;&#x7EDC;&#x6280;&#x672F;&#x90FD;&#x4EE5;&#x67D0;&#x79CD;&#x5F62;&#x5F0F;&#x5B58;&#x5728;&#xFF0C;&#x4F46;&#x7F51;&#x7AD9;&#x8BBE;&#x8BA1;&#x8005;&#x5728;&#x521B;&#x5EFA;&#x7F51;&#x7AD9;&#x65F6;&#x4EC5;&#x9650;&#x4E8E;&#x4E00;&#x4E9B;&#x57FA;&#x672C;&#x6280;&#x672F;&#x3002;<a href="http://web.archive.org/web/19961112181513/http://www.nytimes.com:80/" target="_blank">nytimes.com&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x7248;&#x672C;</a>&#x7531;&#x4E00;&#x4E2A;575&#xD7;300&#x50CF;&#x7D20;&#x7684;&#x56FE;&#x50CF;&#x7EC4;&#x6210;&#xFF0C;&#x5206;&#x5272;&#x6210;&#x53EF;&#x70B9;&#x51FB;&#x7684;&#x533A;&#x57DF;&#x3002;&#x7531;&#x4E8E;&#x56FE;&#x50CF;&#x662F;&#x8DE8;&#x6D4F;&#x89C8;&#x5668;&#x521B;&#x5EFA;&#x4E00;&#x81F4;&#x8BBE;&#x8BA1;&#x7684;&#x552F;&#x4E00;&#x9014;&#x5F84;&#xFF0C;&#x8FD9;&#x79CD;&#x6280;&#x672F;-&#x79F0;&#x4E3A;&#x56FE;&#x50CF;&#x6620;&#x5C04;-&#x5728;&#x7F51;&#x7EDC;&#x7684;&#x65E9;&#x671F;&#x88AB;&#x5927;&#x91CF;&#x4F7F;&#x7528;&#x3002;&#x8FD9;&#x4E2A;&#x8BBE;&#x8BA1;&#x4ECE;&#x5370;&#x5237;&#x7684;&#x62A5;&#x7EB8;&#x4E2D;&#x83B7;&#x5F97;&#x4E86;&#x5F88;&#x5927;&#x7684;&#x7075;&#x611F;&#xFF0C;&#x5305;&#x62EC;&#x4E00;&#x4E2A;&#x5C45;&#x4E2D;&#x7684;&#x6807;&#x5FD7;&#xFF0C;&#x4E00;&#x4E2A;&#x5E26;&#x6709;&#x62A5;&#x7EB8;&#x6807;&#x8BED;&#x7684;&#x65E5;&#x671F;&#x6761;(&#x8BBD;&#x523A;&#x7684;&#x662F;&#xFF0C;&#x201C;&#x6240;&#x6709;&#x9002;&#x5408;&#x5370;&#x5237;&#x7684;&#x65B0;&#x95FB;&#x201D;)&#xFF0C;&#x4EE5;&#x53CA;&#x4E00;&#x4E2A;&#x4E09;&#x680F;&#x7684;&#x5E03;&#x5C40;&#x3002;&#x8003;&#x8651;&#x5230;&#x8FD9;&#x4E2A;&#x56FE;&#x50CF;&#x662F;&#x5728;&#x56FE;&#x5F62;&#x7A0B;&#x5E8F;&#x4E2D;&#x624B;&#x5DE5;&#x521B;&#x5EFA;&#x7684;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4EE5;&#x7F16;&#x7A0B;&#x7684;&#x65B9;&#x5F0F;&#x521B;&#x5EFA;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x4ECE;&#x4ECA;&#x5929;&#x7684;&#x7F51;&#x7EDC;&#x7F51;&#x683C;&#x7CFB;&#x7EDF;&#x4E2D;&#x4E86;&#x89E3;&#x5230;&#x7684;&#x8BB8;&#x591A;&#x7CFB;&#x7EDF;&#x7279;&#x6027;&#x90FD;&#x88AB;&#x5FFD;&#x7565;&#x4E86;&#xFF1A;&#x5217;&#x4E0D;&#x662F;&#x57FA;&#x4E8E;&#x4E00;&#x4E2A;&#x7EDF;&#x4E00;&#x7684;&#x5355;&#x5143;&#xFF0C;&#x5E76;&#x4E14;&#x5185;&#x5BB9;&#x6CA1;&#x6709;&#x5782;&#x76F4;&#x5EF6;&#x4F38;&#x5230;&#x5C4F;&#x5E55;&#x533A;&#x57DF;&#x4E0B;&#x9762;&#x3002;&#x7531;&#x4E8E;&#x8BB8;&#x591A;&#x65B0;&#x6280;&#x672F;&#xFF0C;&#x65E9;&#x671F;&#x7684;&#x7F51;&#x9875;&#x590D;&#x5236;&#x4E86;&#x73B0;&#x6709;&#x6280;&#x672F;&#x7684;&#x5F62;&#x5F0F;&#xFF0C;&#x800C;&#x8FD9;&#x79CD;&#x7F51;&#x9875;&#x8BBE;&#x8BA1;&#x663E;&#x7136;&#x8BA9;&#x4EBA;&#x8054;&#x60F3;&#x5230;&#x62A5;&#x7EB8;&#x7F51;&#x683C;&#x3002;</p>
<p><img src="https://www.programmingdesignsystems.com/assets/layout/a-short-history-of-geometric-composition/nytimes-1996.png" alt=""></p>
<blockquote>
<p>&#x7EBD;&#x7EA6;&#x65F6;&#x62A5;&#x7F51;&#x7AD9;&#x4E8E;1996&#x5E74;11&#x6708;12&#x65E5;&#x3002;</p>
</blockquote>
<p><a href="http://web.archive.org/web/19981212020124/http://nytimes.com:80/" target="_blank">1998&#x5E74;&#x5E95;</a>&#xFF0C;nytimes.com&#x7528;&#x5355;&#x4E2A;HTML&#x5143;&#x7D20;&#x66FF;&#x6362;&#x4E86;&#x9759;&#x6001;&#x6620;&#x50CF;&#xFF0C;&#x5141;&#x8BB8;&#x5B83;&#x4EEC;&#x7684;&#x5185;&#x5BB9;&#x5728;&#x4E00;&#x5929;&#x4E2D;&#x5355;&#x72EC;&#x66F4;&#x65B0;&#x3002;&#x8FD9;&#x4E2A;&#x5E03;&#x5C40;&#x5305;&#x542B;&#x4E86;&#x6211;&#x4EEC;&#x8BA4;&#x4E3A;&#x5BF9;&#x7F51;&#x7EDC;&#x4E0A;&#x7684;&#x73B0;&#x4EE3;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x7684;&#x8BB8;&#x591A;&#x6280;&#x672F;&#xFF1A;&#x4E00;&#x4E2A;&#x5E26;&#x6709;&#x5806;&#x53E0;&#x83DC;&#x5355;&#x5BFC;&#x822A;&#x7684;&#x4FA7;&#x8FB9;&#x680F;&#x3001;&#x4F4D;&#x4E8E;&#x5C4F;&#x5E55;&#x4E4B;&#x5916;&#x7684;&#x5782;&#x76F4;&#x5217;&#x4E2D;&#x7684;&#x6587;&#x7AE0;&#x5217;&#x8868;&#xFF0C;&#x4EE5;&#x53CA;&#x5BF9;&#x8FD9;&#x4E9B;&#x5185;&#x5BB9;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#x7684;&#x6807;&#x7B7E;&#x3002;&#x5C3D;&#x7BA1;&#x5982;&#x6B64;&#xFF0C;&#x8FD9;&#x79CD;&#x66F4;&#x5E7F;&#x6CDB;&#x7684;&#x4E09;&#x5217;&#x5E03;&#x5C40;&#x5E76;&#x4E0D;&#x7B26;&#x5408;&#x7F51;&#x683C;&#x5217;&#x7684;&#x7EDF;&#x4E00;&#x5EA6;&#x91CF;&#xFF0C;&#x800C;&#x4E14;&#x9875;&#x9762;&#x7684;&#x8868;&#x793A;&#x6280;&#x672F;&#x4E5F;&#x5404;&#x4E0D;&#x76F8;&#x540C;&#x3002;</p>
<p><img src="https://www.programmingdesignsystems.com/assets/layout/a-short-history-of-geometric-composition/nytimes-1999.png" alt=""></p>
<blockquote>
<p>&#x300A;&#x7EBD;&#x7EA6;&#x65F6;&#x62A5;&#x300B;&#x7F51;&#x7AD9;1999&#x5E74;2&#x6708;1&#x65E5;&#x3002;</p>
</blockquote>
<p>&#x8FD9;&#x4E2A;&#x5E03;&#x5C40;&#x4F7F;&#x7528;HTML&#x5C5E;&#x6027;&#x800C;&#x4E0D;&#x662F;&#x5171;&#x4EAB;&#x7684;CSS&#x6587;&#x4EF6;&#x6765;&#x5B9E;&#x73B0;&#x8BBE;&#x8BA1;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x6BCF;&#x4E00;&#x9875;&#x90FD;&#x5BF9;&#x5176;&#x89C6;&#x89C9;&#x8BBE;&#x8BA1;&#x8D1F;&#x8D23;&#xFF0C;&#x7F51;&#x683C;&#x6D4B;&#x91CF;&#x7684;&#x5927;&#x90E8;&#x5206;&#x53D8;&#x5316;&#x53EF;&#x4EE5;&#x89E3;&#x91CA;&#x4E3A;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x4E8B;&#x5B9E;&#xFF1A;&#x201C;&#x7EBD;&#x7EA6;&#x65F6;&#x62A5;&#x201D;&#x7684;&#x8BBE;&#x8BA1;&#x5E08;&#x6CA1;&#x6709;&#x88AB;&#x8FEB;&#x5BF9;&#x8BBE;&#x8BA1;&#x8FDB;&#x884C;&#x7CFB;&#x7EDF;&#x7684;&#x601D;&#x8003;&#x3002;&#x968F;&#x7740;CSS&#x7684;&#x4F7F;&#x7528;&#x5728;&#x968F;&#x540E;&#x7684;&#x51E0;&#x5E74;&#x4E2D;&#x52A0;&#x901F;&#xFF0C;&#x7F51;&#x9875;&#x8BBE;&#x8BA1;&#x5E08;&#x5F00;&#x59CB;&#x4E3B;&#x5F20;&#x5C06;&#x4E25;&#x683C;&#x7684;&#x73B0;&#x4EE3;&#x4E3B;&#x4E49;&#x7F51;&#x683C;&#x5F15;&#x5165;&#x7F51;&#x7EDC;&#x3002;</p>
<p>&#x201C;CSS&#x7F51;&#x683C;&#x7CFB;&#x7EDF;&#x201D;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;Google&#x7ED3;&#x679C;&#x6765;&#x81EA;&#x4E00;&#x7BC7;&#x9898;&#x4E3A;&#x201C;<a href="https://web.archive.org/web/20030210232010/http://www.alistapart.com:80/stories/flexiblelayouts/" target="_blank">&#x7075;&#x6D3B;&#x5E03;&#x5C40;&#x4E0E;CSS&#x5B9A;&#x4F4D;</a>&#x201D;&#x7684;&#x6587;&#x7AE0;&#x3002;&#x5728;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x4E2D;&#xFF0C;Falby&#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x79CD;&#x901A;&#x7528;&#x7684;&#x3001;&#x7075;&#x6D3B;&#x7684;&#x5E03;&#x5C40;&#x7CFB;&#x7EDF;&#xFF0C;&#x80FD;&#x591F;&#x9002;&#x5E94;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x5927;&#x5C0F;&#x3002;2004&#x5E74;&#xFF0C;&#x201C;&#x7EBD;&#x7EA6;&#x65F6;&#x62A5;&#x201D;&#x5728;&#x7EBF;&#x8BBE;&#x8BA1;&#x603B;&#x76D1;KhoiVinh&#x53D1;&#x8868;&#x4E86;&#x4E00;&#x7BC7;&#x540D;&#x4E3A;&#x201C;<a href="https://web.archive.org/web/20050106024725/http://www.subtraction.com:80/archives/2004/1231_grid_computi.php" target="_blank">&#x7F51;&#x683C;&#x8BA1;&#x7B97;&#x2026;</a>&#x201D;&#x7684;&#x535A;&#x5BA2;&#x6587;&#x7AE0;..&#x5728;&#x8BBE;&#x8BA1;&#x65B9;&#x9762;&#xFF0C;&#x4ED6;&#x4E3B;&#x5F20;&#x5728;&#x7F51;&#x9875;&#x8BBE;&#x8BA1;&#x4E2D;&#x4F7F;&#x7528;&#x7EDF;&#x4E00;&#x7684;&#x7F51;&#x683C;&#x5355;&#x5143;&#xFF1A;</p>
<blockquote>
<p>&#x201C;&#x65B0;&#x7684;&#x5E03;&#x5C40;&#x4F7F;&#x7528;&#x4E86;8&#x5217;&#x548C;4&#x2018;&#x8D85;&#x7EA7;&#x5217;&#xFF0C;&#x5B83;&#x5C06;&#x6240;&#x6709;&#x7684;&#x4E1C;&#x897F;&#x90FD;&#x56FA;&#x5B9A;&#x5728;&#x8FD9;&#x4E2A;&#x7ED3;&#x6784;&#x4E2D;[.]&#x6BCF;&#x5217;&#x90FD;&#x662F;95&#x50CF;&#x7D20;&#x5BBD;&#x7684;&#xFF0C;&#x7528;&#x4E00;&#x4E2A;10&#x50CF;&#x7D20;&#x7684;&#x6392;&#x6C34;&#x6C9F;&#x9694;&#x5F00;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x6211;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x903B;&#x8F91;&#x5BBD;&#x5EA6;&#x7684;&#x56FE;&#x5F62;&#xFF0C;&#x6BCF;&#x4E2A;&#x589E;&#x52A0;&#x5927;&#x7EA6;95&#x50CF;&#x7D20;&#x201D;&#x3002;
<a href="https://web.archive.org/web/20050106024725/http://www.subtraction.com:80/archives/2004/1231_grid_computi.php" target="_blank">Khoi Vinh</a></p>
</blockquote>
<p>&#x8FD9;&#x662F;&#x7B2C;&#x4E00;&#x4E2A;&#x5728;&#x7EBF;&#x53C2;&#x8003;&#xFF0C;&#x660E;&#x786E;&#x63CF;&#x8FF0;&#x4E86;&#x4E00;&#x79CD;&#x6280;&#x672F;&#x7684;&#x7F51;&#x9875;&#x5E03;&#x5C40;&#xFF0C;&#x53CD;&#x6620;&#x4E86;&#x5728;&#x5E03;&#x7F57;&#x514B;&#x66FC;&#x7684;&#x7F51;&#x683C;&#x7CFB;&#x7EDF;&#x5728;&#x56FE;&#x5F62;&#x8BBE;&#x8BA1;&#x4E2D;&#x63D0;&#x51FA;&#x7684;&#x6280;&#x672F;&#x3002;Vinh&#x5728;2008&#x5E74;&#x4E0E;&#x897F;&#x5357;&#x504F;&#x5357;&#x7684;MarkBoulton&#x7684;&#x4E00;&#x6B21;&#x6F14;&#x8BB2;&#x4E2D;&#x8FDB;&#x4E00;&#x6B65;&#x53D1;&#x5C55;&#x4E86;&#x8FD9;&#x4E9B;&#x60F3;&#x6CD5;&#xFF0C;&#x9898;&#x4E3A;&#x201C;&#x7F51;&#x683C;&#x662F;&#x597D;&#x7684;&#x201D;&#x3002;&#x540C;&#x6837;&#x5728;2008&#x5E74;&#xFF0C;&#x6D41;&#x884C;&#x7684;CSS&#x5E93;(&#x5982;960 Grid System&#x548C;Blueprint CSS)&#x5B9E;&#x73B0;&#x4E86;&#x8FD9;&#x79CD;&#x66F4;&#x4E25;&#x683C;&#x7684;&#x7F51;&#x683C;&#x7406;&#x5FF5;&#xFF0C;&#x800C;&#x8FD9;&#x4E9B;&#x601D;&#x60F3;&#x5728;&#x8FC7;&#x53BB;&#x7684;&#x73B0;&#x4EE3;CSS&#x5E93;&#x4E2D;&#x5E76;&#x6CA1;&#x6709;&#x53D1;&#x751F;&#x6839;&#x672C;&#x7684;&#x6539;&#x53D8;&#x3002;</p>
<p><img src="https://www.programmingdesignsystems.com/assets/layout/a-short-history-of-geometric-composition/nytimes-2006.png" alt=""></p>
<blockquote>
<p>&#x7EBD;&#x7EA6;&#x65F6;&#x62A5;&#x7F51;&#x7AD9;&#x4ECE;2006&#x5E74;10&#x6708;13&#x65E5;&#x5F00;&#x59CB;&#x3002;</p>
</blockquote>
<p>&#x201C;&#x7EBD;&#x7EA6;&#x65F6;&#x62A5;&#x201D;&#x7F51;&#x7AD9;&#x5728;2006&#x5E74;&#x63A8;&#x51FA;&#x4E86;<a href="http://web.archive.org/web/20060614201147/http://www.nytimes.com/" target="_blank">970px&#x7F51;&#x683C;&#x7CFB;&#x7EDF;</a>&#xFF0C;&#x63A5;&#x53D7;&#x4E86;&#x8BB8;&#x591A;&#x8FD9;&#x4E9B;&#x60F3;&#x6CD5;&#x3002;&#x867D;&#x7136;&#x4E0D;&#x662F;&#x4E25;&#x683C;&#x7684;&#x50CF;&#x7D20;&#x5B8C;&#x7F8E;&#xFF0C;&#x4F46;&#x4E2D;&#x5FC3;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#x662F;&#x4E00;&#x4E2A;11&#x5217;&#xFF0C;82&#x50CF;&#x7D20;&#x5217;&#x7F51;&#x683C;&#xFF0C;&#x89C6;&#x89C9;&#x98CE;&#x683C;&#x660E;&#x663E;&#x6BD4;&#x5176;&#x524D;&#x8EAB;&#x66F4;&#x4E25;&#x683C;&#x3002;&#x8FD9;&#x4E00;&#x683C;&#x5F0F;&#x5728;2013&#x5E74;&#x8FDB;&#x884C;&#x91CD;&#x5927;&#x91CD;&#x65B0;&#x8BBE;&#x8BA1;&#x4E4B;&#x524D;&#x4E00;&#x76F4;&#x4F7F;&#x7528;&#x3002;</p>
<p>&#x7F51;&#x683C;&#x7CFB;&#x7EDF;&#x662F;&#x5F53;&#x4ECA;&#x6570;&#x5B57;&#x8BBE;&#x8BA1;&#x7684;&#x91CD;&#x8981;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#x3002;&#x5728;&#x6784;&#x5EFA;&#x6570;&#x5B57;&#x4EA7;&#x54C1;&#x65F6;&#xFF0C;&#x8BBE;&#x8BA1;&#x4EBA;&#x5458;&#x4F7F;&#x7528;&#x7F51;&#x683C;&#x6765;&#x5EFA;&#x7ACB;&#x7A7A;&#x5BB9;&#x5668;&#xFF0C;&#x8FD9;&#x4E9B;&#x5BB9;&#x5668;&#x53EF;&#x4EE5;&#x52A8;&#x6001;&#x5730;&#x4E3A;&#x5355;&#x4E2A;&#x7528;&#x6237;&#x586B;&#x5145;&#x5185;&#x5BB9;&#x3002;&#x8FD9;&#x4E9B;&#x7F51;&#x683C;&#x7CFB;&#x7EDF;&#x7684;&#x5E94;&#x7528;&#x65B9;&#x5F0F;&#x4E0E;&#x51E0;&#x4E2A;&#x4E16;&#x7EAA;&#x524D;&#x7248;&#x753B;&#x5BB6;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#x7684;&#x65B9;&#x5F0F;&#x672C;&#x8D28;&#x4E0A;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x4E0D;&#x540C;&#xFF0C;&#x4F46;&#x4EBA;&#x4EEC;&#x53EF;&#x80FD;&#x4F1A;&#x8BF4;&#xFF0C;&#x968F;&#x7740;&#x6570;&#x5B57;&#x5185;&#x5BB9;&#x7684;&#x6FC0;&#x589E;&#xFF0C;&#x73B0;&#x5728;&#x5BF9;&#x8FD9;&#x4E9B;&#x7F51;&#x683C;&#x7CFB;&#x7EDF;&#x7684;&#x9700;&#x6C42;&#x66F4;&#x5927;&#xFF1A;&#x6570;&#x5B57;&#x8BBE;&#x8BA1;&#x4EA7;&#x54C1;&#x5FC5;&#x987B;&#x9002;&#x5E94;&#x4E0D;&#x540C;&#x7684;&#x5C4F;&#x5E55;&#x5927;&#x5C0F;&#xFF0C;&#x663E;&#x793A;&#x52A8;&#x6001;&#x5185;&#x5BB9;&#xFF0C;&#x56E0;&#x6B64;&#x6CA1;&#x6709;&#x771F;&#x6B63;&#x7684;&#x539F;&#x521B;&#x8BBE;&#x8BA1;&#x3002;&#x8FD9;&#x8FEB;&#x4F7F;&#x8BBE;&#x8BA1;&#x5E08;&#x7CFB;&#x7EDF;&#x5730;&#x601D;&#x8003;&#x89C6;&#x89C9;&#x5E03;&#x5C40;&#x3002;&#x5E0C;&#x671B;&#x8FD9;&#x77ED;&#x77ED;&#x7684;&#x5386;&#x53F2;&#x6709;&#x52A9;&#x4E8E;&#x9610;&#x660E;&#x8BBE;&#x8BA1;&#x5E08;&#x5982;&#x4F55;&#x5728;&#x51E0;&#x4E2A;&#x4E16;&#x7EAA;&#x4E2D;&#x4F7F;&#x7528;&#x51E0;&#x4F55;&#x6784;&#x56FE;&#x6280;&#x672F;&#x521B;&#x9020;&#x7F8E;&#x4E3D;&#x548C;&#x5E73;&#x8861;&#x7684;&#x8BBE;&#x8BA1;-&#x5728;&#x5370;&#x5237;&#x548C;&#x7F51;&#x7EDC;&#x4E0A;&#x3002;&#x5728;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x7AE0;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x7814;&#x7A76;&#x5982;&#x4F55;&#x5C06;&#x8FD9;&#x4E9B;&#x60F3;&#x6CD5;&#x5E94;&#x7528;&#x5230;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x7684;P5.js&#x8BBE;&#x8BA1;&#x4E2D;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"3.1 几何图形简史","level":"1.5.1","depth":2,"next":{"title":"未完持续更新...","level":"1.5.2","depth":2,"ref":"","articles":[]},"previous":{"title":"3.布局","level":"1.5","depth":1,"ref":"","articles":[{"title":"3.1 几何图形简史","level":"1.5.1","depth":2,"path":"chapters/3.1.md","ref":"chapters/3.1.md","articles":[]},{"title":"未完持续更新...","level":"1.5.2","depth":2,"ref":"","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"chapters/3.1.md","mtime":"2019-09-24T13:34:04.051Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-09-26T15:08:02.700Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

