
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>设计系统编程 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter active" data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    设计系统编程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    0.设计系统
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="chapters/0.html">
            
                <a href="chapters/0.html">
            
                    
                    0.1.什么是设计系统
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    1.形状
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="chapters/1.1.html">
            
                <a href="chapters/1.1.html">
            
                    
                    1.1 图形基础
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="chapters/1.2.html">
            
                <a href="chapters/1.2.html">
            
                    
                    1.2 基本形状
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="chapters/1.3.html">
            
                <a href="chapters/1.3.html">
            
                    
                    1.3 定制形状
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="chapters/1.4.html">
            
                <a href="chapters/1.4.html">
            
                    
                    1.4 程序形状
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    2.颜色
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="chapters/2.1.html">
            
                <a href="chapters/2.1.html">
            
                    
                    2.1 颜色理论简史
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="chapters/2.2.html">
            
                <a href="chapters/2.2.html">
            
                    
                    2.2 颜色模型及颜色空间
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="chapters/2.3.html">
            
                <a href="chapters/2.3.html">
            
                    
                    2.3 感知颜色空间的一致性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4" data-path="chapters/2.4.html">
            
                <a href="chapters/2.4.html">
            
                    
                    2.4 配色方案
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" >
            
                <span>
            
                    
                    3.布局
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="chapters/3.1.html">
            
                <a href="chapters/3.1.html">
            
                    
                    3.1 几何图形简史
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" >
            
                <span>
            
                    
                    未完持续更新...
            
                </span>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >设计系统编程</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x8BBE;&#x8BA1;&#x7CFB;&#x7EDF;&#x7F16;&#x7A0B;">&#x8BBE;&#x8BA1;&#x7CFB;&#x7EDF;&#x7F16;&#x7A0B;</h2>
<blockquote>
<p><a href="https://www.programmingdesignsystems.com/" target="_blank">&#x539F;&#x6587;&#x5730;&#x5740; https://www.programmingdesignsystems.com/</a> <br>
&#x8FD9;&#x662F;&#x4E00;&#x672C;&#x7531;<a href="https://twitter.com/runemadsen" target="_blank">Rune Madsen</a>&#x7F16;&#x8457;&#x7684;&#x4ECB;&#x7ECD;&#x5E73;&#x9762;&#x8BBE;&#x8BA1;&#x65B0;&#x57FA;&#x7840;&#x548C;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x7684;&#x514D;&#x8D39;&#x7535;&#x5B50;&#x4E66;&#x3002;&#x672C;&#x4E66;&#x8FD8;&#x5728;&#x8FDE;&#x8F7D;&#x4E2D;&#xFF0C;&#x66F4;&#x65B0;&#x52A8;&#x6001;&#x53EF;&#x4EE5;&#x5173;&#x6CE8;<a href="https://twitter.com/designsystemsin" target="_blank">&#x8FD9;&#x91CC;</a>&#x3002;
&#x7FFB;&#x8BD1;&amp;&#x6821;&#x9A8C;&#xFF1A;<a href="https://github.com/neekychan" target="_blank">neekychan</a>(<a href="https://weibo.com/cwlay" target="_blank">&#x5FAE;&#x535A;</a>) &#x548C; <a href="https://github.com/yylifen" target="_blank">freedom</a></p>
</blockquote>
<h3 id="&#x4ECB;&#x7ECD;">&#x4ECB;&#x7ECD;</h3>
<p><em>&#x201C;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x6B63;&#x4ECE;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x6587;&#x5316;&#x8FC7;&#x6E21;&#x5230;&#x9762;&#x5411;&#x7CFB;&#x7EDF;&#x7684;&#x6587;&#x5316;&#x3002;&#x8FD9;&#x91CC;&#x7684;&#x53D8;&#x5316;&#x4E0D;&#x662F;&#x6765;&#x81EA;&#x4E8E;&#x4E8B;&#x7269;&#xFF0C;&#x800C;&#x662F;&#x6765;&#x81EA;&#x4E8E;&#x505A;&#x4E8B;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x201C;</em></p>
<blockquote>
<p>&#x5F15;&#x7528;&#x81EA;Jack Burnham (1968)&#x300A;&#x7CFB;&#x7EDF;&#x7F8E;&#x5B66;&#x300B;</p>
</blockquote>
<p>&#x4F60;&#x8BA4;&#x4E3A;&#x5E73;&#x9762;&#x8BBE;&#x8BA1;&#x5E08;&#x662F;&#x4E00;&#x4E2A;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x89D2;&#x8272;&#x5462;&#xFF1F;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x7B54;&#x6848;&#x53EF;&#x80FD;&#x5927;&#x76F8;&#x5F84;&#x5EAD;&#xFF0C;&#x4F46;&#x6211;&#x7684;&#x5B9A;&#x4E49;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF1A;&#x5E73;&#x9762;&#x8BBE;&#x8BA1;&#x5E08;&#x662F;&#x4E00;&#x4E2A;&#x4EE5;&#x5F62;&#x72B6;&#x548C;&#x989C;&#x8272;&#x4F20;&#x8FBE;&#x5185;&#x5BB9;&#x7684;&#x4EBA;&#x3002;&#x8FD9;&#x9879;&#x5DE5;&#x4F5C;&#x53EF;&#x4EE5;&#x91C7;&#x53D6;&#x591A;&#x79CD;&#x5F62;&#x5F0F;&#xFF0C;&#x4F46;&#x76F4;&#x5230;&#x6700;&#x8FD1;&#xFF0C;&#x5370;&#x5237;&#x4EA7;&#x54C1;&#x5DF2;&#x7ECF;&#x6210;&#x4E3A;&#x5B83;&#x4E3B;&#x8981;&#x7684;&#x5F62;&#x5F0F;&#xFF0C;&#x5982;&#x6D77;&#x62A5;&#x3001;&#x540D;&#x7247;&#x3001;&#x4E66;&#x7C4D;&#x5C01;&#x9762;&#x7B49;&#x3002;</p>
<p>&#x4ECA;&#x5929;&#xFF0C;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x9762;&#x4E34;&#x7740;&#x65B0;&#x7684;&#x6311;&#x6218;&#xFF0C;&#x8FD9;&#x5E76;&#x4E0D;&#x662F;&#x56E0;&#x4E3A;&#x8BBE;&#x8BA1;&#x7684;&#x5B9A;&#x4E49;&#x53D1;&#x751F;&#x4E86;&#x5F88;&#x5927;&#x53D8;&#x5316;&#xFF0C;&#x800C;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x6784;&#x5EFA;&#x7684;&#x4EA7;&#x54C1;&#x53D1;&#x751F;&#x4E86;&#x53D8;&#x5316;&#x3002;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x5927;&#x90E8;&#x5206;&#x65F6;&#x95F4;&#x90FD;&#x82B1;&#x5728;&#x5C4F;&#x5E55;&#x4E0A;&#x800C;&#x4E0D;&#x662F;&#x7EB8;&#x4E0A;&#xFF0C;&#x8FD9;&#x5BF9;&#x61C2;&#x5F97;&#x5982;&#x4F55;&#x4E3A;&#x6570;&#x5B57;&#x8BBE;&#x5907;&#x8BBE;&#x8BA1;&#x7684;&#x8BBE;&#x8BA1;&#x5E08;&#x4EA7;&#x751F;&#x4E86;&#x6781;&#x5927;&#x7684;&#x9700;&#x6C42;&#x3002;&#x4F46;&#x662F;&#x6570;&#x5B57;&#x4EA7;&#x54C1;&#x548C;&#x5370;&#x5237;&#x4EA7;&#x54C1;&#x4E0D;&#x4E00;&#x6837;&#x3002;&#x6570;&#x5B57;&#x4EA7;&#x54C1;&#x663E;&#x793A;&#x5728;&#x4E0D;&#x540C;&#x5C3A;&#x5BF8;&#x548C;&#x52A8;&#x6001;&#x5185;&#x5BB9;&#x7684;&#x5C4F;&#x5E55;&#x4E0A;&#x3002;&#x6570;&#x5B57;&#x4EA7;&#x54C1;&#x5141;&#x8BB8;&#x7528;&#x6237;&#x5229;&#x7528;&#x52A8;&#x4F5C;&#x548C;&#x52A8;&#x753B;&#x4E0E;&#x5176;&#x5185;&#x5BB9;&#x4EA4;&#x4E92;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x6570;&#x5B57;&#x4EA7;&#x54C1;&#x5F80;&#x5F80;&#x5177;&#x6709;&#x65F6;&#x95F4;&#x903B;&#x8F91;&#xFF0C;&#x7EBF;&#x6027;&#x53D9;&#x4E8B;&#x88AB;&#x4E00;&#x7EC4;&#x590D;&#x6742;&#x7684;&#x72B6;&#x6001;&#x548C;&#x8FC7;&#x6E21;&#x52A8;&#x4F5C;&#x6240;&#x53D6;&#x4EE3;&#x3002;&#x603B;&#x4E4B;&#xFF0C;&#x6570;&#x5B57;&#x4EA7;&#x54C1;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x5171;&#x540C;&#x7684;&#x7279;&#x70B9;&#xFF1A;&#x5B83;&#x4EEC;&#x662F;&#x7528;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x521B;&#x5EFA;&#x7684;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x690D;&#x6839;&#x4E8E;&#x7F8E;&#x672F;&#x9886;&#x57DF;&#x7684;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x8270;&#x96BE;&#x7684;&#x8F6C;&#x53D8;&#x3002;&#x8BB8;&#x591A;&#x5E73;&#x9762;&#x8BBE;&#x8BA1;&#x5B66;&#x6821;&#x90FD;&#x91C7;&#x7528;&#x4E86;&#x7011;&#x5E03;&#x5F0F;&#x6559;&#x5B66;&#x7406;&#x5FF5;&#xFF0C;&#x5B66;&#x751F;&#x4EEC;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x81EA;&#x5DF1;&#x662F;&#x6709;&#x521B;&#x9020;&#x6027;&#x7684;&#x4EBA;&#xFF0C;&#x4E3A;&#x5176;&#x4ED6;&#x4EBA;&#x63D0;&#x51FA;&#x6784;&#x601D;&#x3002;&#x6BD5;&#x7ADF;&#xFF0C;&#x8FD9;&#x6BD4;&#x91C7;&#x7528;&#x4E00;&#x6574;&#x5957;&#x65B0;&#x6D41;&#x7A0B;&#x66F4;&#x5BB9;&#x6613;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x7684;&#x57FA;&#x672C;&#x95EE;&#x9898;&#x662F;&#x50CF;Illustrator&#x548C;Sketch&#x8FD9;&#x6837;&#x7684;&#x9759;&#x6001;&#x8BBE;&#x8BA1;&#x5DE5;&#x5177;&#x5728;&#x6570;&#x5B57;&#x7CFB;&#x7EDF;&#x539F;&#x578B;&#x8BBE;&#x8BA1;&#x4E2D;&#x5931;&#x8D25;&#x4E86;&#x3002;&#x5373;&#x4F7F;&#x9875;&#x9762;&#x9690;&#x55BB;&#x4ECD;&#x7136;&#x666E;&#x904D;&#x5B58;&#x5728;&#x4E8E;&#x7F51;&#x9875;&#x8BBE;&#x8BA1;&#x4E2D;&#xFF0C;&#x8FD9;&#x4F3C;&#x4E4E;&#x9650;&#x5236;&#x4E86;&#x5C06;&#x8BBE;&#x8BA1;&#x5B9A;&#x4E49;&#x4E3A;&#x9875;&#x9762;&#x7684;&#x6837;&#x5F0F;&#x3002; &#x56E0;&#x4E3A;&#x641C;&#x7D22;&#x9886;&#x57DF;google.com&#x7684;&#x5916;&#x89C2;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x7F51;&#x7AD9;&#x5417;&#xFF1F;&#x4F20;&#x7EDF;&#x7684;&#x7F8E;&#x672F;&#x662F;&#x975E;&#x5E38;&#x4E50;&#x89C2;&#x7684;&#xFF0C;&#x8FD9;&#x672C;&#x4E66;&#x5EFA;&#x7ACB;&#x5728;&#x8FD9;&#x4E2A;&#x57FA;&#x7840;&#x4E4B;&#x4E0A;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5728;&#x8BBE;&#x8BA1;&#x9886;&#x57DF;&#x548C;&#x6280;&#x672F;&#x7684;&#x65B0;&#x8FDB;&#x5C55;&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x957F;&#x8FBE;&#x4E00;&#x4E2A;&#x4E16;&#x7EAA;&#x7684;&#x8054;&#x7CFB;&#xFF0C;&#x5982;&#x679C;&#x5E73;&#x9762;&#x8BBE;&#x8BA1;&#x5E08;&#x4E0D;&#x719F;&#x6089;&#x8FD9;&#x79CD;&#x65B0;&#x7684;&#x6570;&#x5B57;&#x73B0;&#x5B9E;&#xFF0C;&#x5B83;&#x4EEC;&#x5C06;&#x53D8;&#x5F97;&#x65E0;&#x5173;&#x7D27;&#x8981;&#x3002;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x6709;&#x80FD;&#x529B;&#x7F16;&#x5199;&#x80FD;&#x591F;&#x4EA7;&#x751F;&#x6F02;&#x4EAE;&#x8BBE;&#x8BA1;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x672A;&#x6765;&#x7684;&#x8BBE;&#x8BA1;&#x5E08;&#x7406;&#x89E3;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x8FD9;&#x4E9B;&#x8BB2;&#x5E08;&#x4E00;&#x9879;&#x5FC5;&#x5907;&#x6280;&#x80FD;&#x3002;</p>
<p>&#x8FD9;&#x672C;&#x4E66;&#x8BB2;&#x8FF0;&#x4E86;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x95EE;&#x9898;&#x7684;&#x7B54;&#x6848;&#xFF1A;&#x5F53;&#x6211;&#x4EEC;&#x5C1D;&#x8BD5;&#x4F7F;&#x7528;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4F5C;&#x4E3A;&#x8BBE;&#x8BA1;&#x5E08;&#x7684;&#x5DE5;&#x5177;&#x91CD;&#x65B0;&#x5B9A;&#x4E49;&#x5E73;&#x9762;&#x8BBE;&#x8BA1;&#x8BFE;&#x7A0B;&#x65F6;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#xFF1F;&#x8FD9;&#x4E2A;&#x5F3A;&#x5927;&#x7684;&#x6982;&#x5FF5;&#x5305;&#x542B;&#x51E0;&#x4E2A;&#x65B9;&#x9762;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x5E73;&#x9762;&#x8BBE;&#x8BA1;&#x5E08;&#x603B;&#x662F;&#x5728;&#x4ED6;&#x4EEC;&#x7684;&#x5DE5;&#x4F5C;&#x4E2D;&#x4F7F;&#x7528;&#x7CFB;&#x7EDF;&#x3002;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x7F51;&#x683C;&#x7CFB;&#x7EDF;&#x6765;&#x5E73;&#x8861;&#x6211;&#x4EEC;&#x7684;&#x5E03;&#x5C40;&#x548C;&#x989C;&#x8272;&#x73AF;&#x6765;&#x9009;&#x62E9;&#x6709;&#x9002;&#x5F53;&#x8DDD;&#x79BB;&#x7684;&#x989C;&#x8272;&#x3002;&#x5386;&#x53F2;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#xFF0C;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x6CBB;&#x6108;&#x5BF9;&#x7A7A;&#x767D;&#x753B;&#x5E03;&#x7684;&#x6050;&#x60E7;&#xFF0C;&#x5C06;&#x8FD9;&#x4E9B;&#x60F3;&#x6CD5;&#x7F16;&#x7801;&#x5230;&#x5B9E;&#x9645;&#x8F6F;&#x4EF6;&#x4E2D;&#x662F;&#x4E00;&#x4E2A;&#x5F3A;&#x5927;&#x7684;&#x6982;&#x5FF5;&#x3002;&#x5176;&#x6B21;&#xFF0C;&#x4EE3;&#x7801;&#x4F7F;&#x8BBE;&#x8BA1;&#x4EBA;&#x5458;&#x80FD;&#x591F;&#x505A;&#x4ED6;&#x4EEC;&#x4EE5;&#x524D;&#x65E0;&#x6CD5;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x5728;&#x539F;&#x578B;&#x8BBE;&#x8BA1;&#x9636;&#x6BB5;&#xFF0C;&#x53EF;&#x4EE5;&#x66F4;&#x5FEB;&#x5730;&#x6D4B;&#x8BD5;&#x8BBE;&#x8BA1;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x63ED;&#x793A;&#x8BBE;&#x8BA1;&#x8005;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x7528;&#x94C5;&#x7B14;&#x521B;&#x5EFA;&#x7684;&#x968F;&#x673A;&#x5316;&#x8BBE;&#x8BA1;&#x3002;&#x7B2C;&#x4E09;&#xFF0C;&#x5B83;&#x4F7F;&#x8BBE;&#x8BA1;&#x4EBA;&#x5458;&#x80FD;&#x591F;&#x521B;&#x5EFA;&#x52A8;&#x6001;&#x7CFB;&#x7EDF;&#xFF0C;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x65F6;&#x95F4;&#xFF0C;&#x5730;&#x70B9;&#x6216;&#x7528;&#x9014;&#x6539;&#x53D8;&#x4ED6;&#x4EEC;&#x7684;&#x8BBE;&#x8BA1;&#x3002;&#x5728;&#x5899;&#x4E0A;&#x6295;&#x63B7;&#x8BBE;&#x8BA1;&#x8FDB;&#x884C;&#x751F;&#x4EA7;&#x662F;&#x5370;&#x5237;&#x9875;&#x9762;&#x7684;&#x9057;&#x7559;&#x95EE;&#x9898;&#xFF0C;&#x8BBE;&#x8BA1;&#x8FC7;&#x7A0B;&#x6CA1;&#x6709;&#x7406;&#x7531;&#x4EE5;&#x4EA7;&#x54C1;&#x7684;&#x8BDE;&#x751F;&#x800C;&#x7ED3;&#x675F;&#x3002;</p>
<p>&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x7ED3;&#x6784;&#x5C31;&#x50CF;&#x4E00;&#x7BC7;&#x5173;&#x4E8E;&#x5E73;&#x9762;&#x8BBE;&#x8BA1;&#x7684;&#x4ECB;&#x7ECD;&#x6027;&#x6587;&#x7AE0;&#xFF0C;&#x91CD;&#x70B9;&#x4ECB;&#x7ECD;&#x89C6;&#x89C9;&#x8BBE;&#x8BA1;&#x7684;&#x5143;&#x7D20;&#x4EE5;&#x53CA;&#x5B83;&#x4EEC;&#x4E0E;&#x7B97;&#x6CD5;&#x8BBE;&#x8BA1;&#x7684;&#x5173;&#x7CFB;&#x3002;&#x8FD9;&#x672C;&#x4E66;&#x662F;&#x4E3A;&#x5E0C;&#x671B;&#x6210;&#x4E3A;&#x66F4;&#x597D;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x8BBE;&#x8BA1;&#x5E08;&#x800C;&#x5199;&#x7684;&#xFF0C;&#x53CD;&#x4E4B;&#x4EA6;&#x7136;&#x3002;&#x5F53;&#x4F60;&#x9605;&#x8BFB;&#x672C;&#x6587;&#x65F6;&#xFF0C;&#x4F60;&#x4F1A;&#x6CE8;&#x610F;&#x5230;&#x5B83;&#x662F;&#x4ECE;&#x6700;&#x57FA;&#x672C;&#x7684;&#x5F00;&#x59CB;&#x3002;&#x4EE3;&#x7801;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x7EC3;&#x4E60;&#x4E5F;&#x5F88;&#x6709;&#x9650;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x611F;&#x89C9;&#x8FC7;&#x4E8E;&#x7B80;&#x5355;&#xFF0C;&#x8BF7;&#x7EE7;&#x7EED;&#x9605;&#x8BFB;&#x3002;&#x6211;&#x4EEC;&#x5F88;&#x5FEB;&#x5C31;&#x4F1A;&#x8C08;&#x5230;&#x66F4;&#x5177;&#x6311;&#x6218;&#x6027;&#x7684;&#x4E3B;&#x9898;&#xFF0C;&#x4F46;&#x8FD9;&#x4E9B;&#x57FA;&#x672C;&#x6982;&#x5FF5;&#x4E3A;&#x4E00;&#x4E9B;&#x66F4;&#x590D;&#x6742;&#x7684;&#x60F3;&#x6CD5;&#x5960;&#x5B9A;&#x4E86;&#x57FA;&#x7840;&#x3002;&#x5728;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x7ED3;&#x5C3E;&#xFF0C;&#x6211;&#x5E0C;&#x671B;&#x4F60;&#x5DF2;&#x7ECF;&#x5B66;&#x5230;&#x4E86;&#x4E24;&#x79CD;&#x65B0;&#x7684;&#x6280;&#x80FD;&#xFF1A;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x4EE3;&#x7801;&#x6765;&#x521B;&#x5EFA;&#x65B0;&#x7684;&#x6709;&#x8DA3;&#x7684;&#x5E73;&#x9762;&#x8BBE;&#x8BA1;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x8BC4;&#x4F30;&#x8FD9;&#x4E9B;&#x8BBE;&#x8BA1;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x6210;&#x529F;&#x7684;&#x3002;</p>
<p>&#x6211;&#x51B3;&#x5B9A;&#x5C06;<a href="http://p5js.org/" target="_blank">JavaScript&#x5E93;P5.js</a>&#x7528;&#x4E8E;&#x672C;&#x4E66;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x793A;&#x4F8B;&#x3002;&#x4E8B;&#x5B9E;&#x8BC1;&#x660E;&#xFF0C;&#x5BF9;&#x4E8E;&#x521D;&#x5B66;&#x8005;&#x6765;&#x8BF4;&#xFF0C;&#x5B83;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x7F16;&#x7A0B;&#x73AF;&#x5883;&#xFF0C;&#x540C;&#x65F6;&#x5BF9;&#x9AD8;&#x7EA7;&#x7528;&#x6237;&#x6765;&#x8BF4;&#x4E5F;&#x8DB3;&#x591F;&#x5F3A;&#x5927;&#x3002;&#x6211;&#x77E5;&#x9053;&#x4E0D;&#x53EF;&#x80FD;&#x9009;&#x62E9;&#x4E00;&#x79CD;&#x9002;&#x7528;&#x4E8E;&#x6BCF;&#x4E2A;&#x4EBA;&#x7684;&#x5355;&#x4E00;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;&#x8BFB;&#x8005;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x5177;&#x4F53;&#x9879;&#x76EE;&#x9700;&#x8981;&#x7684;&#x6027;&#x8D28;&#x5C06;&#x8FD9;&#x672C;&#x4E66;&#x4E2D;&#x7684;&#x60F3;&#x6CD5;&#x79FB;&#x690D;&#x5230;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x548C;&#x6846;&#x67B6;&#x4E2D;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x8BD5;&#x56FE;&#x628A;&#x6587;&#x6848;&#x5199;&#x5F97;&#x5C3D;&#x53EF;&#x80FD;&#x901A;&#x7528;&#x3002;&#x540C;&#x6837;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x8FD9;&#x4E0D;&#x662F;&#x4E00;&#x672C;&#x5173;&#x4E8E;&#x7F51;&#x9875;&#x8BBE;&#x8BA1;&#x7684;&#x4E66;&#x3002;&#x867D;&#x7136;&#x8FD9;&#x4E9B;&#x4F8B;&#x5B50;&#x53EF;&#x4EE5;&#x5D4C;&#x5165;&#x5230;&#x4EFB;&#x4F55;&#x7F51;&#x9875;&#x4E0A;&#xFF0C;&#x4F46;&#x8FD9;&#x4E9B;&#x6280;&#x672F;&#x4E5F;&#x53EF;&#x4EE5;&#x5E94;&#x7528;&#x4E8E;&#x5E94;&#x7528;&#x4E8E;&#x6570;&#x5B57;&#x548C;&#x5370;&#x5237;&#x5DE5;&#x4F5C;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x6211;&#x770B;&#x5230;&#x6211;&#x7684;&#x5B66;&#x751F;&#x591A;&#x5E74;&#x6765;&#x4F7F;&#x7528;&#x5B83;&#x521B;&#x4F5C;&#x4E86;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x5305;&#x62EC;&#x96D5;&#x5851;&#x3001;&#x7ED8;&#x753B;&#x3001;&#x65F6;&#x5C1A;&#x3001;&#x6444;&#x5F71;&#x3001;&#x6E38;&#x620F;&#x8BBE;&#x8BA1;&#x3001;&#x7F51;&#x9875;&#x8BBE;&#x8BA1;&#x548C;&#x5370;&#x5237;&#x54C1;&#x65B9;&#x9762;&#x7684;&#x9879;&#x76EE;&#x3002;</p>
<p>&#x8FD9;&#x672C;&#x4E66;&#x662F;&#x4E3A;&#x5177;&#x6709;JavaScript&#x7F16;&#x7A0B;&#x5165;&#x95E8;&#x77E5;&#x8BC6;&#x7684;&#x8BFB;&#x8005;&#x7F16;&#x5199;&#x7684;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#x65F6;&#x95F4;&#x7528;&#x4E8E;&#x89E3;&#x91CA;&#x53D8;&#x91CF;&#x3001;&#x51FD;&#x6570;&#x548C;&#x5FAA;&#x73AF;&#x7B49;&#x6982;&#x5FF5;&#x3002;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E9B;&#x8BFB;&#x8005;&#xFF0C;&#x6211;&#x5F3A;&#x70C8;&#x63A8;&#x8350;Daniel Shiffman&#x7684;<a href="https://www.youtube.com/playlist?list=PLRqwX-V7Uu6Zy51Q-x9tMWIv9cueOFTFA" target="_blank">YouTube&#x9891;&#x9053;&#xFF1A;Coding Rainbow</a>&#xFF0C;&#x5728;&#x90A3;&#x91CC;Dan&#x6BD4;&#x4EE5;&#x5F80;&#x4EFB;&#x4F55;&#x65F6;&#x5019;&#x90FD;&#x80FD;&#x66F4;&#x597D;&#x5730;&#x89E3;&#x91CA;&#x8FD9;&#x4E9B;&#x6982;&#x5FF5;&#x3002;&#x8FD9;&#x4E9B;&#x89C6;&#x9891;&#x8FD8;&#x5C06;&#x4ECB;&#x7ECD;P5&#x7F16;&#x7A0B;&#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;&#x3002;</p>
<p>&#x6211;&#x4E0D;&#x662F;&#x7B2C;&#x4E00;&#x4E2A;&#x5199;&#x5E73;&#x9762;&#x8BBE;&#x8BA1;&#x7CFB;&#x7EDF;&#x7684;&#x4F5C;&#x8005;&#xFF0C;&#x8FD9;&#x672C;&#x4E66;&#x5199;&#x4E86;&#x5F88;&#x591A;&#x6765;&#x81EA;&#x4E0D;&#x540C;&#x4F5C;&#x8005;&#x7684;&#x4EE4;&#x4EBA;&#x96BE;&#x4EE5;&#x7F6E;&#x4FE1;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x8FD9;&#x4E9B;&#x4F5C;&#x8005;&#x592A;&#x591A;&#xFF0C;&#x4E0D;&#x80FD;&#x5728;&#x8FD9;&#x91CC;&#x63D0;&#x53CA;&#x3002;&#x6211;&#x4E5F;&#x4E0D;&#x662F;&#x7B2C;&#x4E00;&#x4E2A;&#x5199;&#x4EE3;&#x7801;&#x548C;&#x5E73;&#x9762;&#x8BBE;&#x8BA1;&#x7684;&#x4EBA;&#xFF0C;&#x4F46;&#x6211;&#x5BF9;&#x8FD9;&#x4E00;&#x4E3B;&#x9898;&#x7684;&#x4E66;&#x611F;&#x5230;&#x5E76;&#x4E0D;&#x6EE1;&#x610F;&#xFF0C;&#x8FD9;&#x4E9B;&#x4E66;&#x4F3C;&#x4E4E;&#x5206;&#x4E3A;&#x4E24;&#x7C7B;&#xFF1A;&#x90A3;&#x4E9B;&#x4E13;&#x6CE8;&#x4E8E;&#x4EE3;&#x7801;&#x548C;&#x751F;&#x6210;&#x8BBE;&#x8BA1;&#x7684;&#x4EBA;&#x6839;&#x672C;&#x6CA1;&#x6709;&#x6559;&#x6388;&#x5E73;&#x9762;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#xFF0C;&#x800C;&#x90A3;&#x4E9B;&#x5C06;&#x8BA1;&#x7B97;&#x8BBE;&#x8BA1;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x573A;&#x666F;&#x6765;&#x5E86;&#x795D;&#xFF0C;&#x800C;&#x6CA1;&#x6709;&#x786E;&#x5B9A;&#x9879;&#x76EE;&#x7684;&#x5236;&#x4F5C;&#x65B9;&#x5F0F;&#x6216;&#x6210;&#x529F;&#x7684;&#x539F;&#x56E0;&#x3002;&#x9700;&#x8981;&#x7684;&#x6559;&#x80B2;&#x6750;&#x6599;&#xFF0C;&#x4EE5;&#x73B0;&#x4EE3;&#x7684;&#x65B9;&#x5F0F;&#x6559;&#x6388;&#x5E73;&#x9762;&#x8BBE;&#x8BA1;&#x7684;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5982;&#x679C;&#x5B83;&#x8FD8;&#x4E3A;&#x5B66;&#x751F;&#x63D0;&#x4F9B;&#x4E86;&#x6279;&#x8BC4;&#x6570;&#x5B57;&#x8BBE;&#x8BA1;&#x9879;&#x76EE;&#x7684;&#x5FC3;&#x7406;&#x6A21;&#x578B;&#x3002;</p>
<p>&#x6211;&#x9009;&#x62E9;&#x5728;&#x6CA1;&#x6709;&#x51FA;&#x7248;&#x5546;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x514D;&#x8D39;&#x5728;&#x7EBF;&#x51FA;&#x7248;&#x8FD9;&#x672C;&#x4E66;&#x3002;&#x5176;&#x4E3B;&#x8981;&#x539F;&#x56E0;&#x662F;&#x81EA;&#x7531;&#x3002;&#x5B83;&#x5141;&#x8BB8;&#x6211;&#x7F16;&#x5199;&#x548C;&#x8BBE;&#x8BA1;&#x6211;&#x4F1A;&#x9605;&#x8BFB;&#x7684;&#x4E66;&#x7684;&#x7C7B;&#x578B;&#x3002;&#x8FD9;&#x53CD;&#x6620;&#x5728;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x7ED3;&#x6784;&#x4E2D;&#xFF0C;&#x8FD9;&#x672C;&#x4E66;&#x7531;&#x8BB8;&#x591A;&#x8F83;&#x77ED;&#x7684;&#x7AE0;&#x8282;&#x7EC4;&#x6210;&#xFF0C;&#x8FD9;&#x4E9B;&#x7AE0;&#x8282;&#x5728;&#x7F51;&#x7EDC;&#x4E0A;&#x66F4;&#x5BB9;&#x6613;&#x9605;&#x8BFB;&#xFF0C;&#x5E76;&#x4E14;&#x6559;&#x5E08;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x5728;&#x6559;&#x5BA4;&#x4E2D;&#x91CD;&#x65B0;&#x7EC4;&#x5408;&#xFF08;&#x7531;&#x4E8E;&#x77E5;&#x8BC6;&#x5171;&#x4EAB;&#x8BB8;&#x53EF;&#x8BC1;&#xFF0C;&#x8FD9;&#x5B8C;&#x5168;&#x5408;&#x6CD5;&#xFF09;&#x3002;&#x6211;&#x5C06;&#x4EE5;&#x4E00;&#x79CD;&#x975E;&#x7EBF;&#x6027;&#x7684;&#x65B9;&#x5F0F;&#x7F16;&#x5199;&#x8FD9;&#x4E9B;&#x7AE0;&#x8282;&#xFF0C;&#x7814;&#x7A76;&#x6211;&#x5728;&#x7279;&#x5B9A;&#x65F6;&#x95F4;&#x53D1;&#x73B0;&#x6700;&#x6709;&#x8DA3;&#x7684;&#x4E3B;&#x9898;&#x3002;&#x5B8C;&#x6210;&#x7684;&#x4E66;&#x6CA1;&#x6709;&#x5177;&#x4F53;&#x7684;&#x622A;&#x6B62;&#x65E5;&#x671F;&#xFF0C;&#x5C3D;&#x7BA1;&#x6211;&#x5C06;&#x5176;&#x4F5C;&#x4E3A;&#x4E00;&#x9879;&#x5168;&#x804C;&#x5DE5;&#x4F5C;&#x3002;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x6E90;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x5728;<a href="https://github.com/runemadsen/programmingdesignsystems.com/tree/master/content" target="_blank">GitHub</a>&#x4E0A;&#x627E;&#x5230;&#xFF0C;&#x6211;&#x9F13;&#x52B1;&#x6240;&#x6709;&#x7684;&#x8BFB;&#x8005;&#x63D0;&#x4EA4;&#x95EE;&#x9898;&#x6216;&#x4F7F;&#x7528;&#x7F16;&#x8F91;&#x7684;&#x8BF7;&#x6C42;&#x3002;&#x8981;&#x53CA;&#x65F6;&#x4E86;&#x89E3;&#x672C;&#x4E66;&#x7684;&#x8FDB;&#x5C55;&#x60C5;&#x51B5;&#xFF0C;&#x4F60;&#x8FD8;&#x53EF;&#x4EE5;&#x8BA2;&#x9605;&#x5B9E;&#x65F6;&#x8D44;&#x8BAF;&#x3002;</p>
<p>&#x6211;&#x8981;&#x611F;&#x8C22;&#x4E00;&#x7FA4;&#x4EBA;&#xFF0C;&#x6CA1;&#x6709;&#x4ED6;&#x4EEC;&#xFF0C;&#x8FD9;&#x672C;&#x4E66;&#x5C31;&#x4E0D;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x3002;2009&#x5E74;&#xFF0C;&#x5F53;&#x6211;&#x642C;&#x5230;&#x7EBD;&#x7EA6;&#xFF0C;&#x5728;&#x7EBD;&#x7EA6;&#x5927;&#x5B66;&#x7684;&#x4E92;&#x52A8;&#x7535;&#x4FE1;&#x9879;&#x76EE;&#x5B66;&#x4E60;&#x65F6;&#xFF0C;&#x6211;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x6A21;&#x7CCA;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x60F3;&#x8981;&#x5728;&#x827A;&#x672F;&#x548C;&#x4EE3;&#x7801;&#x7684;&#x4EA4;&#x6C47;&#x5904;&#x5DE5;&#x4F5C;&#x3002;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x4E3B;&#x8981;&#x4E3A;&#x5E7F;&#x544A;&#x5236;&#x4F5C;&#x6A2A;&#x5E45;&#x7684;Flash&#x5F00;&#x53D1;&#x8005;&#xFF0C;&#x5728;ITP&#x5DE5;&#x4F5C;&#x7684;&#x4E24;&#x5E74;&#x5B8C;&#x5168;&#x6539;&#x53D8;&#x4E86;&#x6211;&#x7684;&#x60F3;&#x6CD5;&#x3002;&#x6211;&#x8981;&#x611F;&#x8C22;&#x4E39;&#xB7;&#x5965;&#x6C99;&#x5229;&#x6587;(DanO&#x2018;Sullivan)&#x5BF9;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x5DE8;&#x5927;&#x652F;&#x6301;&#xFF0C;&#x8BE5;&#x9879;&#x76EE;&#x59CB;&#x4E8E;ITP&#x7684;&#x4E00;&#x95E8;&#x8BFE;&#x7A0B;&#xFF0C;&#x76EE;&#x524D;&#x6B63;&#x5728;&#x7F16;&#x5199;&#x6210;&#x4E00;&#x672C;&#x4E66;&#xFF0C;&#x800C;&#x6211;&#x5F53;&#x65F6;&#x662F;&#x90A3;&#x91CC;&#x7684;&#x4E00;&#x540D;&#x7814;&#x7A76;&#x4EBA;&#x5458;&#x3002;&#x6CA1;&#x6709;&#x4E39;&#x5C3C;&#x5C14;&#xB7;&#x5E0C;&#x592B;&#x66FC;(DanielShiffman)&#x7684;&#x5E2E;&#x52A9;&#x548C;&#x6307;&#x5BFC;&#xFF0C;&#x8FD9;&#x672C;&#x4E66;&#x5C31;&#x4E0D;&#x4F1A;&#x5B58;&#x5728;&#xFF0C;&#x4ED6;&#x7684;&#x5DE5;&#x4F5C;&#x6FC0;&#x52B1;&#x4E86;&#x6210;&#x5343;&#x4E0A;&#x4E07;&#x7684;&#x5B66;&#x751F;&#x5B66;&#x4E60;&#x4EE3;&#x7801;&#x3002;&#x6211;&#x60F3;&#x611F;&#x8C22;&#x65AF;&#x56FE;&#x5C14;&#x7279;&#x53F2;&#x5BC6;&#x65AF;&#xFF0C;&#x4ED6;&#x6559;&#x7684;&#x53EF;&#x89C6;&#x5316;&#x6570;&#x636E;&#x7C7B;&#xFF0C;&#x4ECE;&#x65E9;&#x671F;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x4E5F;&#x662F;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x5F00;&#x59CB;&#x3002;&#x6211;&#x611F;&#x8C22;&#x6240;&#x6709;&#x5E2E;&#x52A9;&#x5851;&#x9020;&#x8FD9;&#x4E9B;&#x60F3;&#x6CD5;&#x7684;ITP&#x6559;&#x5458;&#x548C;&#x6821;&#x53CB;&#xFF0C;&#x5305;&#x62EC;Patrick Hebron&#x3001;Greg Borenstein&#x3001;Clay Shirky&#x3001;Danny Rozin&#x3001;Tom Igoe&#x3001;David Nolen&#x3001;Gabe Barcia-Colombo&#x548C;George Agudow&#x3002;&#x7279;&#x522B;&#x611F;&#x8C22;P5.js&#x7684;&#x539F;&#x4F5C;&#x8005;Lauren McCarthy&#xFF0C;&#x4EE5;&#x53CA;Casey Reas&#x548C;Ben Fry&#x5728;&#x5BA1;&#x9605;&#x65B9;&#x9762;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x6211;&#x8981;&#x611F;&#x8C22;&#x94B1;&#x5FB7;&#x52D2;&#xB7;&#x4E9A;&#x4F2F;&#x62C9;&#x7F55;&#x5728;&#x8272;&#x5F69;&#x7A7A;&#x95F4;&#x4E00;&#x7AE0;&#x4E2D;&#x7684;&#x8BE6;&#x7EC6;&#x7F16;&#x8F91;&#xFF0C;&#x611F;&#x8C22;&#x514B;&#x83B1;&#x5C14;&#xB7;&#x79D1;&#x5C14;&#x5C3C;-&#x6C83;&#x5C14;&#x666E;&#x56DE;&#x7B54;&#x4E86;&#x6211;&#x5173;&#x4E8E;&#x53EF;&#x8BBF;&#x95EE;&#x6027;&#x7684;&#x4F17;&#x591A;&#x95EE;&#x9898;&#xFF0C;&#x611F;&#x8C22;&#x739B;&#x4E3D;&#x4E9A;&#xB7;&#x9A6C;&#x5C14;&#x5361;&#x5FB7;&#xB7;&#x8A79;&#x68EE;&#x4E0D;&#x61C8;&#x7684;&#x7F16;&#x8F91;&#x5DE5;&#x4F5C;&#x3002;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x5B66;&#x4E60;&#x5427;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"设计系统编程","level":"1.1","depth":1,"next":{"title":"0.设计系统","level":"1.2","depth":1,"ref":"","articles":[{"title":"0.1.什么是设计系统","level":"1.2.1","depth":2,"path":"chapters/0.md","ref":"chapters/0.md","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"README.md","mtime":"2019-09-27T11:55:33.757Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-09-30T10:31:33.641Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

